/**
 * Created by lenovo on 2016/10/28.
 */
var data = [{"id": 1012, "name": "不丹", "provinces": []}, {
    "id": 1017,
    "name": "中国",
    "provinces": [{
        "id": 10185,
        "name": "上海",
        "cities": [{"id": 100400, "name": "卢湾"}, {"id": 100397, "name": "嘉定"}, {
            "id": 100394,
            "name": "奉贤"
        }, {"id": 100391, "name": "宝山"}, {"id": 100393, "name": "崇明"}, {"id": 100406, "name": "徐汇"}, {
            "id": 100402,
            "name": "普陀"
        }, {"id": 100407, "name": "杨浦"}, {"id": 100405, "name": "松江"}, {"id": 100403, "name": "浦东新区"}, {
            "id": 100395,
            "name": "虹口"
        }, {"id": 100399, "name": "金山"}, {"id": 100392, "name": "长宁"}, {"id": 100401, "name": "闵行"}, {
            "id": 100408,
            "name": "闸北"
        }, {"id": 100404, "name": "青浦"}, {"id": 100398, "name": "静安"}, {"id": 100396, "name": "黄浦"}]
    }, {
        "id": 10192,
        "name": "云南",
        "cities": [{"id": 100508, "name": "临沧"}, {"id": 100507, "name": "丽江"}, {
            "id": 100501,
            "name": "保山"
        }, {"id": 100503, "name": "大理"}, {"id": 100504, "name": "德宏"}, {"id": 100509, "name": "怒江"}, {
            "id": 100513,
            "name": "文山"
        }, {"id": 100506, "name": "昆明"}, {"id": 100516, "name": "昭通"}, {"id": 100510, "name": "普洱"}, {
            "id": 100511,
            "name": "曲靖"
        }, {"id": 100502, "name": "楚雄"}, {"id": 100515, "name": "玉溪"}, {"id": 100512, "name": "红河"}, {
            "id": 100514,
            "name": "西双版纳"
        }, {"id": 100505, "name": "迪庆"}]
    }, {
        "id": 10175,
        "name": "内蒙古",
        "cities": [{"id": 100288, "name": "乌兰察布"}, {"id": 100295, "name": "乌海"}, {
            "id": 100296,
            "name": "兴安"
        }, {"id": 100286, "name": "包头"}, {"id": 100293, "name": "呼伦贝尔"}, {"id": 100292, "name": "呼和浩特"}, {
            "id": 100287,
            "name": "巴彦淖尔"
        }, {"id": 100289, "name": "赤峰"}, {"id": 100294, "name": "通辽"}, {"id": 100290, "name": "鄂尔多斯"}, {
            "id": 100291,
            "name": "锡林郭勒"
        }, {"id": 100285, "name": "阿拉善"}]
    }, {
        "id": 10161,
        "name": "北京",
        "cities": [{"id": 100052, "name": "东城"}, {"id": 100054, "name": "丰台"}, {
            "id": 100051,
            "name": "大兴"
        }, {"id": 100058, "name": "密云"}, {"id": 100059, "name": "平谷"}, {"id": 100064, "name": "延庆"}, {
            "id": 100056,
            "name": "怀柔"
        }, {"id": 100053, "name": "房山"}, {"id": 100049, "name": "昌平"}, {"id": 100050, "name": "朝阳"}, {
            "id": 100055,
            "name": "海淀"
        }, {"id": 100060, "name": "石景山"}, {"id": 100063, "name": "西城"}, {"id": 100062, "name": "通州"}, {
            "id": 100057,
            "name": "门头沟"
        }, {"id": 100061, "name": "顺义"}]
    }, {
        "id": 10188,
        "name": "台湾",
        "cities": [{"id": 100459, "name": "云林县"}, {"id": 100450, "name": "南投县"}, {
            "id": 100456,
            "name": "台东县"
        }, {"id": 100453, "name": "台中市"}, {"id": 100455, "name": "台北市"}, {"id": 100454, "name": "台南市"}, {
            "id": 100443,
            "name": "嘉义县"
        }, {"id": 100442, "name": "嘉义市"}, {"id": 100448, "name": "基隆市"}, {"id": 100458, "name": "宜兰县"}, {
            "id": 100452,
            "name": "屏东县"
        }, {"id": 100441, "name": "彰化县"}, {"id": 101146, "name": "新北市"}, {"id": 100445, "name": "新竹县"}, {
            "id": 100444,
            "name": "新竹市"
        }, {"id": 100457, "name": "桃园县"}, {"id": 100451, "name": "澎湖县"}, {"id": 100446, "name": "花莲县"}, {
            "id": 100449,
            "name": "苗栗县"
        }, {"id": 101148, "name": "连江县"}, {"id": 101147, "name": "金门县"}, {"id": 100447, "name": "高雄市"}]
    }, {
        "id": 10178,
        "name": "吉林",
        "cities": [{"id": 100322, "name": "吉林"}, {"id": 100325, "name": "四平"}, {
            "id": 100329,
            "name": "延边"
        }, {"id": 100324, "name": "松原"}, {"id": 100327, "name": "白城"}, {"id": 100328, "name": "白山"}, {
            "id": 100323,
            "name": "辽源"
        }, {"id": 100326, "name": "通化"}, {"id": 100321, "name": "长春"}]
    }, {
        "id": 10187,
        "name": "四川",
        "cities": [{"id": 100427, "name": "乐山"}, {"id": 100433, "name": "内江"}, {
            "id": 100428,
            "name": "凉山"
        }, {"id": 100432, "name": "南充"}, {"id": 100438, "name": "宜宾"}, {"id": 100434, "name": "巴中"}, {
            "id": 100425,
            "name": "广元"
        }, {"id": 100426, "name": "广安"}, {"id": 100422, "name": "德阳"}, {"id": 100421, "name": "成都"}, {
            "id": 100435,
            "name": "攀枝花"
        }, {"id": 100429, "name": "泸州"}, {"id": 100424, "name": "甘孜"}, {"id": 100430, "name": "眉山"}, {
            "id": 100431,
            "name": "绵阳"
        }, {"id": 100439, "name": "自贡"}, {"id": 100440, "name": "资阳"}, {"id": 100423, "name": "达州"}, {
            "id": 100436,
            "name": "遂宁"
        }, {"id": 100420, "name": "阿坝"}, {"id": 100437, "name": "雅安"}]
    }, {
        "id": 10189,
        "name": "天津",
        "cities": [{"id": 100472, "name": "东丽"}, {"id": 100469, "name": "北辰"}, {
            "id": 100467,
            "name": "南开"
        }, {"id": 100470, "name": "和平"}, {"id": 100468, "name": "宁河"}, {"id": 100460, "name": "宝坻"}, {
            "id": 100475,
            "name": "武清"
        }, {"id": 100462, "name": "河东"}, {"id": 100463, "name": "河北"}, {"id": 100473, "name": "河西"}, {
            "id": 100465,
            "name": "津南"
        }, {"id": 100461, "name": "滨海新区"}, {"id": 100471, "name": "红桥"}, {"id": 100466, "name": "蓟县"}, {
            "id": 100474,
            "name": "西青"
        }, {"id": 100464, "name": "静海"}]
    }, {
        "id": 10181,
        "name": "宁夏",
        "cities": [{"id": 100355, "name": "中卫"}, {"id": 100353, "name": "吴忠"}, {
            "id": 100351,
            "name": "固原"
        }, {"id": 100352, "name": "石嘴山"}, {"id": 100354, "name": "银川"}]
    }, {
        "id": 10160,
        "name": "安徽",
        "cities": [{"id": 100034, "name": "亳州"}, {"id": 100043, "name": "六安"}, {
            "id": 100039,
            "name": "合肥"
        }, {"id": 100032, "name": "安庆"}, {"id": 100048, "name": "宣城"}, {"id": 100045, "name": "宿州"}, {
            "id": 100035,
            "name": "巢湖"
        }, {"id": 100036, "name": "池州"}, {"id": 100040, "name": "淮北"}, {"id": 100041, "name": "淮南"}, {
            "id": 100037,
            "name": "滁州"
        }, {"id": 100047, "name": "芜湖"}, {"id": 100033, "name": "蚌埠"}, {"id": 100046, "name": "铜陵"}, {
            "id": 100038,
            "name": "阜阳"
        }, {"id": 100044, "name": "马鞍山"}, {"id": 100042, "name": "黄山"}]
    }, {
        "id": 10184,
        "name": "山东",
        "cities": [{"id": 100375, "name": "东营"}, {"id": 100381, "name": "临沂"}, {
            "id": 100387,
            "name": "威海"
        }, {"id": 100385, "name": "德州"}, {"id": 100383, "name": "日照"}, {"id": 100389, "name": "枣庄"}, {
            "id": 100384,
            "name": "泰安"
        }, {"id": 100377, "name": "济南"}, {"id": 100378, "name": "济宁"}, {"id": 100390, "name": "淄博"}, {
            "id": 100374,
            "name": "滨州"
        }, {"id": 100386, "name": "潍坊"}, {"id": 100388, "name": "烟台"}, {"id": 100380, "name": "聊城"}, {
            "id": 100379,
            "name": "莱芜"
        }, {"id": 100376, "name": "菏泽"}, {"id": 100382, "name": "青岛"}]
    }, {
        "id": 10186,
        "name": "山西",
        "cities": [{"id": 100413, "name": "临汾"}, {"id": 100414, "name": "吕梁"}, {
            "id": 100410,
            "name": "大同"
        }, {"id": 100416, "name": "太原"}, {"id": 100417, "name": "忻州"}, {"id": 100412, "name": "晋中"}, {
            "id": 100411,
            "name": "晋城"
        }, {"id": 100415, "name": "朔州"}, {"id": 100419, "name": "运城"}, {"id": 100409, "name": "长治"}, {
            "id": 100418,
            "name": "阳泉"
        }]
    }, {
        "id": 10165,
        "name": "广东",
        "cities": [{"id": 100130, "name": "东莞"}, {"id": 100148, "name": "中山"}, {
            "id": 100145,
            "name": "云浮"
        }, {"id": 100131, "name": "佛山"}, {"id": 100132, "name": "广州"}, {"id": 100134, "name": "惠州"}, {
            "id": 100136,
            "name": "揭阳"
        }, {"id": 100138, "name": "梅州"}, {"id": 100140, "name": "汕头"}, {"id": 100141, "name": "汕尾"}, {
            "id": 100135,
            "name": "江门"
        }, {"id": 100133, "name": "河源"}, {"id": 100143, "name": "深圳"}, {"id": 100139, "name": "清远"}, {
            "id": 100146,
            "name": "湛江"
        }, {"id": 100129, "name": "潮州"}, {"id": 100149, "name": "珠海"}, {"id": 100147, "name": "肇庆"}, {
            "id": 100137,
            "name": "茂名"
        }, {"id": 100144, "name": "阳江"}, {"id": 100142, "name": "韶关"}]
    }, {
        "id": 10166,
        "name": "广西",
        "cities": [{"id": 100151, "name": "北海"}, {"id": 100161, "name": "南宁"}, {
            "id": 100152,
            "name": "崇左"
        }, {"id": 100155, "name": "来宾"}, {"id": 100160, "name": "柳州"}, {"id": 100157, "name": "桂林"}, {
            "id": 100162,
            "name": "梧州"
        }, {"id": 100158, "name": "河池"}, {"id": 100163, "name": "玉林"}, {"id": 100150, "name": "百色"}, {
            "id": 100156,
            "name": "贵港"
        }, {"id": 100159, "name": "贺州"}, {"id": 100153, "name": "钦州"}, {"id": 100154, "name": "防城港"}]
    }, {
        "id": 10191,
        "name": "新疆",
        "cities": [{"id": 100499, "name": "乌鲁木齐"}, {"id": 100500, "name": "五家渠"}, {
            "id": 100492,
            "name": "伊犁"
        }, {"id": 100495, "name": "克孜勒苏"}, {"id": 100493, "name": "克拉玛依"}, {
            "id": 100487,
            "name": "博尔塔拉"
        }, {"id": 100498, "name": "吐鲁番"}, {"id": 100491, "name": "和田"}, {"id": 100490, "name": "哈密"}, {
            "id": 100494,
            "name": "喀什"
        }, {"id": 100489, "name": "图木舒克"}, {"id": 100497, "name": "塔城"}, {"id": 100486, "name": "巴音郭楞"}, {
            "id": 100488,
            "name": "昌吉"
        }, {"id": 100496, "name": "石河子"}, {"id": 100483, "name": "阿克苏"}, {"id": 100484, "name": "阿勒泰"}, {
            "id": 100485,
            "name": "阿拉尔"
        }]
    }, {
        "id": 10176,
        "name": "江苏",
        "cities": [{"id": 100300, "name": "南京"}, {"id": 100301, "name": "南通"}, {
            "id": 100302,
            "name": "宿迁"
        }, {"id": 100297, "name": "常州"}, {"id": 100306, "name": "徐州"}, {"id": 100308, "name": "扬州"}, {
            "id": 100305,
            "name": "无锡"
        }, {"id": 100304, "name": "泰州"}, {"id": 100298, "name": "淮安"}, {"id": 100307, "name": "盐城"}, {
            "id": 100303,
            "name": "苏州"
        }, {"id": 100299, "name": "连云港"}, {"id": 100309, "name": "镇江"}]
    }, {
        "id": 10177,
        "name": "江西",
        "cities": [{"id": 100317, "name": "上饶"}, {"id": 100314, "name": "九江"}, {
            "id": 100315,
            "name": "南昌"
        }, {"id": 100312, "name": "吉安"}, {"id": 100319, "name": "宜春"}, {"id": 100310, "name": "抚州"}, {
            "id": 100318,
            "name": "新余"
        }, {"id": 100313, "name": "景德镇"}, {"id": 100316, "name": "萍乡"}, {"id": 100311, "name": "赣州"}, {
            "id": 100320,
            "name": "鹰潭"
        }]
    }, {
        "id": 10169,
        "name": "河北",
        "cities": [{"id": 100194, "name": "保定"}, {"id": 100202, "name": "唐山"}, {
            "id": 100199,
            "name": "廊坊"
        }, {"id": 100204, "name": "张家口"}, {"id": 100196, "name": "承德"}, {"id": 100195, "name": "沧州"}, {
            "id": 100201,
            "name": "石家庄"
        }, {"id": 100200, "name": "秦皇岛"}, {"id": 100198, "name": "衡水"}, {"id": 100203, "name": "邢台"}, {
            "id": 100197,
            "name": "邯郸"
        }]
    }, {
        "id": 10171,
        "name": "河南",
        "cities": [{"id": 100228, "name": "三门峡"}, {"id": 100231, "name": "信阳"}, {
            "id": 100226,
            "name": "南阳"
        }, {"id": 100234, "name": "周口"}, {"id": 100229, "name": "商丘"}, {"id": 100218, "name": "安阳"}, {
            "id": 100225,
            "name": "平顶山"
        }, {"id": 100222, "name": "开封"}, {"id": 100230, "name": "新乡"}, {"id": 100224, "name": "洛阳"}, {
            "id": 100221,
            "name": "济源"
        }, {"id": 100223, "name": "漯河"}, {"id": 100227, "name": "濮阳"}, {"id": 100220, "name": "焦作"}, {
            "id": 100232,
            "name": "许昌"
        }, {"id": 100233, "name": "郑州"}, {"id": 100235, "name": "驻马店"}, {"id": 100219, "name": "鹤壁"}]
    }, {
        "id": 10193,
        "name": "浙江",
        "cities": [{"id": 100521, "name": "丽水"}, {"id": 100525, "name": "台州"}, {
            "id": 100519,
            "name": "嘉兴"
        }, {"id": 100522, "name": "宁波"}, {"id": 100517, "name": "杭州"}, {"id": 100526, "name": "温州"}, {
            "id": 100518,
            "name": "湖州"
        }, {"id": 100524, "name": "绍兴"}, {"id": 100527, "name": "舟山"}, {"id": 100523, "name": "衢州"}, {
            "id": 100520,
            "name": "金华"
        }]
    }, {
        "id": 10168,
        "name": "海南",
        "cities": [{"id": 100183, "name": "万宁"}, {"id": 100189, "name": "三亚"}, {
            "id": 100177,
            "name": "东方"
        }, {"id": 100181, "name": "中沙"}, {"id": 100186, "name": "临高"}, {"id": 100184, "name": "乐东"}, {
            "id": 100178,
            "name": "五指山"
        }, {"id": 100173, "name": "保亭"}, {"id": 100176, "name": "儋州"}, {"id": 100185, "name": "南沙"}, {
            "id": 100180,
            "name": "定安"
        }, {"id": 100190, "name": "屯昌"}, {"id": 100191, "name": "文昌"}, {"id": 100174, "name": "昌江"}, {
            "id": 100179,
            "name": "海口"
        }, {"id": 100175, "name": "澄迈"}, {"id": 100188, "name": "琼中"}, {"id": 100187, "name": "琼海"}, {
            "id": 100192,
            "name": "白沙"
        }, {"id": 100193, "name": "西沙"}, {"id": 100182, "name": "陵水"}]
    }, {
        "id": 10173,
        "name": "湖北",
        "cities": [{"id": 100254, "name": "仙桃"}, {"id": 100262, "name": "十堰"}, {
            "id": 100266,
            "name": "咸宁"
        }, {"id": 100264, "name": "天门"}, {"id": 100267, "name": "孝感"}, {"id": 100270, "name": "宜昌"}, {
            "id": 100255,
            "name": "恩施"
        }, {"id": 100265, "name": "武汉"}, {"id": 100260, "name": "潜江"}, {"id": 100261, "name": "神农架"}, {
            "id": 100259,
            "name": "荆州"
        }, {"id": 100258, "name": "荆门"}, {"id": 100268, "name": "襄阳"}, {"id": 100256, "name": "鄂州"}, {
            "id": 100263,
            "name": "随州"
        }, {"id": 100257, "name": "黄冈"}, {"id": 100269, "name": "黄石"}]
    }, {
        "id": 10174,
        "name": "湖南",
        "cities": [{"id": 100276, "name": "娄底"}, {"id": 100282, "name": "岳阳"}, {
            "id": 100271,
            "name": "常德"
        }, {"id": 100283, "name": "张家界"}, {"id": 100275, "name": "怀化"}, {"id": 100284, "name": "株洲"}, {
            "id": 100281,
            "name": "永州"
        }, {"id": 100278, "name": "湘潭"}, {"id": 100279, "name": "湘西"}, {"id": 100280, "name": "益阳"}, {
            "id": 100274,
            "name": "衡阳"
        }, {"id": 100277, "name": "邵阳"}, {"id": 100273, "name": "郴州"}, {"id": 100272, "name": "长沙"}]
    }, {
        "id": 10180,
        "name": "澳门",
        "cities": [{"id": 100347, "name": "圣安多尼堂区"}, {"id": 100344, "name": "大堂区"}, {
            "id": 100349,
            "name": "望德堂区"
        }, {"id": 100350, "name": "氹仔"}, {"id": 100346, "name": "花地玛堂区"}, {"id": 100345, "name": "路环岛"}, {
            "id": 100348,
            "name": "风顺堂区"
        }]
    }, {
        "id": 10164,
        "name": "甘肃",
        "cities": [{"id": 100121, "name": "临夏"}, {"id": 100120, "name": "兰州市"}, {
            "id": 100117,
            "name": "嘉峪关"
        }, {"id": 100126, "name": "天水"}, {"id": 100115, "name": "定西"}, {"id": 100123, "name": "平凉"}, {
            "id": 100124,
            "name": "庆阳"
        }, {"id": 100128, "name": "张掖"}, {"id": 100127, "name": "武威"}, {"id": 100116, "name": "甘南"}, {
            "id": 100125,
            "name": "白银"
        }, {"id": 100119, "name": "酒泉"}, {"id": 100118, "name": "金昌"}, {"id": 100122, "name": "陇南"}]
    }, {
        "id": 10163,
        "name": "福建",
        "cities": [{"id": 100112, "name": "三明"}, {"id": 100108, "name": "南平"}, {
            "id": 100113,
            "name": "厦门"
        }, {"id": 100109, "name": "宁德"}, {"id": 100111, "name": "泉州"}, {"id": 100114, "name": "漳州"}, {
            "id": 100106,
            "name": "福州"
        }, {"id": 100110, "name": "莆田"}, {"id": 100107, "name": "龙岩"}]
    }, {
        "id": 10190,
        "name": "西藏",
        "cities": [{"id": 100481, "name": "山南"}, {"id": 100477, "name": "拉萨"}, {
            "id": 100482,
            "name": "日喀则"
        }, {"id": 100480, "name": "昌都"}, {"id": 100479, "name": "林芝"}, {"id": 100478, "name": "那曲"}, {
            "id": 100476,
            "name": "阿里"
        }]
    }, {
        "id": 10167,
        "name": "贵州",
        "cities": [{"id": 100168, "name": "六盘水"}, {"id": 100164, "name": "安顺"}, {
            "id": 100165,
            "name": "毕节"
        }, {"id": 100166, "name": "贵阳"}, {"id": 100167, "name": "遵义"}, {"id": 100172, "name": "铜仁"}, {
            "id": 100169,
            "name": "黔东南"
        }, {"id": 100170, "name": "黔南"}, {"id": 100171, "name": "黔西南"}]
    }, {
        "id": 10179,
        "name": "辽宁",
        "cities": [{"id": 100334, "name": "丹东"}, {"id": 100333, "name": "大连"}, {
            "id": 100335,
            "name": "抚顺"
        }, {"id": 100332, "name": "朝阳"}, {"id": 100331, "name": "本溪"}, {"id": 100341, "name": "沈阳"}, {
            "id": 100340,
            "name": "盘锦"
        }, {"id": 100343, "name": "营口"}, {"id": 100337, "name": "葫芦岛"}, {"id": 100339, "name": "辽阳"}, {
            "id": 100342,
            "name": "铁岭"
        }, {"id": 100338, "name": "锦州"}, {"id": 100336, "name": "阜新"}, {"id": 100330, "name": "鞍山"}]
    }, {
        "id": 10162,
        "name": "重庆",
        "cities": [{"id": 100095, "name": "万州"}, {"id": 100085, "name": "万盛"}, {
            "id": 100094,
            "name": "两江新区"
        }, {"id": 100074, "name": "丰都"}, {"id": 100079, "name": "九龙坡"}, {"id": 100103, "name": "云阳"}, {
            "id": 100067,
            "name": "北碚"
        }, {"id": 100091, "name": "南岸"}, {"id": 100083, "name": "南川"}, {"id": 100090, "name": "双桥"}, {
            "id": 100065,
            "name": "合川"
        }, {"id": 100073, "name": "垫江"}, {"id": 100069, "name": "城口"}, {"id": 100071, "name": "大渡口"}, {
            "id": 100072,
            "name": "大足"
        }, {"id": 100075, "name": "奉节"}, {"id": 100097, "name": "巫山"}, {"id": 100098, "name": "巫溪"}, {
            "id": 100066,
            "name": "巴南"
        }, {"id": 100080, "name": "开县"}, {"id": 100084, "name": "彭水"}, {"id": 100105, "name": "忠县"}, {
            "id": 100081,
            "name": "梁平"
        }, {"id": 100096, "name": "武隆"}, {"id": 100100, "name": "永川"}, {"id": 100077, "name": "江北"}, {
            "id": 100078,
            "name": "江津"
        }, {"id": 100089, "name": "沙坪坝"}, {"id": 100076, "name": "涪陵"}, {"id": 100104, "name": "渝中"}, {
            "id": 100102,
            "name": "渝北"
        }, {"id": 100093, "name": "潼南"}, {"id": 100068, "name": "璧山"}, {"id": 100070, "name": "石柱"}, {
            "id": 100099,
            "name": "秀山"
        }, {"id": 100087, "name": "綦江"}, {"id": 100088, "name": "荣昌"}, {"id": 100101, "name": "酉阳"}, {
            "id": 100092,
            "name": "铜梁"
        }, {"id": 100082, "name": "长寿"}, {"id": 100086, "name": "黔江"}]
    }, {
        "id": 10183,
        "name": "陕西",
        "cities": [{"id": 100371, "name": "咸阳"}, {"id": 100367, "name": "商洛"}, {
            "id": 100364,
            "name": "安康"
        }, {"id": 100365, "name": "宝鸡"}, {"id": 100372, "name": "延安"}, {"id": 100373, "name": "榆林"}, {
            "id": 100366,
            "name": "汉中"
        }, {"id": 100369, "name": "渭南"}, {"id": 100370, "name": "西安"}, {"id": 100368, "name": "铜川"}]
    }, {
        "id": 10182,
        "name": "青海",
        "cities": [{"id": 100356, "name": "果洛"}, {"id": 100357, "name": "海东"}, {
            "id": 100361,
            "name": "海北"
        }, {"id": 100358, "name": "海南"}, {"id": 100359, "name": "海西"}, {"id": 100363, "name": "玉树"}, {
            "id": 100362,
            "name": "西宁"
        }, {"id": 100360, "name": "黄南"}]
    }, {
        "id": 10172,
        "name": "香港",
        "cities": [{"id": 100237, "name": "东区"}, {"id": 100236, "name": "中西区"}, {
            "id": 100239,
            "name": "九龙城区"
        }, {"id": 100253, "name": "元朗区"}, {"id": 100242, "name": "北区"}, {"id": 100246, "name": "南区"}, {
            "id": 100247,
            "name": "大埔区"
        }, {"id": 100249, "name": "屯门区"}, {"id": 100245, "name": "沙田区"}, {"id": 100252, "name": "油尖旺区"}, {
            "id": 100244,
            "name": "深水埗区"
        }, {"id": 100250, "name": "湾仔区"}, {"id": 100238, "name": "离岛区"}, {"id": 100248, "name": "荃湾区"}, {
            "id": 100240,
            "name": "葵青区"
        }, {"id": 100243, "name": "西贡区"}, {"id": 100241, "name": "观塘区"}, {"id": 100251, "name": "黄大仙区"}]
    }, {
        "id": 10170,
        "name": "黑龙江",
        "cities": [{"id": 100214, "name": "七台河"}, {"id": 100217, "name": "伊春"}, {
            "id": 100209,
            "name": "佳木斯"
        }, {"id": 100215, "name": "双鸭山"}, {"id": 100206, "name": "哈尔滨"}, {"id": 100211, "name": "大兴安岭"}, {
            "id": 100205,
            "name": "大庆"
        }, {"id": 100212, "name": "牡丹江"}, {"id": 100216, "name": "绥化"}, {"id": 100210, "name": "鸡西"}, {
            "id": 100207,
            "name": "鹤岗"
        }, {"id": 100208, "name": "黑河"}, {"id": 100213, "name": "齐齐哈尔"}]
    }]
}, {
    "id": 1080,
    "name": "中国台湾",
    "provinces": [{"id": 11118, "name": "云林县", "cities": []}, {"id": 11109, "name": "南投县", "cities": []}, {
        "id": 11115,
        "name": "台东县",
        "cities": []
    }, {"id": 11112, "name": "台中市", "cities": []}, {"id": 11114, "name": "台北市", "cities": []}, {
        "id": 11113,
        "name": "台南市",
        "cities": []
    }, {"id": 11102, "name": "嘉义县", "cities": []}, {"id": 11101, "name": "嘉义市", "cities": []}, {
        "id": 11107,
        "name": "基隆市",
        "cities": []
    }, {"id": 11117, "name": "宜兰县", "cities": []}, {"id": 11111, "name": "屏东县", "cities": []}, {
        "id": 11100,
        "name": "彰化县",
        "cities": []
    }, {"id": 11272, "name": "新北市", "cities": []}, {"id": 11104, "name": "新竹县", "cities": []}, {
        "id": 11103,
        "name": "新竹市",
        "cities": []
    }, {"id": 11116, "name": "桃园县", "cities": []}, {"id": 11110, "name": "澎湖县", "cities": []}, {
        "id": 11105,
        "name": "花莲县",
        "cities": []
    }, {"id": 11108, "name": "苗栗县", "cities": []}, {"id": 11274, "name": "连江县", "cities": []}, {
        "id": 11273,
        "name": "金门县",
        "cities": []
    }, {"id": 11106, "name": "高雄市", "cities": []}]
}, {
    "id": 1054,
    "name": "中国澳门",
    "provinces": [{"id": 10635, "name": "圣安多尼堂区", "cities": []}, {
        "id": 10632,
        "name": "大堂区",
        "cities": []
    }, {"id": 10637, "name": "望德堂区", "cities": []}, {"id": 10638, "name": "氹仔", "cities": []}, {
        "id": 10634,
        "name": "花地玛堂区",
        "cities": []
    }, {"id": 10633, "name": "路环岛", "cities": []}, {"id": 10636, "name": "风顺堂区", "cities": []}]
}, {
    "id": 1031,
    "name": "中国香港",
    "provinces": [{"id": 10314, "name": "东区", "cities": []}, {"id": 10313, "name": "中西区", "cities": []}, {
        "id": 10316,
        "name": "九龙城区",
        "cities": []
    }, {"id": 10330, "name": "元朗区", "cities": []}, {"id": 10319, "name": "北区", "cities": []}, {
        "id": 10323,
        "name": "南区",
        "cities": []
    }, {"id": 10324, "name": "大埔区", "cities": []}, {"id": 10326, "name": "屯门区", "cities": []}, {
        "id": 10322,
        "name": "沙田区",
        "cities": []
    }, {"id": 10329, "name": "油尖旺区", "cities": []}, {"id": 10321, "name": "深水埗区", "cities": []}, {
        "id": 10327,
        "name": "湾仔区",
        "cities": []
    }, {"id": 10315, "name": "离岛区", "cities": []}, {"id": 10325, "name": "荃湾区", "cities": []}, {
        "id": 10317,
        "name": "葵青区",
        "cities": []
    }, {"id": 10320, "name": "西贡区", "cities": []}, {"id": 10318, "name": "观塘区", "cities": []}, {
        "id": 10328,
        "name": "黄大仙区",
        "cities": []
    }]
}, {"id": 1098, "name": "中非共和国", "provinces": []}, {"id": 1107, "name": "丹麦", "provinces": []}, {
    "id": 1081,
    "name": "乌克兰",
    "provinces": [{"id": 11124, "name": "伊万－弗兰科夫州", "cities": []}, {
        "id": 11135,
        "name": "克里米亚自治共和国",
        "cities": []
    }, {"id": 11119, "name": "切尔卡瑟", "cities": []}, {"id": 11120, "name": "切尔尼戈夫", "cities": []}, {
        "id": 11121,
        "name": "切尔诺夫策",
        "cities": []
    }, {"id": 11131, "name": "利沃夫", "cities": []}, {"id": 11130, "name": "卢甘斯克", "cities": []}, {
        "id": 11125,
        "name": "哈尔科夫",
        "cities": []
    }, {"id": 11128, "name": "基洛夫格勒", "cities": []}, {"id": 11129, "name": "基辅", "cities": []}, {
        "id": 11141,
        "name": "外喀尔巴阡",
        "cities": []
    }, {"id": 11132, "name": "尼古拉耶夫", "cities": []}, {"id": 11142, "name": "扎波罗热", "cities": []}, {
        "id": 11138,
        "name": "捷尔诺波尔",
        "cities": []
    }, {"id": 11133, "name": "敖德萨", "cities": []}, {"id": 11139, "name": "文尼察", "cities": []}, {
        "id": 11143,
        "name": "日托米尔",
        "cities": []
    }, {"id": 11140, "name": "沃伦", "cities": []}, {"id": 11134, "name": "波尔塔瓦", "cities": []}, {
        "id": 11122,
        "name": "第聂伯罗波得罗夫斯克",
        "cities": []
    }, {"id": 11136, "name": "罗夫诺", "cities": []}, {"id": 11137, "name": "苏梅", "cities": []}, {
        "id": 11126,
        "name": "赫尔松州",
        "cities": []
    }, {"id": 11127, "name": "赫梅利尼茨基", "cities": []}, {"id": 11123, "name": "顿涅茨克", "cities": []}]
}, {"id": 1165, "name": "乌兹别克斯坦", "provinces": []}, {"id": 1163, "name": "乌干达", "provinces": []}, {
    "id": 1164,
    "name": "乌拉圭",
    "provinces": []
}, {"id": 1025, "name": "乔治亚", "provinces": []}, {"id": 1167, "name": "也门", "provinces": []}, {
    "id": 1089,
    "name": "亚美尼亚",
    "provinces": []
}, {"id": 1119, "name": "以色列", "provinces": []}, {"id": 1037, "name": "伊拉克", "provinces": []}, {
    "id": 1038,
    "name": "伊朗",
    "provinces": []
}, {
    "id": 1070,
    "name": "俄罗斯",
    "provinces": [{"id": 10867, "name": "下诺夫哥罗德", "cities": []}, {
        "id": 10894,
        "name": "乌兰乌德",
        "cities": []
    }, {"id": 10896, "name": "乌斯季奥尔登斯基", "cities": []}, {"id": 10893, "name": "乌法", "cities": []}, {
        "id": 10895,
        "name": "乌里扬诺夫斯克",
        "cities": []
    }, {"id": 10839, "name": "伊万诺沃", "cities": []}, {"id": 10838, "name": "伊尔库茨克", "cities": []}, {
        "id": 10840,
        "name": "伊热夫斯克",
        "cities": []
    }, {"id": 10901, "name": "伏尔加格勒", "cities": []}, {"id": 10830, "name": "伯力", "cities": []}, {
        "id": 10857,
        "name": "克孜勒",
        "cities": []
    }, {"id": 10853, "name": "克拉斯诺亚尔斯克", "cities": []}, {"id": 10852, "name": "克拉斯诺达尔", "cities": []}, {
        "id": 10848,
        "name": "克麦罗沃",
        "cities": []
    }, {"id": 10831, "name": "切博克萨雷", "cities": []}, {"id": 10833, "name": "切尔克斯克", "cities": []}, {
        "id": 10858,
        "name": "利佩茨克",
        "cities": []
    }, {"id": 10826, "name": "别尔哥罗德", "cities": []}, {"id": 10845, "name": "加里宁格勒", "cities": []}, {
        "id": 10844,
        "name": "南萨哈林斯克",
        "cities": []
    }, {"id": 10846, "name": "卡卢加", "cities": []}, {"id": 10843, "name": "叶卡捷林堡", "cities": []}, {
        "id": 10847,
        "name": "喀山",
        "cities": []
    }, {"id": 10890, "name": "图拉", "cities": []}, {"id": 10885, "name": "圣彼得堡", "cities": []}, {
        "id": 10888,
        "name": "坦波夫",
        "cities": []
    }, {"id": 10835, "name": "埃利斯塔", "cities": []}, {"id": 10850, "name": "基洛夫", "cities": []}, {
        "id": 10873,
        "name": "奔萨",
        "cities": []
    }, {"id": 10871, "name": "奥伦堡", "cities": []}, {"id": 10870, "name": "奥廖尔", "cities": []}, {
        "id": 10825,
        "name": "巴尔瑙尔",
        "cities": []
    }, {"id": 10828, "name": "布拉戈维申斯克", "cities": []}, {"id": 10829, "name": "布良斯克", "cities": []}, {
        "id": 10872,
        "name": "帕拉纳",
        "cities": []
    }, {"id": 10855, "name": "库尔干", "cities": []}, {"id": 10856, "name": "库尔斯克", "cities": []}, {
        "id": 10854,
        "name": "库德姆卡尔",
        "cities": []
    }, {"id": 10899, "name": "弗拉基米尔", "cities": []}, {"id": 10898, "name": "弗拉季高加索", "cities": []}, {
        "id": 10874,
        "name": "彼尔姆",
        "cities": []
    }, {"id": 10875, "name": "彼得罗巴甫洛夫斯克", "cities": []}, {"id": 10876, "name": "彼得罗扎沃茨克", "cities": []}, {
        "id": 10836,
        "name": "戈尔诺－阿尔泰斯克",
        "cities": []
    }, {"id": 10889, "name": "托木斯克", "cities": []}, {"id": 10864, "name": "摩尔曼斯克", "cities": []}, {
        "id": 10886,
        "name": "斯塔夫罗波尔",
        "cities": []
    }, {"id": 10884, "name": "斯摩棱斯克", "cities": []}, {"id": 10868, "name": "新西伯利亚", "cities": []}, {
        "id": 10877,
        "name": "普斯科夫",
        "cities": []
    }, {"id": 10837, "name": "格罗兹尼", "cities": []}, {"id": 10879, "name": "梁赞", "cities": []}, {
        "id": 10827,
        "name": "比罗比詹",
        "cities": []
    }, {"id": 10849, "name": "汉特－曼西斯克", "cities": []}, {"id": 10902, "name": "沃洛格达", "cities": []}, {
        "id": 10903,
        "name": "沃罗涅什",
        "cities": []
    }, {"id": 10900, "name": "海参崴", "cities": []}, {"id": 10891, "name": "特维尔", "cities": []}, {
        "id": 10887,
        "name": "瑟克特夫卡尔",
        "cities": []
    }, {"id": 10892, "name": "秋明", "cities": []}, {"id": 10851, "name": "科斯特罗马", "cities": []}, {
        "id": 10904,
        "name": "约什卡尔奥拉",
        "cities": []
    }, {"id": 10865, "name": "纳尔奇克", "cities": []}, {"id": 10866, "name": "纳里扬马尔", "cities": []}, {
        "id": 10863,
        "name": "莫斯科",
        "cities": []
    }, {"id": 10882, "name": "萨兰斯克", "cities": []}, {"id": 10880, "name": "萨列哈尔德", "cities": []}, {
        "id": 10883,
        "name": "萨拉托夫",
        "cities": []
    }, {"id": 10881, "name": "萨马拉", "cities": []}, {"id": 10897, "name": "诺夫哥罗德", "cities": []}, {
        "id": 10834,
        "name": "赤塔",
        "cities": []
    }, {"id": 10832, "name": "车里雅宾斯克", "cities": []}, {"id": 10862, "name": "迈科普", "cities": []}, {
        "id": 10869,
        "name": "鄂木斯克",
        "cities": []
    }, {"id": 10823, "name": "阿尔汉格尔斯克", "cities": []}, {"id": 10820, "name": "阿巴坎", "cities": []}, {
        "id": 10824,
        "name": "阿斯特拉罕",
        "cities": []
    }, {"id": 10822, "name": "阿纳德尔", "cities": []}, {"id": 10821, "name": "阿金斯科耶", "cities": []}, {
        "id": 10841,
        "name": "雅库茨克",
        "cities": []
    }, {"id": 10842, "name": "雅罗斯拉夫尔", "cities": []}, {"id": 10878, "name": "顿河畔罗斯托夫", "cities": []}, {
        "id": 10859,
        "name": "马加丹",
        "cities": []
    }, {"id": 10860, "name": "马加斯", "cities": []}, {"id": 10861, "name": "马哈奇卡拉", "cities": []}]
}, {"id": 1093, "name": "保加利亚", "provinces": []}, {"id": 1118, "name": "克罗地亚", "provinces": []}, {
    "id": 1030,
    "name": "关岛",
    "provinces": []
}, {"id": 1029, "name": "冈比亚", "provinces": []}, {"id": 1039, "name": "冰岛", "provinces": []}, {
    "id": 1048,
    "name": "列支敦士登",
    "provinces": []
}, {"id": 1015, "name": "刚果民主共和国", "provinces": []}, {"id": 1049, "name": "利比亚", "provinces": []}, {
    "id": 1130,
    "name": "利比里亚",
    "provinces": []
}, {
    "id": 1014,
    "name": "加拿大",
    "provinces": [{"id": 10126, "name": "三河城", "cities": []}, {"id": 10110, "name": "伊魁特", "cities": []}, {
        "id": 10113,
        "name": "伦敦",
        "cities": []
    }, {"id": 10102, "name": "卡里加里", "cities": []}, {"id": 10108, "name": "哈利法克斯", "cities": []}, {
        "id": 10109,
        "name": "哈密尔顿",
        "cities": []
    }, {"id": 10122, "name": "圣卡塔琳娜", "cities": []}, {"id": 10119, "name": "圣约翰斯", "cities": []}, {
        "id": 10107,
        "name": "圭尔夫",
        "cities": []
    }, {"id": 10105, "name": "埃德蒙顿", "cities": []}, {"id": 10111, "name": "基劳纳", "cities": []}, {
        "id": 10101,
        "name": "基奇纳",
        "cities": []
    }, {"id": 10104, "name": "夏洛特敦", "cities": []}, {"id": 10125, "name": "多伦多", "cities": []}, {
        "id": 10115,
        "name": "奥沙瓦",
        "cities": []
    }, {"id": 10100, "name": "巴里", "cities": []}, {"id": 10103, "name": "布列塔尼角", "cities": []}, {
        "id": 10106,
        "name": "弗雷德里顿",
        "cities": []
    }, {"id": 10129, "name": "怀特霍斯", "cities": []}, {"id": 10124, "name": "桑德贝", "cities": []}, {
        "id": 10116,
        "name": "渥太华",
        "cities": []
    }, {"id": 10127, "name": "温哥华", "cities": []}, {"id": 10131, "name": "温尼伯", "cities": []}, {
        "id": 10130,
        "name": "温莎",
        "cities": []
    }, {"id": 10128, "name": "维多利亚", "cities": []}, {"id": 10132, "name": "耶洛奈夫", "cities": []}, {
        "id": 10121,
        "name": "舍布鲁克",
        "cities": []
    }, {"id": 10123, "name": "萨德伯里", "cities": []}, {"id": 10120, "name": "萨斯卡通", "cities": []}, {
        "id": 10114,
        "name": "蒙特利尔",
        "cities": []
    }, {"id": 10118, "name": "里贾纳", "cities": []}, {"id": 10112, "name": "金斯敦", "cities": []}, {
        "id": 10099,
        "name": "阿伯茨福",
        "cities": []
    }, {"id": 10117, "name": "魁北克", "cities": []}]
}, {"id": 1114, "name": "加纳", "provinces": []}, {
    "id": 1033,
    "name": "匈牙利",
    "provinces": [{"id": 10350, "name": "佐洛", "cities": []}, {"id": 10344, "name": "佩斯", "cities": []}, {
        "id": 10341,
        "name": "加兹-纳杰孔-索尔诺克",
        "cities": []
    }, {"id": 10334, "name": "包尔绍德-奥包乌伊-曾普伦", "cities": []}, {"id": 10332, "name": "巴兰尼亚", "cities": []}, {
        "id": 10331,
        "name": "巴奇-基什孔",
        "cities": []
    }, {"id": 10335, "name": "布达佩斯", "cities": []}, {"id": 10347, "name": "托尔瑙", "cities": []}, {
        "id": 10338,
        "name": "杰尔-莫松-肖普朗",
        "cities": []
    }, {"id": 10348, "name": "沃什", "cities": []}, {"id": 10336, "name": "琼格拉德", "cities": []}, {
        "id": 10342,
        "name": "科马罗姆",
        "cities": []
    }, {"id": 10346, "name": "索博尔奇-索特马尔-贝拉格", "cities": []}, {"id": 10345, "name": "绍莫吉", "cities": []}, {
        "id": 10349,
        "name": "维斯普雷姆",
        "cities": []
    }, {"id": 10343, "name": "诺格拉德", "cities": []}, {"id": 10339, "name": "豪伊杜-比豪尔", "cities": []}, {
        "id": 10333,
        "name": "贝凯什",
        "cities": []
    }, {"id": 10337, "name": "费耶尔", "cities": []}, {"id": 10340, "name": "赫维什", "cities": []}]
}, {"id": 1055, "name": "北马里亚纳群岛", "provinces": []}, {
    "id": 1086,
    "name": "南非",
    "provinces": [{"id": 11232, "name": "东伦敦", "cities": []}, {"id": 11222, "name": "东巴克利", "cities": []}, {
        "id": 11264,
        "name": "乌伦迪",
        "cities": []
    }, {"id": 11265, "name": "乌姆塔塔", "cities": []}, {"id": 11233, "name": "乔治", "cities": []}, {
        "id": 11251,
        "name": "伊丽莎白港",
        "cities": []
    }, {"id": 11271, "name": "伍斯特", "cities": []}, {"id": 11239, "name": "克莱克斯多普", "cities": []}, {
        "id": 11255,
        "name": "兰德方丹",
        "cities": []
    }, {"id": 11246, "name": "内尔斯普雷特", "cities": []}, {"id": 11257, "name": "利斯滕堡", "cities": []}, {
        "id": 11262,
        "name": "图拉马哈谢",
        "cities": []
    }, {"id": 11234, "name": "基雅尼", "cities": []}, {"id": 11243, "name": "姆库泽", "cities": []}, {
        "id": 11248,
        "name": "尼尔斯特隆",
        "cities": []
    }, {"id": 11227, "name": "布隆克斯特斯普利特", "cities": []}, {"id": 11225, "name": "布隆方丹", "cities": []}, {
        "id": 11226,
        "name": "布雷达斯多普",
        "cities": []
    }, {"id": 11240, "name": "库鲁曼", "cities": []}, {"id": 11228, "name": "开普敦", "cities": []}, {
        "id": 11267,
        "name": "弗里尼欣",
        "cities": []
    }, {"id": 11268, "name": "弗雷堡", "cities": []}, {"id": 11250, "name": "彼德斯堡", "cities": []}, {
        "id": 11249,
        "name": "彼德马里茨堡",
        "cities": []
    }, {"id": 11231, "name": "德班", "cities": []}, {"id": 11229, "name": "德阿尔", "cities": []}, {
        "id": 11261,
        "name": "托霍延杜",
        "cities": []
    }, {"id": 11254, "name": "昆士敦", "cities": []}, {"id": 11235, "name": "格罗布莱斯达尔", "cities": []}, {
        "id": 11253,
        "name": "比勒陀利亚",
        "cities": []
    }, {"id": 11224, "name": "比索", "cities": []}, {"id": 11236, "name": "特克索波", "cities": []}, {
        "id": 11263,
        "name": "特隆普斯堡",
        "cities": []
    }, {"id": 11256, "name": "理查兹湾", "cities": []}, {"id": 11259, "name": "瑟孔达", "cities": []}, {
        "id": 11244,
        "name": "穆里斯堡",
        "cities": []
    }, {"id": 11242, "name": "米德尔堡", "cities": []}, {"id": 11237, "name": "约翰内斯堡", "cities": []}, {
        "id": 11247,
        "name": "纽卡斯尔",
        "cities": []
    }, {"id": 11245, "name": "艾利弗山", "cities": []}, {"id": 11241, "name": "莱迪史密斯", "cities": []}, {
        "id": 11258,
        "name": "萨索尔堡",
        "cities": []
    }, {"id": 11223, "name": "西博福特", "cities": []}, {"id": 11252, "name": "谢普斯通港", "cities": []}, {
        "id": 11260,
        "name": "跳羚",
        "cities": []
    }, {"id": 11230, "name": "邓迪", "cities": []}, {"id": 11238, "name": "金伯利", "cities": []}, {
        "id": 11266,
        "name": "阿平顿",
        "cities": []
    }, {"id": 11269, "name": "韦尔科姆", "cities": []}, {"id": 11270, "name": "韦茨肖克", "cities": []}]
}, {"id": 1013, "name": "博茨瓦纳", "provinces": []}, {"id": 1150, "name": "卡塔尔", "provinces": []}, {
    "id": 1152,
    "name": "卢旺达",
    "provinces": []
}, {"id": 1132, "name": "卢森堡", "provinces": []}, {
    "id": 1036,
    "name": "印度",
    "provinces": [{"id": 10474, "name": "乌代布尔", "cities": []}, {"id": 10422, "name": "克塔克", "cities": []}, {
        "id": 10463,
        "name": "兰契",
        "cities": []
    }, {"id": 10445, "name": "加尔各答", "cities": []}, {"id": 10428, "name": "加济阿巴德", "cities": []}, {
        "id": 10446,
        "name": "勒克瑙",
        "cities": []
    }, {"id": 10415, "name": "博帕尔", "cities": []}, {"id": 10447, "name": "卢迪亚纳", "cities": []}, {
        "id": 10435,
        "name": "印多尔",
        "cities": []
    }, {"id": 10430, "name": "古尔加翁", "cities": []}, {"id": 10431, "name": "古瓦哈提", "cities": []}, {
        "id": 10421,
        "name": "哥印拜陀",
        "cities": []
    }, {"id": 10434, "name": "因帕尔", "cities": []}, {"id": 10443, "name": "坎普尔", "cities": []}, {
        "id": 10471,
        "name": "塔那",
        "cities": []
    }, {"id": 10465, "name": "塞勒姆", "cities": []}, {"id": 10466, "name": "塞康德拉巴德", "cities": []}, {
        "id": 10412,
        "name": "奥兰加巴德",
        "cities": []
    }, {"id": 10451, "name": "孟买", "cities": []}, {"id": 10458, "name": "巴特那", "cities": []}, {
        "id": 10414,
        "name": "巴罗达",
        "cities": []
    }, {"id": 10416, "name": "布巴内斯瓦尔", "cities": []}, {"id": 10423, "name": "德拉敦", "cities": []}, {
        "id": 10444,
        "name": "戈尔",
        "cities": []
    }, {"id": 10462, "name": "拉杰果德", "cities": []}, {"id": 10437, "name": "斋普尔", "cities": []}, {
        "id": 10469,
        "name": "斯利那加",
        "cities": []
    }, {"id": 10455, "name": "新德里", "cities": []}, {"id": 10418, "name": "昌迪加尔", "cities": []}, {
        "id": 10459,
        "name": "本地治里",
        "cities": []
    }, {"id": 10425, "name": "杜加浦", "cities": []}, {"id": 10429, "name": "果阿", "cities": []}, {
        "id": 10438,
        "name": "查谟",
        "cities": []
    }, {"id": 10426, "name": "法里达巴德", "cities": []}, {"id": 10417, "name": "波卡罗", "cities": []}, {
        "id": 10460,
        "name": "浦那",
        "cities": []
    }, {"id": 10433, "name": "海德拉巴", "cities": []}, {"id": 10457, "name": "潘吉姆", "cities": []}, {
        "id": 10441,
        "name": "焦特布尔",
        "cities": []
    }, {"id": 10472, "name": "特里凡得琅", "cities": []}, {"id": 10413, "name": "班加罗尔", "cities": []}, {
        "id": 10432,
        "name": "瓜廖尔",
        "cities": []
    }, {"id": 10475, "name": "瓦拉纳西", "cities": []}, {"id": 10427, "name": "甘地讷格尔", "cities": []}, {
        "id": 10420,
        "name": "科钦",
        "cities": []
    }, {"id": 10478, "name": "維沙哈巴南", "cities": []}, {"id": 10477, "name": "维杰亚瓦达", "cities": []}, {
        "id": 10407,
        "name": "艾哈迈达巴德",
        "cities": []
    }, {"id": 10408, "name": "艾藻尔", "cities": []}, {"id": 10449, "name": "芒格洛尔", "cities": []}, {
        "id": 10470,
        "name": "苏拉",
        "cities": []
    }, {"id": 10473, "name": "蒂鲁吉拉伯利", "cities": []}, {"id": 10468, "name": "西里古里", "cities": []}, {
        "id": 10467,
        "name": "西隆",
        "cities": []
    }, {"id": 10440, "name": "詹谢普尔", "cities": []}, {"id": 10456, "name": "诺伊达", "cities": []}, {
        "id": 10439,
        "name": "贾姆纳格尔",
        "cities": []
    }, {"id": 10436, "name": "贾巴尔普尔", "cities": []}, {"id": 10442, "name": "贾朗达尔", "cities": []}, {
        "id": 10461,
        "name": "赖布尔",
        "cities": []
    }, {"id": 10452, "name": "迈索尔", "cities": []}, {"id": 10424, "name": "迪马普尔", "cities": []}, {
        "id": 10453,
        "name": "那格浦尔",
        "cities": []
    }, {"id": 10454, "name": "邦纳西克", "cities": []}, {"id": 10419, "name": "金奈", "cities": []}, {
        "id": 10405,
        "name": "阿加尔塔拉",
        "cities": []
    }, {"id": 10411, "name": "阿姆利则", "cities": []}, {"id": 10410, "name": "阿拉哈巴德", "cities": []}, {
        "id": 10406,
        "name": "阿格拉",
        "cities": []
    }, {"id": 10409, "name": "阿里格尔", "cities": []}, {"id": 10476, "name": "韦洛尔", "cities": []}, {
        "id": 10450,
        "name": "马尔高",
        "cities": []
    }, {"id": 10448, "name": "马杜赖", "cities": []}, {"id": 10464, "name": "鲁尔克拉", "cities": []}]
}, {
    "id": 1034,
    "name": "印度尼西亚",
    "provinces": [{"id": 10353, "name": "万丹", "cities": []}, {"id": 10365, "name": "东加里曼丹", "cities": []}, {
        "id": 10370,
        "name": "东努沙登加拉",
        "cities": []
    }, {"id": 10374, "name": "东南苏拉威西", "cities": []}, {"id": 10362, "name": "东爪哇", "cities": []}, {
        "id": 10364,
        "name": "中加里曼丹",
        "cities": []
    }, {"id": 10361, "name": "中爪哇", "cities": []}, {"id": 10373, "name": "中苏拉威西", "cities": []}, {
        "id": 10351,
        "name": "亚齐",
        "cities": []
    }, {"id": 10357, "name": "伊里安查亚", "cities": []}, {"id": 10375, "name": "北苏拉威西", "cities": []}, {
        "id": 10378,
        "name": "北苏门答腊",
        "cities": []
    }, {"id": 10363, "name": "南加里曼丹", "cities": []}, {"id": 10372, "name": "南苏拉威西", "cities": []}, {
        "id": 10377,
        "name": "南苏门答腊",
        "cities": []
    }, {"id": 10359, "name": "占碑", "cities": []}, {"id": 10356, "name": "大雅加达首都特区", "cities": []}, {
        "id": 10352,
        "name": "巴厘",
        "cities": []
    }, {"id": 10371, "name": "廖内", "cities": []}, {"id": 10355, "name": "日惹特区", "cities": []}, {
        "id": 10354,
        "name": "明古鲁",
        "cities": []
    }, {"id": 10367, "name": "楠榜", "cities": []}, {"id": 10369, "name": "西努沙登加拉", "cities": []}, {
        "id": 10360,
        "name": "西爪哇",
        "cities": []
    }, {"id": 10376, "name": "西苏门答腊", "cities": []}, {"id": 10366, "name": "邦加－勿里洞群岛", "cities": []}, {
        "id": 10358,
        "name": "雅加达",
        "cities": []
    }, {"id": 10368, "name": "马鲁古", "cities": []}]
}, {"id": 1116, "name": "危地马拉", "provinces": []}, {"id": 1109, "name": "厄瓜多尔", "provinces": []}, {
    "id": 1111,
    "name": "厄立特里亚",
    "provinces": []
}, {"id": 1104, "name": "古巴", "provinces": []}, {"id": 1123, "name": "吉尔吉斯斯坦", "provinces": []}, {
    "id": 1106,
    "name": "吉布提",
    "provinces": []
}, {"id": 1126, "name": "哈萨克斯坦", "provinces": []}, {"id": 1101, "name": "哥伦比亚", "provinces": []}, {
    "id": 1102,
    "name": "哥斯达黎加",
    "provinces": []
}, {"id": 1100, "name": "喀麦隆", "provinces": []}, {
    "id": 1078,
    "name": "土耳其",
    "provinces": [{"id": 11096, "name": "乌萨克", "cities": []}, {"id": 11045, "name": "乔鲁姆", "cities": []}, {
        "id": 11046,
        "name": "代尼兹利",
        "cities": []
    }, {"id": 11062, "name": "伊兹密尔", "cities": []}, {"id": 11058, "name": "伊切尔", "cities": []}, {
        "id": 11061,
        "name": "伊斯坦布尔",
        "cities": []
    }, {"id": 11060, "name": "伊斯帕尔塔", "cities": []}, {"id": 11059, "name": "伊迪尔", "cities": []}, {
        "id": 11070,
        "name": "克勒克卡莱",
        "cities": []
    }, {"id": 11072, "name": "克尔谢希尔", "cities": []}, {"id": 11081, "name": "内夫谢希尔", "cities": []}, {
        "id": 11097,
        "name": "凡",
        "cities": []
    }, {"id": 11053, "name": "加济安泰普", "cities": []}, {"id": 11040, "name": "博卢", "cities": []}, {
        "id": 11066,
        "name": "卡尔斯",
        "cities": []
    }, {"id": 11065, "name": "卡拉曼", "cities": []}, {"id": 11064, "name": "卡拉比克", "cities": []}, {
        "id": 11067,
        "name": "卡斯塔莫努",
        "cities": []
    }, {"id": 11063, "name": "卡赫拉曼马拉什", "cities": []}, {"id": 11054, "name": "吉雷松", "cities": []}, {
        "id": 11056,
        "name": "哈卡里",
        "cities": []
    }, {"id": 11057, "name": "哈塔伊", "cities": []}, {"id": 11050, "name": "埃尔津詹", "cities": []}, {
        "id": 11051,
        "name": "埃尔祖鲁姆",
        "cities": []
    }, {"id": 11049, "name": "埃拉泽", "cities": []}, {"id": 11052, "name": "埃斯基谢希尔", "cities": []}, {
        "id": 11048,
        "name": "埃迪尔内",
        "cities": []
    }, {"id": 11069, "name": "基利斯", "cities": []}, {"id": 11083, "name": "奥尔杜", "cities": []}, {
        "id": 11028,
        "name": "安卡拉",
        "cities": []
    }, {"id": 11029, "name": "安塔利亚", "cities": []}, {"id": 11099, "name": "宗古尔达克", "cities": []}, {
        "id": 11038,
        "name": "宾格尔",
        "cities": []
    }, {"id": 11082, "name": "尼代", "cities": []}, {"id": 11055, "name": "居米什哈内", "cities": []}, {
        "id": 11075,
        "name": "屈塔希亚",
        "cities": []
    }, {"id": 11036, "name": "巴伊布尔特", "cities": []}, {"id": 11033, "name": "巴勒克埃西尔", "cities": []}, {
        "id": 11034,
        "name": "巴尔腾",
        "cities": []
    }, {"id": 11035, "name": "巴特曼", "cities": []}, {"id": 11041, "name": "布尔杜尔", "cities": []}, {
        "id": 11042,
        "name": "布尔萨",
        "cities": []
    }, {"id": 11068, "name": "开塞利", "cities": []}, {"id": 11043, "name": "恰纳卡莱", "cities": []}, {
        "id": 11092,
        "name": "托卡特",
        "cities": []
    }, {"id": 11095, "name": "拉飞", "cities": []}, {"id": 11044, "name": "昌克勒", "cities": []}, {
        "id": 11071,
        "name": "柯克拉雷利",
        "cities": []
    }, {"id": 11039, "name": "比特利斯", "cities": []}, {"id": 11037, "name": "比莱吉克", "cities": []}, {
        "id": 11091,
        "name": "泰基尔达",
        "cities": []
    }, {"id": 11093, "name": "特拉布宗", "cities": []}, {"id": 11074, "name": "科尼亚", "cities": []}, {
        "id": 11073,
        "name": "科贾埃利",
        "cities": []
    }, {"id": 11080, "name": "穆什", "cities": []}, {"id": 11079, "name": "穆拉", "cities": []}, {
        "id": 11098,
        "name": "约兹加特",
        "cities": []
    }, {"id": 11032, "name": "艾登", "cities": []}, {"id": 11085, "name": "萨卡里亚", "cities": []}, {
        "id": 11086,
        "name": "萨姆松",
        "cities": []
    }, {"id": 11047, "name": "迪亚巴克尔", "cities": []}, {"id": 11094, "name": "通杰利", "cities": []}, {
        "id": 11084,
        "name": "里泽",
        "cities": []
    }, {"id": 11087, "name": "锡尔特", "cities": []}, {"id": 11089, "name": "锡尔纳克", "cities": []}, {
        "id": 11090,
        "name": "锡瓦斯",
        "cities": []
    }, {"id": 11088, "name": "锡诺普", "cities": []}, {"id": 11026, "name": "阿克萨赖", "cities": []}, {
        "id": 11025,
        "name": "阿勒",
        "cities": []
    }, {"id": 11031, "name": "阿尔特温", "cities": []}, {"id": 11030, "name": "阿尔达罕", "cities": []}, {
        "id": 11023,
        "name": "阿德亚曼",
        "cities": []
    }, {"id": 11024, "name": "阿菲永", "cities": []}, {"id": 11022, "name": "阿达纳", "cities": []}, {
        "id": 11027,
        "name": "阿马西亚",
        "cities": []
    }, {"id": 11078, "name": "马尔丁", "cities": []}, {"id": 11077, "name": "马尼萨", "cities": []}, {
        "id": 11076,
        "name": "马拉蒂亚",
        "cities": []
    }]
}, {"id": 1044, "name": "圣基茨和尼维斯", "provinces": []}, {"id": 1075, "name": "圣马力诺", "provinces": []}, {
    "id": 1162,
    "name": "坦桑尼亚",
    "provinces": []
}, {"id": 1110, "name": "埃及", "provinces": []}, {"id": 1112, "name": "埃塞俄比亚", "provinces": []}, {
    "id": 1124,
    "name": "基里巴斯",
    "provinces": []
}, {"id": 1160, "name": "塔吉克斯坦", "provinces": []}, {"id": 1158, "name": "塞内加尔", "provinces": []}, {
    "id": 1103,
    "name": "塞尔维亚,黑山",
    "provinces": []
}, {"id": 1157, "name": "塞拉利昂", "provinces": []}, {"id": 1072, "name": "塞舌尔", "provinces": []}, {
    "id": 1058,
    "name": "墨西哥",
    "provinces": [{"id": 10714, "name": "乌鲁阿潘", "cities": []}, {
        "id": 10678,
        "name": "伊拉普阿托",
        "cities": []
    }, {"id": 10701, "name": "克雷塔罗", "cities": []}, {"id": 10666, "name": "切图马尔", "cities": []}, {
        "id": 10680,
        "name": "华雷斯",
        "cities": []
    }, {"id": 10664, "name": "卡门", "cities": []}, {"id": 10679, "name": "哈拉帕", "cities": []}, {
        "id": 10713,
        "name": "图斯特拉-古铁雷斯",
        "cities": []
    }, {"id": 10704, "name": "圣路易斯波托亚", "cities": []}, {"id": 10705, "name": "坦皮科", "cities": []}, {
        "id": 10663,
        "name": "埃佩切",
        "cities": []
    }, {"id": 10677, "name": "埃莫西约", "cities": []}, {"id": 10706, "name": "塔帕丘拉", "cities": []}, {
        "id": 10665,
        "name": "塞拉亚",
        "cities": []
    }, {"id": 10687, "name": "墨西卡利", "cities": []}, {"id": 10688, "name": "墨西哥城", "cities": []}, {
        "id": 10669,
        "name": "夸察夸拉克斯",
        "cities": []
    }, {"id": 10668, "name": "奇尔潘辛戈", "cities": []}, {"id": 10667, "name": "奇瓦瓦", "cities": []}, {
        "id": 10695,
        "name": "奥夫雷贡城",
        "cities": []
    }, {"id": 10696, "name": "奥里萨巴", "cities": []}, {"id": 10700, "name": "巴亚尔塔港", "cities": []}, {
        "id": 10715,
        "name": "巴利城",
        "cities": []
    }, {"id": 10697, "name": "帕丘卡", "cities": []}, {"id": 10672, "name": "库利阿坎", "cities": []}, {
        "id": 10671,
        "name": "库埃纳瓦卡",
        "cities": []
    }, {"id": 10674, "name": "恩塞纳达", "cities": []}, {"id": 10711, "name": "托卢卡", "cities": []}, {
        "id": 10712,
        "name": "托雷翁",
        "cities": []
    }, {"id": 10681, "name": "拉巴斯", "cities": []}, {"id": 10693, "name": "新拉雷多", "cities": []}, {
        "id": 10699,
        "name": "普埃布拉",
        "cities": []
    }, {"id": 10673, "name": "杜兰戈", "cities": []}, {"id": 10686, "name": "梅里达", "cities": []}, {
        "id": 10718,
        "name": "比利亚埃尔莫萨",
        "cities": []
    }, {"id": 10698, "name": "波萨里卡", "cities": []}, {"id": 10683, "name": "洛斯莫奇斯", "cities": []}, {
        "id": 10710,
        "name": "特拉斯卡拉",
        "cities": []
    }, {"id": 10707, "name": "特瓦坎", "cities": []}, {"id": 10708, "name": "特皮克", "cities": []}, {
        "id": 10676,
        "name": "瓜纳华托",
        "cities": []
    }, {"id": 10675, "name": "瓜达拉哈拉", "cities": []}, {"id": 10694, "name": "瓦哈卡", "cities": []}, {
        "id": 10670,
        "name": "科利马",
        "cities": []
    }, {"id": 10717, "name": "维多利亚城", "cities": []}, {"id": 10691, "name": "莫雷利亚", "cities": []}, {
        "id": 10682,
        "name": "莱昂",
        "cities": []
    }, {"id": 10719, "name": "萨卡特卡斯", "cities": []}, {"id": 10703, "name": "萨尔蒂约", "cities": []}, {
        "id": 10709,
        "name": "蒂华纳",
        "cities": []
    }, {"id": 10689, "name": "蒙克洛瓦", "cities": []}, {"id": 10690, "name": "蒙特雷", "cities": []}, {
        "id": 10692,
        "name": "诺加莱斯",
        "cities": []
    }, {"id": 10662, "name": "贝尼托·胡亚雷斯", "cities": []}, {"id": 10660, "name": "阿卡普尔科", "cities": []}, {
        "id": 10661,
        "name": "阿瓜斯卡连斯特",
        "cities": []
    }, {"id": 10702, "name": "雷诺萨", "cities": []}, {"id": 10716, "name": "韦拉克鲁斯", "cities": []}, {
        "id": 10684,
        "name": "马塔莫罗斯",
        "cities": []
    }, {"id": 10685, "name": "马萨特兰", "cities": []}]
}, {"id": 1019, "name": "多米尼加共和国", "provinces": []}, {
    "id": 1004,
    "name": "奥地利",
    "provinces": [{"id": 10062, "name": "上奥地利", "cities": []}, {
        "id": 10058,
        "name": "下奥地利",
        "cities": []
    }, {"id": 10057, "name": "克恩顿", "cities": []}, {"id": 10056, "name": "布尔根兰", "cities": []}, {
        "id": 10060,
        "name": "施蒂利亚",
        "cities": []
    }, {"id": 10064, "name": "福拉尔贝格", "cities": []}, {"id": 10063, "name": "维也纳", "cities": []}, {
        "id": 10059,
        "name": "萨尔茨堡",
        "cities": []
    }, {"id": 10061, "name": "蒂罗尔", "cities": []}]
}, {
    "id": 1083,
    "name": "委内瑞拉",
    "provinces": [{"id": 11217, "name": "亚拉奎", "cities": []}, {"id": 11195, "name": "亚马孙", "cities": []}, {
        "id": 11202,
        "name": "加拉加斯",
        "cities": []
    }, {"id": 11201, "name": "卡拉沃沃", "cities": []}, {"id": 11215, "name": "塔奇拉", "cities": []}, {
        "id": 11196,
        "name": "安索阿特吉",
        "cities": []
    }, {"id": 11199, "name": "巴里纳斯", "cities": []}, {"id": 11209, "name": "拉腊", "cities": []}, {
        "id": 11206,
        "name": "新埃斯帕塔",
        "cities": []
    }, {"id": 11210, "name": "梅里达", "cities": []}, {"id": 11207, "name": "法尔孔", "cities": []}, {
        "id": 11213,
        "name": "波图格萨",
        "cities": []
    }, {"id": 11216, "name": "特鲁希略", "cities": []}, {"id": 11200, "name": "玻利瓦尔", "cities": []}, {
        "id": 11208,
        "name": "瓜里科",
        "cities": []
    }, {"id": 11203, "name": "科赫德斯", "cities": []}, {"id": 11211, "name": "米兰达", "cities": []}, {
        "id": 11205,
        "name": "联邦属地",
        "cities": []
    }, {"id": 11214, "name": "苏克雷", "cities": []}, {"id": 11218, "name": "苏利亚", "cities": []}, {
        "id": 11212,
        "name": "莫纳加斯",
        "cities": []
    }, {"id": 11198, "name": "阿拉瓜", "cities": []}, {"id": 11197, "name": "阿普雷", "cities": []}, {
        "id": 11204,
        "name": "阿马库罗三角洲",
        "cities": []
    }]
}, {"id": 1091, "name": "孟加拉", "provinces": []}, {
    "id": 1002,
    "name": "安哥拉",
    "provinces": [{"id": 10012, "name": "万博", "cities": []}, {"id": 10009, "name": "北宽扎", "cities": []}, {
        "id": 10015,
        "name": "北隆达",
        "cities": []
    }, {"id": 10010, "name": "南宽扎", "cities": []}, {"id": 10016, "name": "南隆达", "cities": []}, {
        "id": 10007,
        "name": "卡宾达",
        "cities": []
    }, {"id": 10013, "name": "威拉", "cities": []}, {"id": 10020, "name": "威热", "cities": []}, {
        "id": 10008,
        "name": "宽多库邦戈",
        "cities": []
    }, {"id": 10011, "name": "库内内", "cities": []}, {"id": 10021, "name": "扎伊尔", "cities": []}, {
        "id": 10004,
        "name": "本戈",
        "cities": []
    }, {"id": 10005, "name": "本格拉", "cities": []}, {"id": 10006, "name": "比耶", "cities": []}, {
        "id": 10019,
        "name": "纳米贝",
        "cities": []
    }, {"id": 10014, "name": "罗安达", "cities": []}, {"id": 10018, "name": "莫希科", "cities": []}, {
        "id": 10017,
        "name": "马兰热",
        "cities": []
    }]
}, {"id": 1001, "name": "安提瓜岛和巴布达", "provinces": []}, {"id": 1087, "name": "安道尔", "provinces": []}, {
    "id": 1142,
    "name": "尼加拉瓜",
    "provinces": []
}, {"id": 1141, "name": "尼日利亚", "provinces": []}, {"id": 1144, "name": "尼泊尔", "provinces": []}, {
    "id": 1011,
    "name": "巴哈马",
    "provinces": []
}, {"id": 1148, "name": "巴基斯坦", "provinces": []}, {"id": 1007, "name": "巴巴多斯岛", "provinces": []}, {
    "id": 1147,
    "name": "巴布亚新几内亚",
    "provinces": []
}, {"id": 1064, "name": "巴拿马", "provinces": []}, {"id": 1094, "name": "巴林", "provinces": []}, {
    "id": 1010,
    "name": "巴西",
    "provinces": [{"id": 10075, "name": "亚马孙", "cities": []}, {"id": 10088, "name": "伯南布哥", "cities": []}, {
        "id": 10091,
        "name": "北里奥格兰德",
        "cities": []
    }, {"id": 10092, "name": "南里奥格兰德", "cities": []}, {"id": 10083, "name": "南马托格罗索", "cities": []}, {
        "id": 10096,
        "name": "圣保罗",
        "cities": []
    }, {"id": 10095, "name": "圣卡塔琳娜", "cities": []}, {"id": 10079, "name": "圣埃斯皮里图", "cities": []}, {
        "id": 10097,
        "name": "塞尔希培",
        "cities": []
    }, {"id": 10078, "name": "塞阿拉", "cities": []}, {"id": 10076, "name": "巴伊亚", "cities": []}, {
        "id": 10087,
        "name": "巴拉那",
        "cities": []
    }, {"id": 10077, "name": "巴西利亚", "cities": []}, {"id": 10085, "name": "帕拉", "cities": []}, {
        "id": 10086,
        "name": "帕拉伊巴",
        "cities": []
    }, {"id": 10080, "name": "戈亚斯", "cities": []}, {"id": 10098, "name": "托坎廷斯", "cities": []}, {
        "id": 10093,
        "name": "朗多尼亚",
        "cities": []
    }, {"id": 10089, "name": "皮奥伊", "cities": []}, {"id": 10084, "name": "米纳斯吉拉斯", "cities": []}, {
        "id": 10094,
        "name": "罗赖马",
        "cities": []
    }, {"id": 10090, "name": "里约热内卢", "cities": []}, {"id": 10072, "name": "阿克里", "cities": []}, {
        "id": 10073,
        "name": "阿拉戈斯",
        "cities": []
    }, {"id": 10074, "name": "阿马帕", "cities": []}, {"id": 10082, "name": "马托格罗索", "cities": []}, {
        "id": 10081,
        "name": "马拉尼昂",
        "cities": []
    }]
}, {"id": 1095, "name": "布隆迪", "provinces": []}, {"id": 1115, "name": "希腊", "provinces": []}, {
    "id": 1068,
    "name": "帕劳群岛",
    "provinces": []
}, {"id": 1047, "name": "开曼群岛", "provinces": []}, {
    "id": 1018,
    "name": "德国",
    "provinces": [{"id": 10202, "name": "不伦瑞克", "cities": []}, {"id": 10201, "name": "不来梅", "cities": []}, {
        "id": 10231,
        "name": "什未林",
        "cities": []
    }, {"id": 10207, "name": "代特莫尔特", "cities": []}, {"id": 10221, "name": "兰茨胡特", "cities": []}, {
        "id": 10218,
        "name": "卡塞尔",
        "cities": []
    }, {"id": 10217, "name": "卡尔斯鲁厄", "cities": []}, {"id": 10213, "name": "吉森", "cities": []}, {
        "id": 10223,
        "name": "吕讷堡",
        "cities": []
    }, {"id": 10214, "name": "哈雷", "cities": []}, {"id": 10219, "name": "基尔", "cities": []}, {
        "id": 10196,
        "name": "奥格斯堡",
        "cities": []
    }, {"id": 10234, "name": "威斯巴登", "cities": []}, {"id": 10194, "name": "安斯巴格", "cities": []}, {
        "id": 10203,
        "name": "开姆尼斯",
        "cities": []
    }, {"id": 10212, "name": "弗赖堡", "cities": []}, {"id": 10208, "name": "德累斯顿", "cities": []}, {
        "id": 10206,
        "name": "德绍",
        "cities": []
    }, {"id": 10228, "name": "慕尼黑", "cities": []}, {"id": 10197, "name": "拜伊罗特", "cities": []}, {
        "id": 10232,
        "name": "斯图加特",
        "cities": []
    }, {"id": 10227, "name": "明斯特", "cities": []}, {"id": 10226, "name": "曼海姆", "cities": []}, {
        "id": 10209,
        "name": "杜塞尔多夫",
        "cities": []
    }, {"id": 10198, "name": "柏林", "cities": []}, {"id": 10199, "name": "比勒费尔德", "cities": []}, {
        "id": 10215,
        "name": "汉堡",
        "cities": []
    }, {"id": 10216, "name": "汉诺威", "cities": []}, {"id": 10211, "name": "法兰克福", "cities": []}, {
        "id": 10230,
        "name": "波茨坦",
        "cities": []
    }, {"id": 10200, "name": "波鸿", "cities": []}, {"id": 10210, "name": "爱尔福特", "cities": []}, {
        "id": 10233,
        "name": "特里尔",
        "cities": []
    }, {"id": 10220, "name": "科布伦次", "cities": []}, {"id": 10204, "name": "科隆", "cities": []}, {
        "id": 10229,
        "name": "纽伦堡",
        "cities": []
    }, {"id": 10235, "name": "维尔茨堡", "cities": []}, {"id": 10225, "name": "美因兹", "cities": []}, {
        "id": 10222,
        "name": "莱比锡",
        "cities": []
    }, {"id": 10205, "name": "达姆施塔特", "cities": []}, {"id": 10195, "name": "阿恩斯贝格", "cities": []}, {
        "id": 10224,
        "name": "马格德堡",
        "cities": []
    }]
}, {
    "id": 1040,
    "name": "意大利",
    "provinces": [{"id": 10541, "name": "乌迪内", "cities": []}, {
        "id": 10479,
        "name": "亚历山德里亚",
        "cities": []
    }, {"id": 10504, "name": "伊塞尔尼亚", "cities": []}, {"id": 11314, "name": "伦蒂亚", "cities": []}, {
        "id": 10501,
        "name": "佛罗伦萨",
        "cities": []
    }, {"id": 11298, "name": "佩斯卡拉", "cities": []}, {"id": 11297, "name": "佩萨罗", "cities": []}, {
        "id": 10524,
        "name": "佩鲁贾",
        "cities": []
    }, {"id": 10498, "name": "克罗托内", "cities": []}, {"id": 11304, "name": "列蒂", "cities": []}, {
        "id": 10518,
        "name": "努奥罗",
        "cities": []
    }, {"id": 11281, "name": "博尔扎诺", "cities": []}, {"id": 10488, "name": "博洛尼亚", "cities": []}, {
        "id": 10491,
        "name": "卡利亚里",
        "cities": []
    }, {"id": 11282, "name": "卡博尼亚 - 伊格莱西亚斯", "cities": []}, {"id": 10495, "name": "卡坦扎罗", "cities": []}, {
        "id": 10494,
        "name": "卡塔尼亚",
        "cities": []
    }, {"id": 10493, "name": "卡塞塔", "cities": []}, {"id": 11293, "name": "卢卡", "cities": []}, {
        "id": 11290,
        "name": "因佩里亚",
        "cities": []
    }, {"id": 10492, "name": "坎波巴索", "cities": []}, {"id": 11283, "name": "基耶蒂", "cities": []}, {
        "id": 10536,
        "name": "塔兰托",
        "cities": []
    }, {"id": 10512, "name": "墨西拿", "cities": []}, {"id": 10519, "name": "奥尔比亚", "cities": []}, {
        "id": 10481,
        "name": "奥斯塔",
        "cities": []
    }, {"id": 10520, "name": "奥里斯塔诺", "cities": []}, {"id": 10542, "name": "威尼斯", "cities": []}, {
        "id": 10480,
        "name": "安科纳",
        "cities": []
    }, {"id": 11279, "name": "巴列塔 - 安德里亚 - 特拉尼", "cities": []}, {
        "id": 10521,
        "name": "巴勒莫",
        "cities": []
    }, {"id": 10484, "name": "巴里", "cities": []}, {"id": 10487, "name": "布拉", "cities": []}, {
        "id": 10490,
        "name": "布林迪西",
        "cities": []
    }, {"id": 10489, "name": "布雷西亚", "cities": []}, {"id": 11296, "name": "帕多瓦", "cities": []}, {
        "id": 10522,
        "name": "帕尔马",
        "cities": []
    }, {"id": 10523, "name": "帕维亚", "cities": []}, {"id": 10499, "name": "库内奥", "cities": []}, {
        "id": 11286,
        "name": "弗利 - 切塞纳",
        "cities": []
    }, {"id": 11284, "name": "恩纳", "cities": []}, {"id": 11288, "name": "戈里齐亚", "cities": []}, {
        "id": 11291,
        "name": "拉丁",
        "cities": []
    }, {"id": 11302, "name": "拉古萨", "cities": []}, {"id": 10505, "name": "拉奎拉", "cities": []}, {
        "id": 11303,
        "name": "拉文纳",
        "cities": []
    }, {"id": 10506, "name": "拉斯佩齐亚", "cities": []}, {"id": 10514, "name": "摩德纳", "cities": []}, {
        "id": 11301,
        "name": "普拉托",
        "cities": []
    }, {"id": 11295, "name": "曼图亚", "cities": []}, {"id": 11307, "name": "松德里奥", "cities": []}, {
        "id": 11289,
        "name": "格罗塞托",
        "cities": []
    }, {"id": 10525, "name": "比萨", "cities": []}, {"id": 10526, "name": "波代诺内", "cities": []}, {
        "id": 10527,
        "name": "波坦察",
        "cities": []
    }, {"id": 11308, "name": "泰拉莫", "cities": []}, {"id": 11292, "name": "洛迪", "cities": []}, {
        "id": 10503,
        "name": "热那亚",
        "cities": []
    }, {"id": 10538, "name": "特伦托", "cities": []}, {"id": 11309, "name": "特尔尼", "cities": []}, {
        "id": 10537,
        "name": "特拉帕尼",
        "cities": []
    }, {"id": 11310, "name": "特雷维索", "cities": []}, {"id": 11311, "name": "瓦雷泽", "cities": []}, {
        "id": 10539,
        "name": "的里雅斯特",
        "cities": []
    }, {"id": 11299, "name": "皮亚琴察", "cities": []}, {"id": 11300, "name": "皮斯托亚", "cities": []}, {
        "id": 10502,
        "name": "福贾",
        "cities": []
    }, {"id": 10496, "name": "科摩", "cities": []}, {"id": 10497, "name": "科森扎", "cities": []}, {
        "id": 10513,
        "name": "米兰",
        "cities": []
    }, {"id": 10544, "name": "维泰博", "cities": []}, {"id": 11315, "name": "维琴察", "cities": []}, {
        "id": 11313,
        "name": "维罗纳",
        "cities": []
    }, {"id": 11306, "name": "罗维戈", "cities": []}, {"id": 10530, "name": "罗马", "cities": []}, {
        "id": 10507,
        "name": "莱切",
        "cities": []
    }, {"id": 10508, "name": "莱科", "cities": []}, {"id": 10533, "name": "萨沃纳", "cities": []}, {
        "id": 10531,
        "name": "萨莱诺",
        "cities": []
    }, {"id": 10532, "name": "萨萨里", "cities": []}, {"id": 10515, "name": "蒙扎", "cities": []}, {
        "id": 10517,
        "name": "诺瓦拉",
        "cities": []
    }, {"id": 10485, "name": "贝内文托", "cities": []}, {"id": 10486, "name": "贝加莫", "cities": []}, {
        "id": 11280,
        "name": "贝卢诺",
        "cities": []
    }, {"id": 11285, "name": "费尔莫", "cities": []}, {"id": 10500, "name": "费拉拉", "cities": []}, {
        "id": 11287,
        "name": "费辛隆尼",
        "cities": []
    }, {"id": 10516, "name": "那不勒斯", "cities": []}, {"id": 10540, "name": "都灵", "cities": []}, {
        "id": 10509,
        "name": "里窝那",
        "cities": []
    }, {"id": 11305, "name": "里米尼", "cities": []}, {"id": 10535, "name": "锡拉库扎", "cities": []}, {
        "id": 10534,
        "name": "锡耶纳",
        "cities": []
    }, {"id": 10482, "name": "阿斯科利皮切诺", "cities": []}, {"id": 10483, "name": "阿斯蒂", "cities": []}, {
        "id": 11277,
        "name": "阿格里真托",
        "cities": []
    }, {"id": 11278, "name": "阿雷佐", "cities": []}, {"id": 10528, "name": "雷焦卡拉布里亚", "cities": []}, {
        "id": 10529,
        "name": "雷焦艾米利亚",
        "cities": []
    }, {"id": 10543, "name": "韦尔切利", "cities": []}, {
        "id": 11312,
        "name": "韦巴诺 - 库西奥 - 奥索拉",
        "cities": []
    }, {"id": 11294, "name": "马切拉塔", "cities": []}, {"id": 10511, "name": "马泰拉", "cities": []}, {
        "id": 10510,
        "name": "马萨",
        "cities": []
    }]
}, {"id": 1153, "name": "所罗门群岛", "provinces": []}, {"id": 1133, "name": "拉脱维亚", "provinces": []}, {
    "id": 1143,
    "name": "挪威",
    "provinces": []
}, {"id": 1105, "name": "捷克共和国", "provinces": []}, {"id": 1051, "name": "摩尔多瓦", "provinces": []}, {
    "id": 1134,
    "name": "摩洛哥",
    "provinces": []
}, {"id": 1050, "name": "摩纳哥", "provinces": []}, {"id": 1009, "name": "文莱", "provinces": []}, {
    "id": 1021,
    "name": "斐济",
    "provinces": []
}, {"id": 1076, "name": "斯威士兰", "provinces": []}, {"id": 1156, "name": "斯洛伐克", "provinces": []}, {
    "id": 1155,
    "name": "斯洛文尼亚",
    "provinces": []
}, {"id": 1129, "name": "斯里兰卡", "provinces": []}, {"id": 1074, "name": "新加坡", "provinces": []}, {
    "id": 1061,
    "name": "新喀里多尼亚",
    "provinces": []
}, {
    "id": 1063,
    "name": "新西兰",
    "provinces": [{"id": 10765, "name": "克赖斯特彻奇", "cities": []}, {
        "id": 10775,
        "name": "内皮尔",
        "cities": []
    }, {"id": 10773, "name": "凯帕拉", "cities": []}, {"id": 10778, "name": "北岸", "cities": []}, {
        "id": 10779,
        "name": "北帕默斯顿",
        "cities": []
    }, {"id": 10767, "name": "北远", "cities": []}, {"id": 10768, "name": "吉斯伯恩", "cities": []}, {
        "id": 10770,
        "name": "哈密尔顿",
        "cities": []
    }, {"id": 10772, "name": "因弗卡吉尔", "cities": []}, {"id": 10763, "name": "奥克兰", "cities": []}, {
        "id": 10764,
        "name": "布莱尼姆",
        "cities": []
    }, {"id": 10783, "name": "怀塔科拉", "cities": []}, {"id": 10781, "name": "斯特拉特福德", "cities": []}, {
        "id": 10777,
        "name": "新普利茅斯",
        "cities": []
    }, {"id": 10784, "name": "旺格努伊", "cities": []}, {"id": 10786, "name": "旺阿雷", "cities": []}, {
        "id": 10769,
        "name": "格雷茅斯",
        "cities": []
    }, {"id": 10785, "name": "瓦卡塔尼", "cities": []}, {"id": 10776, "name": "纳尔逊", "cities": []}, {
        "id": 10766,
        "name": "达尼丁",
        "cities": []
    }, {"id": 10780, "name": "里士满", "cities": []}, {"id": 10782, "name": "陶马鲁努伊", "cities": []}, {
        "id": 10774,
        "name": "马努考",
        "cities": []
    }, {"id": 10771, "name": "黑斯廷斯", "cities": []}]
}, {
    "id": 1042,
    "name": "日本",
    "provinces": [{"id": 10567, "name": "三重", "cities": []}, {"id": 10585, "name": "东京", "cities": []}, {
        "id": 10566,
        "name": "京都",
        "cities": []
    }, {"id": 10578, "name": "佐贺", "cities": []}, {"id": 10557, "name": "兵库", "cities": []}, {
        "id": 10575,
        "name": "冈山",
        "cities": []
    }, {"id": 10576, "name": "冲绳", "cities": []}, {"id": 10556, "name": "北海道", "cities": []}, {
        "id": 10548,
        "name": "千叶",
        "cities": []
    }, {"id": 10588, "name": "和歌山", "cities": []}, {"id": 10579, "name": "埼玉", "cities": []}, {
        "id": 10574,
        "name": "大分",
        "cities": []
    }, {"id": 10577, "name": "大阪", "cities": []}, {"id": 10572, "name": "奈良", "cities": []}, {
        "id": 10569,
        "name": "宫崎",
        "cities": []
    }, {"id": 10568, "name": "宮城", "cities": []}, {"id": 10587, "name": "富山", "cities": []}, {
        "id": 10590,
        "name": "山口",
        "cities": []
    }, {"id": 10589, "name": "山形", "cities": []}, {"id": 10591, "name": "山梨", "cities": []}, {
        "id": 10553,
        "name": "岐阜",
        "cities": []
    }, {"id": 10581, "name": "岛根", "cities": []}, {"id": 10560, "name": "岩手", "cities": []}, {
        "id": 10555,
        "name": "广岛",
        "cities": []
    }, {"id": 10584, "name": "徳岛", "cities": []}, {"id": 10573, "name": "新潟", "cities": []}, {
        "id": 10583,
        "name": "枥木",
        "cities": []
    }, {"id": 10580, "name": "滋贺", "cities": []}, {"id": 10565, "name": "熊本", "cities": []}, {
        "id": 10549,
        "name": "爱媛",
        "cities": []
    }, {"id": 10545, "name": "爱知", "cities": []}, {"id": 10559, "name": "石川", "cities": []}, {
        "id": 10563,
        "name": "神奈川",
        "cities": []
    }, {"id": 10550, "name": "福井", "cities": []}, {"id": 10551, "name": "福冈", "cities": []}, {
        "id": 10552,
        "name": "福岛",
        "cities": []
    }, {"id": 10546, "name": "秋田", "cities": []}, {"id": 10554, "name": "群马", "cities": []}, {
        "id": 10558,
        "name": "茨城",
        "cities": []
    }, {"id": 10571, "name": "长崎", "cities": []}, {"id": 10570, "name": "长野", "cities": []}, {
        "id": 10547,
        "name": "青森",
        "cities": []
    }, {"id": 10582, "name": "静冈", "cities": []}, {"id": 10561, "name": "香川", "cities": []}, {
        "id": 10564,
        "name": "高知",
        "cities": []
    }, {"id": 10586, "name": "鸟取", "cities": []}, {"id": 10562, "name": "鹿儿岛", "cities": []}]
}, {"id": 1099, "name": "智利", "provinces": []}, {"id": 1125, "name": "朝鲜", "provinces": []}, {
    "id": 1043,
    "name": "柬埔寨",
    "provinces": [{"id": 10613, "name": "上丁", "cities": []}, {"id": 10606, "name": "奥多棉吉", "cities": []}, {
        "id": 10599,
        "name": "干丹",
        "cities": []
    }, {"id": 10600, "name": "戈公", "cities": []}, {"id": 10603, "name": "拜林市", "cities": []}, {
        "id": 10612,
        "name": "暹粒",
        "cities": []
    }, {"id": 10609, "name": "柏威夏", "cities": []}, {"id": 10614, "name": "柴桢", "cities": []}, {
        "id": 10601,
        "name": "桔井",
        "cities": []
    }, {"id": 10610, "name": "波罗勉", "cities": []}, {"id": 10592, "name": "班迭棉吉", "cities": []}, {
        "id": 10602,
        "name": "白马市",
        "cities": []
    }, {"id": 10597, "name": "磅同", "cities": []}, {"id": 10596, "name": "磅士卑", "cities": []}, {
        "id": 10595,
        "name": "磅清扬",
        "cities": []
    }, {"id": 10594, "name": "磅湛", "cities": []}, {"id": 10611, "name": "腊塔纳基里", "cities": []}, {
        "id": 10615,
        "name": "茶胶",
        "cities": []
    }, {"id": 10608, "name": "菩萨", "cities": []}, {"id": 10605, "name": "蒙多基里", "cities": []}, {
        "id": 10604,
        "name": "西哈努克市",
        "cities": []
    }, {"id": 10598, "name": "贡布", "cities": []}, {"id": 10607, "name": "金边市", "cities": []}, {
        "id": 10593,
        "name": "马德望",
        "cities": []
    }]
}, {"id": 1026, "name": "格恩西岛", "provinces": []}, {"id": 1024, "name": "格林纳达", "provinces": []}, {
    "id": 1028,
    "name": "格陵兰",
    "provinces": []
}, {"id": 1092, "name": "比利时", "provinces": []}, {"id": 1138, "name": "毛里塔尼亚", "provinces": []}, {
    "id": 1056,
    "name": "毛里求斯",
    "provinces": []
}, {"id": 1161, "name": "汤加", "provinces": []}, {
    "id": 1071,
    "name": "沙特阿拉伯",
    "provinces": [{"id": 10923, "name": "利雅得", "cities": []}, {"id": 10918, "name": "吉赞", "cities": []}, {
        "id": 10917,
        "name": "吉达",
        "cities": []
    }, {"id": 10916, "name": "哈伊勒", "cities": []}, {"id": 10915, "name": "哈费尔巴廷", "cities": []}, {
        "id": 10912,
        "name": "塔伊夫",
        "cities": []
    }, {"id": 10925, "name": "塔布克", "cities": []}, {"id": 10924, "name": "塞卡卡", "cities": []}, {
        "id": 10906,
        "name": "巴哈",
        "cities": []
    }, {"id": 10913, "name": "布赖代", "cities": []}, {"id": 10926, "name": "延布", "cities": []}, {
        "id": 10919,
        "name": "海米斯穆谢特",
        "cities": []
    }, {"id": 10922, "name": "纳季兰", "cities": []}, {"id": 10905, "name": "艾卜哈", "cities": []}, {
        "id": 10914,
        "name": "达曼",
        "cities": []
    }, {"id": 10909, "name": "阿尔卡里", "cities": []}, {"id": 10910, "name": "阿尔姆巴拉兹", "cities": []}, {
        "id": 10908,
        "name": "阿尔朱拜勒",
        "cities": []
    }, {"id": 10907, "name": "阿尔胡富夫", "cities": []}, {"id": 10911, "name": "阿尔阿尔", "cities": []}, {
        "id": 10920,
        "name": "麦加",
        "cities": []
    }, {"id": 10921, "name": "麦地那", "cities": []}]
}, {
    "id": 1022,
    "name": "法国",
    "provinces": [{"id": 10288, "name": "亚眠", "cities": []}, {"id": 10296, "name": "利摩日", "cities": []}, {
        "id": 10301,
        "name": "南特",
        "cities": []
    }, {"id": 10291, "name": "卡昂", "cities": []}, {"id": 10307, "name": "图卢兹", "cities": []}, {
        "id": 10303,
        "name": "奥尔良",
        "cities": []
    }, {"id": 10302, "name": "尼斯", "cities": []}, {"id": 10304, "name": "巴黎", "cities": []}, {
        "id": 10294,
        "name": "弗雷瑞斯",
        "cities": []
    }, {"id": 10299, "name": "梅斯", "cities": []}, {"id": 10292, "name": "沙隆", "cities": []}, {
        "id": 10308,
        "name": "瓦朗斯",
        "cities": []
    }, {"id": 10293, "name": "第戎", "cities": []}, {"id": 10286, "name": "艾克斯", "cities": []}, {
        "id": 10300,
        "name": "蒙彼利埃",
        "cities": []
    }, {"id": 10290, "name": "贝桑松", "cities": []}, {"id": 10295, "name": "里尔", "cities": []}, {
        "id": 10297,
        "name": "里昂",
        "cities": []
    }, {"id": 10289, "name": "阿尔勒", "cities": []}, {"id": 10287, "name": "阿雅克修", "cities": []}, {
        "id": 10305,
        "name": "雷恩",
        "cities": []
    }, {"id": 10298, "name": "马赛", "cities": []}, {"id": 10306, "name": "鲁昂", "cities": []}]
}, {"id": 1149, "name": "波兰", "provinces": []}, {"id": 1066, "name": "波多黎各", "provinces": []}, {
    "id": 1077,
    "name": "泰国",
    "provinces": [{"id": 11016, "name": "乌汶", "cities": []}, {"id": 11018, "name": "乌泰他尼", "cities": []}, {
        "id": 11017,
        "name": "乌隆",
        "cities": []
    }, {"id": 11020, "name": "也拉", "cities": []}, {"id": 10987, "name": "佛丕", "cities": []}, {
        "id": 10972,
        "name": "佛统",
        "cities": []
    }, {"id": 11006, "name": "信武里", "cities": []}, {"id": 10960, "name": "加拉信", "cities": []}, {
        "id": 10982,
        "name": "北大年",
        "cities": []
    }, {"id": 11001, "name": "北揽", "cities": []}, {"id": 10952, "name": "北柳", "cities": []}, {
        "id": 11004,
        "name": "北标",
        "cities": []
    }, {"id": 10974, "name": "北榄坡", "cities": []}, {"id": 10962, "name": "北碧", "cities": []}, {
        "id": 10967,
        "name": "华富里",
        "cities": []
    }, {"id": 10965, "name": "南奔", "cities": []}, {"id": 10984, "name": "博达伦", "cities": []}, {
        "id": 10996,
        "name": "叻丕",
        "cities": []
    }, {"id": 11007, "name": "四色菊", "cities": []}, {"id": 10968, "name": "夜丰颂", "cities": []}, {
        "id": 11003,
        "name": "夜功",
        "cities": []
    }, {"id": 10991, "name": "大城", "cities": []}, {"id": 10963, "name": "孔敬", "cities": []}, {
        "id": 10948,
        "name": "安纳乍能",
        "cities": []
    }, {"id": 11008, "name": "宋卡", "cities": []}, {"id": 10955, "name": "尖竹汶", "cities": []}, {
        "id": 10981,
        "name": "巴吞他尼",
        "cities": []
    }, {"id": 10993, "name": "巴真", "cities": []}, {"id": 10994, "name": "巴蜀", "cities": []}, {
        "id": 10990,
        "name": "帕",
        "cities": []
    }, {"id": 10985, "name": "帕尧", "cities": []}, {"id": 10979, "name": "廊开", "cities": []}, {
        "id": 10978,
        "name": "廊莫那浦",
        "cities": []
    }, {"id": 10989, "name": "彭世洛", "cities": []}, {"id": 10988, "name": "披集", "cities": []}, {
        "id": 10997,
        "name": "拉农",
        "cities": []
    }, {"id": 10983, "name": "攀牙", "cities": []}, {"id": 10958, "name": "春武里", "cities": []}, {
        "id": 10959,
        "name": "春蓬",
        "cities": []
    }, {"id": 10992, "name": "普吉", "cities": []}, {"id": 10980, "name": "暖武里", "cities": []}, {
        "id": 10950,
        "name": "曼谷",
        "cities": []
    }, {"id": 10951, "name": "武里南", "cities": []}, {"id": 11005, "name": "沙敦", "cities": []}, {
        "id": 10999,
        "name": "沙缴",
        "cities": []
    }, {"id": 10975, "name": "洛坤", "cities": []}, {"id": 10957, "name": "清莱", "cities": []}, {
        "id": 10956,
        "name": "清迈",
        "cities": []
    }, {"id": 10954, "name": "猜也奔", "cities": []}, {"id": 10953, "name": "猜那", "cities": []}, {
        "id": 10969,
        "name": "玛哈沙拉堪",
        "cities": []
    }, {"id": 10961, "name": "甘烹碧", "cities": []}, {"id": 10964, "name": "甲米", "cities": []}, {
        "id": 10986,
        "name": "碧差汶",
        "cities": []
    }, {"id": 11019, "name": "程逸", "cities": []}, {"id": 11009, "name": "素可泰", "cities": []}, {
        "id": 11011,
        "name": "素叻",
        "cities": []
    }, {"id": 11010, "name": "素攀武里", "cities": []}, {"id": 11012, "name": "素林", "cities": []}, {
        "id": 10949,
        "name": "红统",
        "cities": []
    }, {"id": 10995, "name": "罗勇", "cities": []}, {"id": 11021, "name": "耶梭通", "cities": []}, {
        "id": 11000,
        "name": "色军",
        "cities": []
    }, {"id": 10970, "name": "莫达汉", "cities": []}, {"id": 11014, "name": "董里", "cities": []}, {
        "id": 11013,
        "name": "达",
        "cities": []
    }, {"id": 11015, "name": "达叻", "cities": []}, {"id": 10973, "name": "那空帕农", "cities": []}, {
        "id": 10971,
        "name": "那空那育",
        "cities": []
    }, {"id": 10977, "name": "陶公", "cities": []}, {"id": 10976, "name": "难", "cities": []}, {
        "id": 10966,
        "name": "黎",
        "cities": []
    }, {"id": 10998, "name": "黎逸", "cities": []}, {"id": 11002, "name": "龙仔厝", "cities": []}]
}, {"id": 1041, "name": "泽西岛", "provinces": []}, {"id": 1117, "name": "洪都拉斯", "provinces": []}, {
    "id": 1032,
    "name": "海地",
    "provinces": []
}, {
    "id": 1005,
    "name": "澳大利亚",
    "provinces": [{
        "id": 10066,
        "name": "北部地区",
        "cities": [{"id": 100004, "name": "北帕默斯顿"}, {"id": 100003, "name": "达尔文"}]
    }, {
        "id": 10068,
        "name": "南澳大利亚",
        "cities": [{"id": 100014, "name": "奥古斯塔"}, {"id": 100018, "name": "怀阿拉"}, {
            "id": 100015,
            "name": "林肯港"
        }, {"id": 100012, "name": "甘比亚山"}, {"id": 100016, "name": "皮里港"}, {"id": 100017, "name": "维克托港"}, {
            "id": 100011,
            "name": "阿德莱德"
        }, {"id": 100013, "name": "默里布里奇"}]
    }, {"id": 11275, "name": "堪培拉", "cities": []}, {
        "id": 10069,
        "name": "塔斯马尼亚",
        "cities": [{"id": 100019, "name": "伯尼港"}, {"id": 100020, "name": "德文波特"}, {
            "id": 100022,
            "name": "朗塞斯顿"
        }, {"id": 100021, "name": "霍巴特"}]
    }, {
        "id": 10065,
        "name": "新南威尔士",
        "cities": [{"id": 100002, "name": "伍伦贡"}, {"id": 100001, "name": "悉尼"}, {"id": 100000, "name": "纽卡斯尔"}]
    }, {
        "id": 10067,
        "name": "昆士兰",
        "cities": [{"id": 100006, "name": "凯恩斯"}, {"id": 100007, "name": "卡罗旺德拉"}, {
            "id": 100009,
            "name": "图文巴"
        }, {"id": 100005, "name": "布里斯班"}, {"id": 100010, "name": "汤斯维尔"}, {"id": 100008, "name": "黄金海岸"}]
    }, {
        "id": 10070,
        "name": "维多利亚",
        "cities": [{"id": 100023, "name": "吉朗"}, {"id": 100024, "name": "墨尔本"}]
    }, {
        "id": 10071,
        "name": "西澳大利亚",
        "cities": [{"id": 100029, "name": "卡尔古利"}, {"id": 100025, "name": "奥尔巴尼"}, {
            "id": 100027,
            "name": "弗里曼特尔港"
        }, {"id": 100030, "name": "曼哲拉"}, {"id": 100028, "name": "杰拉尔顿"}, {"id": 100031, "name": "珀斯"}, {
            "id": 100026,
            "name": "班伯里"
        }]
    }]
}, {
    "id": 1035,
    "name": "爱尔兰",
    "provinces": [{"id": 10381, "name": "克莱尔", "cities": []}, {"id": 10386, "name": "凯里", "cities": []}, {
        "id": 10390,
        "name": "利特里姆",
        "cities": []
    }, {"id": 10391, "name": "利默里克", "cities": []}, {"id": 10393, "name": "劳斯", "cities": []}, {
        "id": 10379,
        "name": "卡洛",
        "cities": []
    }, {"id": 10380, "name": "卡范", "cities": []}, {"id": 10387, "name": "基尔代尔", "cities": []}, {
        "id": 10388,
        "name": "基尔肯尼",
        "cities": []
    }, {"id": 10383, "name": "多内加尔", "cities": []}, {"id": 10397, "name": "奥法利", "cities": []}, {
        "id": 10404,
        "name": "威克洛",
        "cities": []
    }, {"id": 10389, "name": "崂斯", "cities": []}, {"id": 10385, "name": "戈尔韦", "cities": []}, {
        "id": 10399,
        "name": "斯莱戈",
        "cities": []
    }, {"id": 10392, "name": "朗福德", "cities": []}, {"id": 10394, "name": "梅奥", "cities": []}, {
        "id": 10401,
        "name": "沃特福德",
        "cities": []
    }, {"id": 10382, "name": "科克", "cities": []}, {"id": 10395, "name": "米斯", "cities": []}, {
        "id": 10398,
        "name": "罗斯康芒",
        "cities": []
    }, {"id": 10396, "name": "莫内根", "cities": []}, {"id": 10400, "name": "蒂珀雷里", "cities": []}, {
        "id": 10402,
        "name": "西米斯",
        "cities": []
    }, {"id": 10384, "name": "都柏林", "cities": []}, {"id": 10403, "name": "韦克斯福德", "cities": []}]
}, {"id": 1120, "name": "牙买加", "provinces": []}, {"id": 1079, "name": "特立尼达和多巴哥", "provinces": []}, {
    "id": 1097,
    "name": "玻利维亚",
    "provinces": []
}, {
    "id": 1073,
    "name": "瑞典",
    "provinces": [{"id": 10942, "name": "东约特兰", "cities": []}, {
        "id": 10941,
        "name": "乌普萨拉",
        "cities": []
    }, {"id": 10935, "name": "克鲁努贝里", "cities": []}, {"id": 10936, "name": "北博滕", "cities": []}, {
        "id": 10939,
        "name": "南曼兰",
        "cities": []
    }, {"id": 10934, "name": "卡尔马", "cities": []}, {"id": 10937, "name": "厄勒布鲁", "cities": []}, {
        "id": 10931,
        "name": "哈兰",
        "cities": []
    }, {"id": 10930, "name": "哥得兰", "cities": []}, {"id": 10927, "name": "布莱金厄", "cities": []}, {
        "id": 10933,
        "name": "延雪平",
        "cities": []
    }, {"id": 10940, "name": "斯德哥尔摩", "cities": []}, {"id": 10938, "name": "斯科耐", "cities": []}, {
        "id": 10929,
        "name": "耶夫勒堡",
        "cities": []
    }, {"id": 10932, "name": "耶姆特兰", "cities": []}, {"id": 10944, "name": "西博滕", "cities": []}, {
        "id": 10946,
        "name": "西曼兰",
        "cities": []
    }, {"id": 10947, "name": "西约特兰", "cities": []}, {"id": 10945, "name": "西诺尔兰", "cities": []}, {
        "id": 10928,
        "name": "达拉纳",
        "cities": []
    }, {"id": 10943, "name": "韦姆兰", "cities": []}]
}, {
    "id": 1016,
    "name": "瑞士",
    "provinces": [{"id": 10148, "name": "上瓦尔登", "cities": []}, {
        "id": 10147,
        "name": "下瓦尔登",
        "cities": []
    }, {"id": 10155, "name": "乌里", "cities": []}, {"id": 10138, "name": "伯尔尼", "cities": []}, {
        "id": 10135,
        "name": "内阿彭策尔",
        "cities": []
    }, {"id": 10145, "name": "卢塞恩", "cities": []}, {"id": 10153, "name": "图尔高", "cities": []}, {
        "id": 10152,
        "name": "圣加仑",
        "cities": []
    }, {"id": 10134, "name": "外阿彭策尔", "cities": []}, {"id": 10136, "name": "巴塞尔", "cities": []}, {
        "id": 10137,
        "name": "巴塞尔乡村",
        "cities": []
    }, {"id": 10139, "name": "弗里堡", "cities": []}, {"id": 10154, "name": "提契诺", "cities": []}, {
        "id": 10150,
        "name": "施维茨",
        "cities": []
    }, {"id": 10140, "name": "日内瓦", "cities": []}, {"id": 10142, "name": "格劳宾登", "cities": []}, {
        "id": 10141,
        "name": "格拉鲁斯",
        "cities": []
    }, {"id": 10158, "name": "楚格", "cities": []}, {"id": 10143, "name": "汝拉", "cities": []}, {
        "id": 10156,
        "name": "沃",
        "cities": []
    }, {"id": 10149, "name": "沙夫豪森", "cities": []}, {"id": 10144, "name": "洛桑", "cities": []}, {
        "id": 10157,
        "name": "瓦莱",
        "cities": []
    }, {"id": 10151, "name": "索洛图恩", "cities": []}, {"id": 10146, "name": "纳沙泰尔", "cities": []}, {
        "id": 10159,
        "name": "苏黎世",
        "cities": []
    }, {"id": 10133, "name": "阿尔高", "cities": []}]
}, {"id": 1166, "name": "瓦努阿图", "provinces": []}, {"id": 1069, "name": "留尼旺岛", "provinces": []}, {
    "id": 1008,
    "name": "百慕大",
    "provinces": []
}, {"id": 1027, "name": "直布罗陀", "provinces": []}, {"id": 1046, "name": "科威特", "provinces": []}, {
    "id": 1146,
    "name": "秘鲁",
    "provinces": []
}, {"id": 1121, "name": "约旦", "provinces": []}, {"id": 1140, "name": "纳米比亚", "provinces": []}, {
    "id": 1136,
    "name": "缅甸",
    "provinces": []
}, {"id": 1151, "name": "罗马尼亚", "provinces": []}, {
    "id": 1082,
    "name": "美国",
    "provinces": [{
        "id": 11146,
        "name": "亚利桑那",
        "cities": [{"id": 100875, "name": "优玛"}, {"id": 100871, "name": "凤凰城"}, {
            "id": 100872,
            "name": "史卡兹代尔"
        }, {"id": 101151, "name": "吉尔伯特"}, {"id": 100874, "name": "图森"}, {"id": 100873, "name": "坦普"}, {
            "id": 100869,
            "name": "格兰代尔"
        }, {"id": 100870, "name": "梅萨"}, {"id": 101153, "name": "瑟普赖斯"}, {"id": 101152, "name": "皮奥里亚"}, {
            "id": 101150,
            "name": "钱德勒"
        }]
    }, {
        "id": 11157,
        "name": "伊利诺斯州",
        "cities": [{"id": 100943, "name": "东圣路易斯"}, {"id": 100940, "name": "丹维尓"}, {
            "id": 101245,
            "name": "乔利埃特"
        }, {"id": 101246, "name": "内珀维尔"}, {"id": 100936, "name": "卡本代尔"}, {
            "id": 100938,
            "name": "厄巴纳-香槟"
        }, {"id": 101244, "name": "埃尔金"}, {"id": 100933, "name": "奥尔顿"}, {"id": 100934, "name": "奥罗拉"}, {
            "id": 100935,
            "name": "布卢明顿"
        }, {"id": 100949, "name": "斯普林菲尔德"}, {"id": 100937, "name": "森特勒利亚"}, {
            "id": 100950,
            "name": "沃其根"
        }, {"id": 100946, "name": "皮奥里亚"}, {"id": 100944, "name": "盖尔斯堡"}, {
            "id": 100947,
            "name": "罗克福德"
        }, {"id": 100948, "name": "罗克艾兰"}, {"id": 100939, "name": "芝加哥"}, {"id": 100945, "name": "诺黙尔"}, {
            "id": 100941,
            "name": "迪凯特"
        }, {"id": 100942, "name": "迪卡尔布"}]
    }, {
        "id": 11154,
        "name": "佐治亚",
        "cities": [{"id": 100913, "name": "亚特兰大"}, {"id": 100915, "name": "哥伦布"}, {
            "id": 100914,
            "name": "奥古斯塔"
        }, {"id": 100916, "name": "梅肯"}, {"id": 100917, "name": "沙瓦纳"}, {"id": 101242, "name": "雅典"}]
    }, {
        "id": 11153,
        "name": "佛罗里达",
        "cities": [{"id": 101229, "name": "克利尔沃特"}, {"id": 100904, "name": "卡纳维拉尔角"}, {
            "id": 100910,
            "name": "圣彼德斯堡市"
        }, {"id": 101240, "name": "圣露西港"}, {"id": 100912, "name": "坦帕"}, {"id": 100907, "name": "基韦斯特"}, {
            "id": 100911,
            "name": "塔拉哈西"
        }, {"id": 100909, "name": "奥兰多"}, {"id": 101233, "name": "好莱坞"}, {"id": 101239, "name": "庞帕诺比奇"}, {
            "id": 101228,
            "name": "开普科勒尔"
        }, {"id": 100906, "name": "杰克逊维尔"}, {"id": 101237, "name": "棕榈湾"}, {
            "id": 101232,
            "name": "海厄利亚"
        }, {"id": 101238, "name": "潘布鲁克派恩斯"}, {"id": 101231, "name": "盖恩斯维尔"}, {
            "id": 101230,
            "name": "科勒尔斯普林斯"
        }, {"id": 101236, "name": "米拉马尔"}, {"id": 100905, "name": "罗德岱堡"}, {"id": 101234, "name": "莱克兰"}, {
            "id": 101241,
            "name": "西棕榈滩"
        }, {"id": 100908, "name": "迈阿密"}, {"id": 101235, "name": "迈阿密花园"}]
    }, {
        "id": 11189,
        "name": "佛蒙特",
        "cities": [{"id": 101116, "name": "伯灵顿"}, {"id": 101118, "name": "南伯灵顿"}, {"id": 101117, "name": "拉特兰"}]
    }, {
        "id": 11179,
        "name": "俄亥俄",
        "cities": [{"id": 101053, "name": "代顿"}, {"id": 101051, "name": "克利夫兰"}, {
            "id": 101052,
            "name": "哥伦布"
        }, {"id": 101054, "name": "托莱多"}, {"id": 101050, "name": "辛辛那提"}, {"id": 101263, "name": "阿克伦"}]
    }, {
        "id": 11180,
        "name": "俄克拉荷马",
        "cities": [{"id": 101056, "name": "俄克拉荷马城"}, {"id": 101057, "name": "塔尔萨"}, {
            "id": 101264,
            "name": "断箭城"
        }, {"id": 101055, "name": "诺曼"}]
    }, {
        "id": 11181,
        "name": "俄勒冈",
        "cities": [{"id": 101070, "name": "圣海伦斯"}, {"id": 101068, "name": "塞勒姆"}, {
            "id": 101063,
            "name": "尤金"
        }, {"id": 101059, "name": "库斯贝"}, {"id": 101069, "name": "斯普林菲尔德"}, {"id": 101058, "name": "本德"}, {
            "id": 101064,
            "name": "格兰茨帕斯"
        }, {"id": 101265, "name": "格雷沙姆"}, {"id": 101066, "name": "梅德福"}, {"id": 101067, "name": "波特兰"}, {
            "id": 101061,
            "name": "火山口湖"
        }, {"id": 101060, "name": "科瓦利斯"}, {"id": 101065, "name": "胡德里弗"}, {
            "id": 101072,
            "name": "蒂拉穆克"
        }, {"id": 101071, "name": "达尔斯"}, {"id": 101062, "name": "达拉斯"}]
    }, {
        "id": 11172,
        "name": "内华达州",
        "cities": [{"id": 101020, "name": "亨德森"}, {"id": 101022, "name": "北拉斯维加斯"}, {
            "id": 101018,
            "name": "卡森城"
        }, {"id": 101019, "name": "埃尔科"}, {"id": 101025, "name": "弗吉尼亚城"}, {
            "id": 101021,
            "name": "拉斯维加斯"
        }, {"id": 101024, "name": "斯帕克斯"}, {"id": 101023, "name": "里诺"}]
    }, {
        "id": 11171,
        "name": "内布拉斯加",
        "cities": [{"id": 101017, "name": "奥马哈"}, {"id": 101016, "name": "林肯"}, {"id": 101015, "name": "贝尔维尤"}]
    }, {
        "id": 11148,
        "name": "加利福尼亚",
        "cities": [{"id": 101160, "name": "丘拉维斯塔"}, {"id": 101178, "name": "亨丁顿滩"}, {
            "id": 101157,
            "name": "伯克利"
        }, {"id": 101158, "name": "伯班克"}, {"id": 101181, "name": "兰开斯特"}, {"id": 101213, "name": "千橡市"}, {
            "id": 101159,
            "name": "卡尔斯巴德"
        }, {"id": 101165, "name": "唐尼"}, {"id": 101175, "name": "园林市"}, {"id": 100882, "name": "圣何塞"}, {
            "id": 101205,
            "name": "圣克拉拉"
        }, {"id": 101206, "name": "圣塔克拉利塔"}, {"id": 101204, "name": "圣安娜"}, {
            "id": 101207,
            "name": "圣玛丽亚"
        }, {"id": 101208, "name": "圣罗莎"}, {"id": 101202, "name": "圣贝纳迪诺"}, {"id": 100880, "name": "圣迭戈"}, {
            "id": 101203,
            "name": "圣马特奥"
        }, {"id": 101168, "name": "埃尔克格罗夫"}, {"id": 101166, "name": "埃尔卡洪"}, {
            "id": 101169,
            "name": "埃斯孔迪多"
        }, {"id": 101187, "name": "奥克兰"}, {"id": 101191, "name": "奥克斯纳德"}, {"id": 101189, "name": "安大略"}, {
            "id": 101155,
            "name": "安条克"
        }, {"id": 101154, "name": "安那罕"}, {"id": 101174, "name": "富勒顿"}, {"id": 101180, "name": "尔湾"}, {
            "id": 101193,
            "name": "帕萨迪纳"
        }, {"id": 101195, "name": "库卡蒙格牧场"}, {"id": 101161, "name": "康科德"}, {
            "id": 101172,
            "name": "弗里蒙特"
        }, {"id": 101173, "name": "弗雷斯诺"}, {"id": 101164, "name": "戴利城"}, {"id": 101214, "name": "托伦斯"}, {
            "id": 101216,
            "name": "文图拉"
        }, {"id": 101210, "name": "斯托克顿"}, {"id": 101171, "name": "方塔纳"}, {"id": 100881, "name": "旧金山"}, {
            "id": 101176,
            "name": "格伦代尔"
        }, {"id": 101192, "name": "棕榈谷"}, {"id": 101211, "name": "森尼韦尔"}, {"id": 101190, "name": "橙市"}, {
            "id": 101188,
            "name": "欧申赛德"
        }, {"id": 101194, "name": "波莫纳"}, {"id": 100879, "name": "洛杉矶"}, {"id": 101177, "name": "海沃德"}, {
            "id": 101215,
            "name": "瓦列霍"
        }, {"id": 101163, "name": "科斯塔梅萨"}, {"id": 101162, "name": "科洛纳"}, {"id": 101185, "name": "穆列塔"}, {
            "id": 101217,
            "name": "维克多维尔"
        }, {"id": 101218, "name": "维塞利亚"}, {"id": 101199, "name": "罗斯维尔"}, {
            "id": 101167,
            "name": "艾尔蒙地"
        }, {"id": 101179, "name": "英格尔伍德"}, {"id": 101183, "name": "莫德斯托"}, {
            "id": 101184,
            "name": "莫雷诺谷"
        }, {"id": 101200, "name": "萨克拉门托"}, {"id": 101201, "name": "萨利纳斯"}, {
            "id": 101212,
            "name": "蒂梅丘拉"
        }, {"id": 101219, "name": "西柯汶纳"}, {"id": 101209, "name": "西米谷"}, {"id": 101186, "name": "诺沃克"}, {
            "id": 101156,
            "name": "贝克斯菲尔德"
        }, {"id": 101170, "name": "费尔菲尔德"}, {"id": 101196, "name": "里亚托"}, {"id": 101197, "name": "里士满"}, {
            "id": 101198,
            "name": "里弗塞得"
        }, {"id": 101182, "name": "长滩"}]
    }, {
        "id": 11177,
        "name": "北卡罗来纳",
        "cities": [{"id": 101258, "name": "凯利"}, {"id": 101041, "name": "夏洛特"}, {
            "id": 101261,
            "name": "威尔明顿"
        }, {"id": 101040, "name": "教堂山"}, {"id": 101042, "name": "杜罕"}, {"id": 101043, "name": "格林斯伯勒"}, {
            "id": 101045,
            "name": "洛利杜罕都会区"
        }, {"id": 101260, "name": "海波特"}, {"id": 101262, "name": "温斯顿.萨利姆"}, {
            "id": 101044,
            "name": "罗利"
        }, {"id": 101039, "name": "艾许维尔"}, {"id": 101259, "name": "费耶特维尔"}]
    }, {
        "id": 11178,
        "name": "北达科他",
        "cities": [{"id": 101046, "name": "俾斯麦"}, {"id": 101048, "name": "大福克斯"}, {
            "id": 101047,
            "name": "法戈"
        }, {"id": 101049, "name": "迈诺特"}]
    }, {
        "id": 11191,
        "name": "华盛顿",
        "cities": [{"id": 101124, "name": "塔科马"}, {"id": 101123, "name": "斯波坎"}, {
            "id": 101426,
            "name": "肯特"
        }, {"id": 101425, "name": "艾佛雷特"}, {"id": 101427, "name": "范库弗峰"}, {"id": 101122, "name": "西雅图"}, {
            "id": 101424,
            "name": "贝尔维尤"
        }]
    }, {
        "id": 11184,
        "name": "南卡罗来纳",
        "cities": [{"id": 101085, "name": "北查尔斯顿"}, {"id": 101084, "name": "哥伦比亚"}, {"id": 101083, "name": "查尔斯顿"}]
    }, {
        "id": 11185,
        "name": "南达科他",
        "cities": [{"id": 101087, "name": "拉皮德城"}, {"id": 101088, "name": "苏福尔斯"}, {"id": 101086, "name": "阿伯丁"}]
    }, {
        "id": 11158,
        "name": "印第安那",
        "cities": [{"id": 101247, "name": "南本德"}, {"id": 100953, "name": "印第安纳波利斯"}, {
            "id": 100951,
            "name": "埃文斯维尔"
        }, {"id": 100952, "name": "韦恩堡"}]
    }, {
        "id": 11152,
        "name": "哥伦比亚特区",
        "cities": [{"id": 101227, "name": "华盛顿"}, {"id": 100903, "name": "华盛顿哥伦比亚特区"}]
    }, {
        "id": 11160,
        "name": "堪萨斯",
        "cities": [{"id": 100960, "name": "劳伦斯"}, {"id": 100958, "name": "哈钦森"}, {
            "id": 100959,
            "name": "堪萨斯城"
        }, {"id": 100963, "name": "奥弗兰公园"}, {"id": 101248, "name": "奥拉西"}, {"id": 100965, "name": "威奇托"}, {
            "id": 100964,
            "name": "托皮卡"
        }, {"id": 100962, "name": "曼哈顿"}, {"id": 100961, "name": "莱文沃思"}, {"id": 100957, "name": "阿比林"}]
    }, {
        "id": 11155,
        "name": "夏威夷",
        "cities": [{"id": 100920, "name": "凯卢阿"}, {"id": 100918, "name": "希洛"}, {"id": 100919, "name": "檀香山"}]
    }, {
        "id": 11193,
        "name": "威斯康星",
        "cities": [{"id": 101131, "name": "基诺沙"}, {"id": 101136, "name": "奥什科什"}, {
            "id": 101135,
            "name": "密尔沃基"
        }, {"id": 101138, "name": "希博伊根"}, {"id": 101132, "name": "拉克罗斯"}, {"id": 101137, "name": "拉辛"}, {
            "id": 101130,
            "name": "格林贝"
        }, {"id": 101129, "name": "欧克莱尓"}, {"id": 101139, "name": "沃索"}, {"id": 101133, "name": "迈迪逊"}, {
            "id": 101128,
            "name": "阿普尓顿"
        }, {"id": 101134, "name": "马尼托沃克"}]
    }, {
        "id": 11182,
        "name": "宾夕法尼亚",
        "cities": [{"id": 101266, "name": "伊利"}, {"id": 101075, "name": "匹兹堡"}, {
            "id": 101074,
            "name": "费城"
        }, {"id": 101073, "name": "阿伦敦"}]
    }, {
        "id": 11166,
        "name": "密歇根",
        "cities": [{"id": 100992, "name": "休伦港"}, {"id": 100989, "name": "兰辛"}, {
            "id": 100988,
            "name": "卡拉马袓"
        }, {"id": 100987, "name": "大急流城"}, {"id": 100981, "name": "安娜堡"}, {
            "id": 100982,
            "name": "巴特尔克里克"
        }, {"id": 100985, "name": "底特律"}, {"id": 100991, "name": "庞菷亚克"}, {"id": 100986, "name": "弗林特"}, {
            "id": 100996,
            "name": "怀恩多特"
        }, {"id": 101252, "name": "斯特灵海茨"}, {"id": 100995, "name": "沃伦"}, {"id": 100994, "name": "苏圣玛丽"}, {
            "id": 100993,
            "name": "萨吉诺"
        }, {"id": 100983, "name": "贝城"}, {"id": 100984, "name": "迪尔伯恩"}, {"id": 100990, "name": "马斯基根"}]
    }, {
        "id": 11169,
        "name": "密苏里",
        "cities": [{"id": 101007, "name": "哥伦比亚"}, {"id": 101010, "name": "圣路易斯"}, {
            "id": 101009,
            "name": "堪萨斯城"
        }, {"id": 101011, "name": "斯普林菲尔德"}, {"id": 101008, "name": "杰佛逊市"}, {"id": 101253, "name": "独立城"}]
    }, {
        "id": 11168,
        "name": "密西西比",
        "cities": [{"id": 101003, "name": "哈蒂斯堡"}, {"id": 101004, "name": "杰克逊"}, {
            "id": 101002,
            "name": "格尔夫波特"
        }, {"id": 101001, "name": "格林维尔"}, {"id": 101000, "name": "比洛克西"}, {
            "id": 101006,
            "name": "维克斯堡"
        }, {"id": 101005, "name": "默里迪恩"}]
    }, {
        "id": 11150,
        "name": "康涅狄格",
        "cities": [{"id": 100894, "name": "哈特福德"}, {"id": 100891, "name": "布里奇波特"}, {
            "id": 101226,
            "name": "斯坦福"
        }, {"id": 100896, "name": "新不列颠"}, {"id": 100893, "name": "格林尼治"}, {
            "id": 100898,
            "name": "沃特伯里"
        }, {"id": 100895, "name": "米德尔顿"}, {"id": 100897, "name": "纽黑文"}, {"id": 100892, "name": "达里恩"}, {
            "id": 100899,
            "name": "韦斯特波特"
        }]
    }, {
        "id": 11187,
        "name": "德州",
        "cities": [{"id": 101276, "name": "丹敦"}, {"id": 101103, "name": "交维斯顿"}, {
            "id": 101104,
            "name": "休斯敦"
        }, {"id": 101279, "name": "加兰"}, {"id": 101272, "name": "博蒙特"}, {"id": 101274, "name": "卡罗敦"}, {
            "id": 101100,
            "name": "哥帕斯基斯蒂"
        }, {"id": 101107, "name": "圣安东尼奥"}, {"id": 101102, "name": "埃尔帕索"}, {"id": 101282, "name": "基林"}, {
            "id": 101275,
            "name": "大学城"
        }, {"id": 101280, "name": "大草原城"}, {"id": 101099, "name": "奥斯汀"}, {
            "id": 101296,
            "name": "威奇托福尔斯"
        }, {"id": 101291, "name": "布兰诺"}, {"id": 101273, "name": "布朗斯维尔"}, {
            "id": 101289,
            "name": "帕萨迪纳"
        }, {"id": 101278, "name": "弗里斯科"}, {"id": 101284, "name": "拉伯克"}, {"id": 101105, "name": "拉雷多"}, {
            "id": 101288,
            "name": "敖德萨"
        }, {"id": 101293, "name": "朗德罗克"}, {"id": 101286, "name": "梅斯基特"}, {"id": 101290, "name": "梨城"}, {
            "id": 101281,
            "name": "欧文"
        }, {"id": 101277, "name": "沃斯堡"}, {"id": 101294, "name": "泰勒"}, {"id": 101292, "name": "理查森"}, {
            "id": 101287,
            "name": "米德兰"
        }, {"id": 101283, "name": "路易斯维尔"}, {"id": 101101, "name": "达拉斯"}, {"id": 101269, "name": "阿比林"}, {
            "id": 101271,
            "name": "阿灵顿"
        }, {"id": 101270, "name": "阿马里洛"}, {"id": 101295, "name": "韦科"}, {"id": 101106, "name": "麦卡伦"}, {
            "id": 101285,
            "name": "麦金尼"
        }]
    }, {
        "id": 11194,
        "name": "怀俄明州",
        "cities": [{"id": 101140, "name": "卡斯帕"}, {"id": 101142, "name": "埃文斯顿"}, {
            "id": 101141,
            "name": "夏延"
        }, {"id": 101143, "name": "拉勒米"}, {"id": 101144, "name": "罗克斯普林斯"}, {"id": 101145, "name": "谢里登"}]
    }, {
        "id": 11175,
        "name": "新墨西哥",
        "cities": [{"id": 101035, "name": "圣菲"}, {"id": 101033, "name": "拉斯克鲁塞斯"}, {
            "id": 101034,
            "name": "罗斯韦尔"
        }, {"id": 101032, "name": "阿尔伯克基"}]
    }, {
        "id": 11174,
        "name": "新泽西",
        "cities": [{"id": 101255, "name": "伊丽莎白"}, {"id": 101031, "name": "帕特森"}, {
            "id": 101029,
            "name": "泽西城"
        }, {"id": 101254, "name": "爱迪生"}, {"id": 101030, "name": "纽瓦克"}]
    }, {
        "id": 11173,
        "name": "新罕布什尔",
        "cities": [{"id": 101026, "name": "康科德"}, {"id": 101027, "name": "曼彻斯特"}, {"id": 101028, "name": "纳舒厄"}]
    }, {
        "id": 11167,
        "name": "明尼苏达",
        "cities": [{"id": 100999, "name": "圣保罗"}, {"id": 100997, "name": "明尼阿波利斯"}, {"id": 100998, "name": "罗切斯特"}]
    }, {
        "id": 11159,
        "name": "爱荷华",
        "cities": [{"id": 100956, "name": "得梅因"}, {"id": 100955, "name": "达文波特"}, {"id": 100954, "name": "锡达拉皮兹"}]
    }, {
        "id": 11156,
        "name": "爱达荷州",
        "cities": [{"id": 100921, "name": "亚美利加瀑布城"}, {"id": 100927, "name": "刘易斯顿"}, {
            "id": 100923,
            "name": "博伊西"
        }, {"id": 100929, "name": "墨菲"}, {"id": 100926, "name": "岂彻姆"}, {"id": 100922, "name": "布莱克富特"}, {
            "id": 100932,
            "name": "森瓦利"
        }, {"id": 100930, "name": "楠帕"}, {"id": 100931, "name": "波卡特洛"}, {
            "id": 100925,
            "name": "爱达荷福尔斯"
        }, {"id": 100924, "name": "科达伦"}, {"id": 100928, "name": "莫斯科"}]
    }, {
        "id": 11151,
        "name": "特拉华",
        "cities": [{"id": 100900, "name": "多佛"}, {"id": 100902, "name": "威明顿"}, {"id": 100901, "name": "纽瓦克"}]
    }, {
        "id": 11188,
        "name": "犹他",
        "cities": [{"id": 101114, "name": "圣乔治"}, {"id": 101109, "name": "奥格登"}, {
            "id": 101111,
            "name": "帕克城"
        }, {"id": 101112, "name": "普罗沃"}, {"id": 101110, "name": "欧仁"}, {"id": 101113, "name": "盐湖城"}, {
            "id": 101297,
            "name": "西乔丹"
        }, {"id": 101115, "name": "西瓦利城"}, {"id": 101108, "name": "雷登"}]
    }, {
        "id": 11186,
        "name": "田纳西",
        "cities": [{"id": 101098, "name": "三城区"}, {"id": 101267, "name": "克拉克维尔"}, {
            "id": 101096,
            "name": "士麦那"
        }, {"id": 101094, "name": "孟菲斯"}, {"id": 101089, "name": "布利斯托"}, {
            "id": 101097,
            "name": "斯普林希尔"
        }, {"id": 101090, "name": "查塔努加"}, {"id": 101091, "name": "约翰逊城"}, {
            "id": 101095,
            "name": "纳什维尔"
        }, {"id": 101093, "name": "诺克斯维尔"}, {"id": 101092, "name": "金斯波特"}, {"id": 101268, "name": "默弗里斯伯勒"}]
    }, {
        "id": 11149,
        "name": "科罗拉多",
        "cities": [{"id": 100887, "name": "丹佛"}, {"id": 100885, "name": "博尔德"}, {
            "id": 100889,
            "name": "大章克申"
        }, {"id": 100884, "name": "奥罗拉"}, {"id": 101225, "name": "威斯敏斯特"}, {
            "id": 101223,
            "name": "普韦布洛"
        }, {"id": 100888, "name": "柯林斯堡"}, {"id": 101224, "name": "桑顿"}, {"id": 101221, "name": "森特尼尔"}, {
            "id": 100886,
            "name": "科罗拉多斯普林斯"
        }, {"id": 101222, "name": "莱克伍德"}, {"id": 100883, "name": "阿斯彭"}, {"id": 101220, "name": "阿瓦达"}, {
            "id": 100890,
            "name": "韦尔"
        }]
    }, {
        "id": 11176,
        "name": "纽约",
        "cities": [{"id": 101036, "name": "布法罗"}, {"id": 101257, "name": "扬克斯"}, {
            "id": 101037,
            "name": "纽约市"
        }, {"id": 101038, "name": "罗切斯特"}, {"id": 101256, "name": "雪城"}]
    }, {
        "id": 11190,
        "name": "维吉尼亚",
        "cities": [{"id": 101324, "name": "丁威迪"}, {"id": 101399, "name": "丹维尔"}, {
            "id": 101346,
            "name": "乔治王"
        }, {"id": 101369, "name": "乔治王子县"}, {"id": 101393, "name": "亚历山大港"}, {
            "id": 101341,
            "name": "亨利"
        }, {"id": 101340, "name": "亨利科"}, {"id": 101364, "name": "佩奇县"}, {"id": 101319, "name": "克拉尔克"}, {
            "id": 101320,
            "name": "克雷格"
        }, {"id": 101348, "name": "兰开斯特"}, {"id": 101318, "name": "切斯特菲尔德"}, {
            "id": 101119,
            "name": "切萨皮克"
        }, {"id": 101407, "name": "列克星敦"}, {"id": 101314, "name": "加罗林"}, {"id": 101403, "name": "加莱克斯"}, {
            "id": 101350,
            "name": "劳登郡"
        }, {"id": 101360, "name": "北安普敦"}, {"id": 101388, "name": "华盛顿"}, {"id": 101381, "name": "南安普敦"}, {
            "id": 101309,
            "name": "博特托尔特"
        }, {"id": 101315, "name": "卡罗尔"}, {"id": 101352, "name": "卢嫩堡郡"}, {"id": 101334, "name": "古奇兰"}, {
            "id": 101380,
            "name": "史密斯"
        }, {"id": 101338, "name": "哈利法克斯"}, {"id": 101405, "name": "哈里森堡"}, {
            "id": 101345,
            "name": "国王与王后县"
        }, {"id": 101322, "name": "坎伯兰"}, {"id": 101313, "name": "坎贝尔"}, {"id": 101325, "name": "埃塞克斯"}, {
            "id": 101386,
            "name": "塔兹韦尔"
        }, {"id": 101419, "name": "士丹顿"}, {"id": 101317, "name": "夏洛特"}, {"id": 101396, "name": "夏洛茨维尔"}, {
            "id": 101363,
            "name": "奥兰治"
        }, {"id": 101305, "name": "奥古斯塔"}, {"id": 101422, "name": "威廉斯堡"}, {"id": 101347, "name": "威廉王"}, {
            "id": 101370,
            "name": "威廉王子县"
        }, {"id": 101391, "name": "威斯"}, {"id": 101389, "name": "威斯特摩兰德"}, {
            "id": 101330,
            "name": "富兰克林"
        }, {"id": 101306, "name": "巴斯"}, {"id": 101310, "name": "布伦瑞克"}, {"id": 101308, "name": "布兰德"}, {
            "id": 101311,
            "name": "布坎南"
        }, {"id": 101395, "name": "布尤纳维斯塔"}, {"id": 101394, "name": "布里斯托尔"}, {
            "id": 101365,
            "name": "帕特里克"
        }, {"id": 101321, "name": "库尔佩珀"}, {"id": 101329, "name": "弗卢万纳"}, {
            "id": 101121,
            "name": "弗吉尼亚比奇"
        }, {"id": 101328, "name": "弗洛伊德"}, {"id": 101331, "name": "弗雷德里克"}, {
            "id": 101402,
            "name": "弗雷德里克斯堡"
        }, {"id": 101414, "name": "彼得斯堡"}, {"id": 101390, "name": "怀斯"}, {"id": 101343, "name": "怀特岛"}, {
            "id": 101400,
            "name": "恩波利亚"
        }, {"id": 101377, "name": "拉塞尔"}, {"id": 101372, "name": "拉帕汉诺克"}, {
            "id": 101383,
            "name": "斯塔福德"
        }, {"id": 101382, "name": "斯波特瑟尔韦尼亚"}, {"id": 101378, "name": "斯科特"}, {
            "id": 101359,
            "name": "新肯特"
        }, {"id": 101415, "name": "普库森"}, {"id": 101371, "name": "普瓦斯基"}, {"id": 101416, "name": "朴茨茅斯"}, {
            "id": 101349,
            "name": "李县"
        }, {"id": 101408, "name": "林奇堡"}, {"id": 101316, "name": "查尔斯城"}, {"id": 101336, "name": "格林"}, {
            "id": 101337,
            "name": "格林维尔"
        }, {"id": 101333, "name": "格洛斯特"}, {"id": 101335, "name": "格雷森"}, {"id": 101355, "name": "梅克伦堡"}, {
            "id": 101404,
            "name": "汉普顿"
        }, {"id": 101339, "name": "汉诺威"}, {"id": 101387, "name": "沃伦"}, {"id": 101367, "name": "波瓦坦"}, {
            "id": 101374,
            "name": "洛亚诺克"
        }, {"id": 101342, "name": "海兰"}, {"id": 101423, "name": "温彻斯特"}, {
            "id": 101368,
            "name": "爱德华王子县"
        }, {"id": 101417, "name": "瑞德福"}, {"id": 101312, "name": "白金汉"}, {"id": 101366, "name": "皮特斯瓦"}, {
            "id": 101375,
            "name": "石桥郡"
        }, {"id": 101327, "name": "福基尔"}, {"id": 101401, "name": "福尔斯彻奇"}, {"id": 101398, "name": "科文顿"}, {
            "id": 101397,
            "name": "科隆尼尔海次"
        }, {"id": 101356, "name": "米德尔塞克斯"}, {"id": 101392, "name": "约克"}, {"id": 101358, "name": "纳尔逊"}, {
            "id": 101412,
            "name": "纽波特纽斯"
        }, {"id": 101376, "name": "罗金厄姆"}, {"id": 101385, "name": "苏塞克斯"}, {"id": 101418, "name": "萨利姆"}, {
            "id": 101420,
            "name": "萨福克"
        }, {"id": 101384, "name": "萨里"}, {"id": 101357, "name": "蒙哥马利"}, {"id": 101344, "name": "詹姆斯城"}, {
            "id": 101362,
            "name": "诺托韦"
        }, {"id": 101361, "name": "诺森伯兰郡"}, {"id": 101120, "name": "诺福克"}, {"id": 101413, "name": "诺顿"}, {
            "id": 101379,
            "name": "谢南多厄"
        }, {"id": 101307, "name": "贝德福"}, {"id": 101326, "name": "费尔法克斯"}, {"id": 101332, "name": "贾尔斯"}, {
            "id": 101351,
            "name": "路易莎郡"
        }, {"id": 101323, "name": "迪肯森"}, {"id": 101373, "name": "里士满"}, {"id": 101300, "name": "阿利根尼"}, {
            "id": 101299,
            "name": "阿尔伯马尔"
        }, {"id": 101303, "name": "阿波马托克斯"}, {"id": 101304, "name": "阿灵顿"}, {
            "id": 101298,
            "name": "阿科马克"
        }, {"id": 101301, "name": "阿米利亚"}, {"id": 101302, "name": "阿默斯特"}, {
            "id": 101406,
            "name": "霍普韦尔"
        }, {"id": 101421, "name": "韦恩斯伯勒"}, {"id": 101411, "name": "马丁斯维尔"}, {
            "id": 101354,
            "name": "马修斯"
        }, {"id": 101409, "name": "马纳萨斯"}, {"id": 101410, "name": "马纳萨斯帕克"}, {"id": 101353, "name": "麦迪逊"}]
    }, {
        "id": 11163,
        "name": "缅因",
        "cities": [{"id": 100973, "name": "刘易斯顿"}, {"id": 100974, "name": "波特兰"}, {"id": 100972, "name": "班戈"}]
    }, {
        "id": 11183,
        "name": "罗德岛",
        "cities": [{"id": 101076, "name": "克兰斯顿"}, {"id": 101082, "name": "文索基特"}, {
            "id": 101079,
            "name": "普罗维登斯"
        }, {"id": 101080, "name": "沃威克"}, {"id": 101078, "name": "波塔基特"}, {"id": 101077, "name": "纽波特"}, {
            "id": 101081,
            "name": "韦斯特利"
        }]
    }, {
        "id": 11161,
        "name": "肯塔基",
        "cities": [{"id": 100966, "name": "列克星敦"}, {"id": 100968, "name": "欧文斯伯勒"}, {"id": 100967, "name": "路易斯维尔"}]
    }, {
        "id": 11170,
        "name": "蒙大拿",
        "cities": [{"id": 101013, "name": "大瀑布村"}, {"id": 101012, "name": "比灵斯"}, {"id": 101014, "name": "米苏拉"}]
    }, {
        "id": 11192,
        "name": "西佛吉尼亚",
        "cities": [{"id": 101126, "name": "亨廷顿"}, {"id": 101127, "name": "帕克斯堡"}, {"id": 101125, "name": "查尔斯顿"}]
    }, {
        "id": 11162,
        "name": "路易斯安那",
        "cities": [{"id": 100971, "name": "什里夫波特"}, {"id": 100969, "name": "巴吞鲁日"}, {
            "id": 101249,
            "name": "拉法叶"
        }, {"id": 100970, "name": "新奥尔良"}]
    }, {
        "id": 11144,
        "name": "阿拉巴马",
        "cities": [{"id": 101149, "name": "亨茨维尔"}, {"id": 100863, "name": "伯明罕"}, {
            "id": 100864,
            "name": "莫比尔"
        }, {"id": 100865, "name": "蒙哥马利"}]
    }, {
        "id": 11145,
        "name": "阿拉斯加",
        "cities": [{"id": 100866, "name": "安克雷奇"}, {"id": 100868, "name": "朱诺"}, {"id": 100867, "name": "费尔班克斯"}]
    }, {
        "id": 11147,
        "name": "阿肯色",
        "cities": [{"id": 100877, "name": "史密斯堡"}, {"id": 100878, "name": "小石城"}, {"id": 100876, "name": "费耶特维尔"}]
    }, {
        "id": 11165,
        "name": "马萨诸塞",
        "cities": [{"id": 100980, "name": "伍斯特"}, {"id": 101250, "name": "剑桥"}, {
            "id": 100979,
            "name": "斯普林菲尔德"
        }, {"id": 100978, "name": "波士顿"}, {"id": 101251, "name": "洛厄尔"}]
    }, {
        "id": 11164,
        "name": "马里兰",
        "cities": [{"id": 100975, "name": "巴尔的摩"}, {"id": 100976, "name": "盖瑟斯堡"}, {"id": 100977, "name": "罗克维尔"}]
    }]
}, {"id": 1127, "name": "老挝", "provinces": []}, {"id": 1122, "name": "肯尼亚", "provinces": []}, {
    "id": 1113,
    "name": "芬兰",
    "provinces": []
}, {"id": 1154, "name": "苏丹", "provinces": []}, {"id": 1159, "name": "苏里南", "provinces": []}, {
    "id": 1023,
    "name": "英国",
    "provinces": [{
        "id": 10310,
        "name": "北爱尔兰",
        "cities": [{"id": 100579, "name": "利斯本"}, {"id": 100578, "name": "德里"}, {
            "id": 100580,
            "name": "纽里"
        }, {"id": 100577, "name": "贝尔法斯特"}]
    }, {
        "id": 10312,
        "name": "威尔士",
        "cities": [{"id": 100588, "name": "卡迪夫"}, {"id": 100590, "name": "斯旺西"}, {
            "id": 100587,
            "name": "班戈"
        }, {"id": 100589, "name": "纽波特"}]
    }, {
        "id": 10311,
        "name": "苏格兰",
        "cities": [{"id": 100582, "name": "丹迪"}, {"id": 100585, "name": "因弗内斯"}, {
            "id": 100586,
            "name": "斯特灵"
        }, {"id": 100584, "name": "格拉斯哥"}, {"id": 100583, "name": "爱丁堡"}, {"id": 100581, "name": "阿伯丁"}]
    }, {
        "id": 10309,
        "name": "英格兰",
        "cities": [{"id": 100541, "name": "伊利"}, {"id": 100574, "name": "伍尔弗汉普顿"}, {
            "id": 100575,
            "name": "伍斯特"
        }, {"id": 100552, "name": "伦敦"}, {"id": 100529, "name": "伯明翰"}, {"id": 100546, "name": "兰开斯特"}, {
            "id": 100536,
            "name": "切斯特"
        }, {"id": 100548, "name": "列斯特"}, {"id": 100549, "name": "利奇菲尔德"}, {"id": 100551, "name": "利物浦"}, {
            "id": 100547,
            "name": "利茲"
        }, {"id": 100533, "name": "剑桥"}, {"id": 100567, "name": "南安普敦"}, {"id": 100535, "name": "卡莱尔"}, {
            "id": 100563,
            "name": "圣阿本斯"
        }, {"id": 100534, "name": "坎特伯雷"}, {"id": 100537, "name": "奇切斯特"}, {"id": 100572, "name": "威尔斯"}, {
            "id": 100528,
            "name": "巴斯"
        }, {"id": 100530, "name": "布拉德福德"}, {"id": 100531, "name": "布莱顿霍夫"}, {
            "id": 100532,
            "name": "布里斯托尔"
        }, {"id": 100558, "name": "彼得伯勒"}, {"id": 100539, "name": "德比"}, {"id": 100540, "name": "德罕"}, {
            "id": 100559,
            "name": "普利茅斯"
        }, {"id": 100561, "name": "普雷斯顿"}, {"id": 100553, "name": "曼彻斯特"}, {
            "id": 100560,
            "name": "朴茨茅斯"
        }, {"id": 100550, "name": "林肯"}, {"id": 100543, "name": "格洛斯特"}, {"id": 100569, "name": "桑德兰"}, {
            "id": 100573,
            "name": "温彻斯特"
        }, {"id": 100542, "name": "爱塞特"}, {"id": 100557, "name": "牛津"}, {
            "id": 100568,
            "name": "特伦特河畔斯多克"
        }, {"id": 100570, "name": "特鲁罗"}, {"id": 100565, "name": "索尔斯堡"}, {"id": 100564, "name": "索福特"}, {
            "id": 100576,
            "name": "约克"
        }, {"id": 100554, "name": "纽卡斯尔"}, {"id": 100538, "name": "考文垂"}, {"id": 100556, "name": "诺丁汉"}, {
            "id": 100555,
            "name": "诺里奇"
        }, {"id": 100566, "name": "谢菲尔德"}, {"id": 100545, "name": "赫尔河畔京斯敦"}, {
            "id": 100544,
            "name": "赫里福德"
        }, {"id": 100562, "name": "里彭"}, {"id": 100571, "name": "韦克菲尔德"}]
    }]
}, {
    "id": 1062,
    "name": "荷兰",
    "provinces": [{"id": 10760, "name": "乌得勒支", "cities": []}, {
        "id": 10761,
        "name": "佐特尔梅",
        "cities": []
    }, {"id": 10762, "name": "兹沃勒", "cities": []}, {"id": 10752, "name": "吕伐登", "cities": []}, {
        "id": 10749,
        "name": "哈勒姆",
        "cities": []
    }, {"id": 10745, "name": "埃因霍芬", "cities": []}, {"id": 10744, "name": "埃德", "cities": []}, {
        "id": 10746,
        "name": "埃门",
        "cities": []
    }, {"id": 10743, "name": "多德雷赫特", "cities": []}, {"id": 10757, "name": "奈梅亨", "cities": []}, {
        "id": 10742,
        "name": "布雷达",
        "cities": []
    }, {"id": 10747, "name": "恩斯赫德", "cities": []}, {"id": 10735, "name": "斯海尔托亨博思", "cities": []}, {
        "id": 10748,
        "name": "格罗宁根",
        "cities": []
    }, {"id": 10750, "name": "海牙", "cities": []}, {"id": 10756, "name": "米德尔堡", "cities": []}, {
        "id": 10754,
        "name": "莱利斯塔德",
        "cities": []
    }, {"id": 10753, "name": "莱顿", "cities": []}, {"id": 10759, "name": "蒂尔堡", "cities": []}, {
        "id": 10738,
        "name": "阿姆斯特丹",
        "cities": []
    }, {"id": 10736, "name": "阿尔梅勒", "cities": []}, {"id": 10741, "name": "阿森", "cities": []}, {
        "id": 10739,
        "name": "阿珀尔多伦",
        "cities": []
    }, {"id": 10740, "name": "阿纳姆", "cities": []}, {"id": 10737, "name": "阿默斯福特", "cities": []}, {
        "id": 10751,
        "name": "霍夫多尔普",
        "cities": []
    }, {"id": 10755, "name": "马斯特里赫特", "cities": []}, {"id": 10758, "name": "鹿特丹", "cities": []}]
}, {"id": 1060, "name": "莫桑比克", "provinces": []}, {"id": 1131, "name": "莱索托", "provinces": []}, {
    "id": 1065,
    "name": "菲律宾",
    "provinces": [{"id": 10787, "name": "卡卢坎", "cities": []}, {"id": 10788, "name": "宿务", "cities": []}, {
        "id": 10789,
        "name": "达沃",
        "cities": []
    }, {"id": 10790, "name": "马尼拉", "cities": []}]
}, {"id": 1085, "name": "萨摩亚", "provinces": []}, {
    "id": 1067,
    "name": "葡萄牙",
    "provinces": [{"id": 10795, "name": "万福", "cities": []}, {"id": 10794, "name": "上特拉斯山", "cities": []}, {
        "id": 10793,
        "name": "上阿连特茹",
        "cities": []
    }, {"id": 10798, "name": "下伏日", "cities": []}, {"id": 10797, "name": "下蒙德古", "cities": []}, {
        "id": 10796,
        "name": "下阿连特茹",
        "cities": []
    }, {"id": 10791, "name": "中阿连特茹", "cities": []}, {"id": 10806, "name": "丰沙尔", "cities": []}, {
        "id": 10813,
        "name": "内皮尼亚尔北",
        "cities": []
    }, {"id": 10814, "name": "内皮尼亚尔南", "cities": []}, {"id": 10799, "name": "内贝拉北", "cities": []}, {
        "id": 10800,
        "name": "内贝拉南",
        "cities": []
    }, {"id": 10807, "name": "利巴特茹", "cities": []}, {"id": 10801, "name": "卡瓦多", "cities": []}, {
        "id": 10819,
        "name": "塔梅加",
        "cities": []
    }, {"id": 10812, "name": "塞图巴尔半岛", "cities": []}, {"id": 10818, "name": "山后", "cities": []}, {
        "id": 10804,
        "name": "恩特拉杜罗伏日",
        "cities": []
    }, {"id": 10803, "name": "杜罗", "cities": []}, {"id": 10809, "name": "梅地奥特茹", "cities": []}, {
        "id": 10805,
        "name": "法鲁",
        "cities": []
    }, {"id": 10817, "name": "波尔图", "cities": []}, {"id": 10815, "name": "滨海皮尼亚尔", "cities": []}, {
        "id": 10792,
        "name": "滨海阿连特茹",
        "cities": []
    }, {"id": 10802, "name": "科瓦贝拉", "cities": []}, {"id": 10810, "name": "米尼奥-利马", "cities": []}, {
        "id": 10816,
        "name": "蓬塔德尔加达",
        "cities": []
    }, {"id": 10811, "name": "西部", "cities": []}, {"id": 10808, "name": "里斯本", "cities": []}]
}, {"id": 1137, "name": "蒙古", "provinces": []}, {
    "id": 1020,
    "name": "西班牙",
    "provinces": [{"id": 10247, "name": "加的斯", "cities": []}, {"id": 10246, "name": "卡塞雷斯", "cities": []}, {
        "id": 10248,
        "name": "卡斯特利翁",
        "cities": []
    }, {"id": 10270, "name": "卢戈", "cities": []}, {"id": 10255, "name": "吉普斯夸", "cities": []}, {
        "id": 10258,
        "name": "哈恩",
        "cities": []
    }, {"id": 10273, "name": "圣克鲁斯-德特内里费", "cities": []}, {"id": 10278, "name": "塔拉戈纳", "cities": []}, {
        "id": 10275,
        "name": "塞哥维亚",
        "cities": []
    }, {"id": 10276, "name": "塞维利亚", "cities": []}, {"id": 10268, "name": "奥伦塞", "cities": []}, {
        "id": 10281,
        "name": "巴伦西亚",
        "cities": []
    }, {"id": 10282, "name": "巴利亚多利德", "cities": []}, {"id": 10243, "name": "巴利阿里", "cities": []}, {
        "id": 10244,
        "name": "巴塞罗那",
        "cities": []
    }, {"id": 10242, "name": "巴达霍斯", "cities": []}, {"id": 10245, "name": "布尔戈斯", "cities": []}, {
        "id": 10269,
        "name": "帕伦西亚",
        "cities": []
    }, {"id": 10280, "name": "托莱多", "cities": []}, {"id": 10261, "name": "拉斯帕尔马斯", "cities": []}, {
        "id": 10259,
        "name": "拉科鲁尼亚",
        "cities": []
    }, {"id": 10260, "name": "拉里奥哈", "cities": []}, {"id": 10251, "name": "昆卡", "cities": []}, {
        "id": 10253,
        "name": "格拉纳达",
        "cities": []
    }, {"id": 10274, "name": "桑坦德", "cities": []}, {"id": 10283, "name": "比斯开", "cities": []}, {
        "id": 10279,
        "name": "特鲁埃尔",
        "cities": []
    }, {"id": 10254, "name": "瓜达拉哈拉", "cities": []}, {"id": 10250, "name": "科尔多瓦", "cities": []}, {
        "id": 10266,
        "name": "穆尔西亚",
        "cities": []
    }, {"id": 10277, "name": "索里亚", "cities": []}, {"id": 10267, "name": "纳瓦拉", "cities": []}, {
        "id": 10262,
        "name": "莱昂",
        "cities": []
    }, {"id": 10263, "name": "莱里达", "cities": []}, {"id": 10285, "name": "萨拉戈萨", "cities": []}, {
        "id": 10272,
        "name": "萨拉曼卡",
        "cities": []
    }, {"id": 10284, "name": "萨莫拉", "cities": []}, {"id": 10271, "name": "蓬特韦德拉", "cities": []}, {
        "id": 10252,
        "name": "赫罗纳",
        "cities": []
    }, {"id": 10238, "name": "阿利坎特", "cities": []}, {"id": 10239, "name": "阿尔梅里亚", "cities": []}, {
        "id": 10237,
        "name": "阿尔瓦塞特",
        "cities": []
    }, {"id": 10236, "name": "阿拉瓦", "cities": []}, {"id": 10240, "name": "阿斯图利亚斯", "cities": []}, {
        "id": 10241,
        "name": "阿维拉",
        "cities": []
    }, {"id": 10249, "name": "雷阿尔城", "cities": []}, {"id": 10256, "name": "韦尔瓦", "cities": []}, {
        "id": 10257,
        "name": "韦斯卡",
        "cities": []
    }, {"id": 10264, "name": "马德里", "cities": []}, {"id": 10265, "name": "马拉加", "cities": []}]
}, {"id": 1096, "name": "贝宁", "provinces": []}, {"id": 1168, "name": "赞比亚", "provinces": []}, {
    "id": 1084,
    "name": "越南",
    "provinces": [{"id": 11220, "name": "河内", "cities": []}, {"id": 11219, "name": "海防", "cities": []}, {
        "id": 11221,
        "name": "胡志明市",
        "cities": []
    }]
}, {"id": 1090, "name": "阿塞拜疆", "provinces": []}, {"id": 1108, "name": "阿尔及利亚", "provinces": []}, {
    "id": 1088,
    "name": "阿尔巴尼亚",
    "provinces": []
}, {
    "id": 1000,
    "name": "阿拉伯联合酋长国",
    "provinces": [{"id": 10002, "name": "沙迦", "cities": []}, {"id": 10001, "name": "艾因", "cities": []}, {
        "id": 10003,
        "name": "迪拜",
        "cities": []
    }, {"id": 10000, "name": "阿布扎比", "cities": []}]
}, {"id": 1145, "name": "阿曼", "provinces": []}, {
    "id": 1003,
    "name": "阿根廷",
    "provinces": [{"id": 10053, "name": "乌斯怀亚", "cities": []}, {
        "id": 10055,
        "name": "克劳斯城",
        "cities": []
    }, {"id": 10035, "name": "内乌肯", "cities": []}, {"id": 10054, "name": "别德马", "cities": []}, {
        "id": 10024,
        "name": "卡塔马卡",
        "cities": []
    }, {"id": 10051, "name": "圣地亚哥-德尔埃斯特罗", "cities": []}, {"id": 10047, "name": "圣尼古拉斯", "cities": []}, {
        "id": 10048,
        "name": "圣拉斐尔",
        "cities": []
    }, {"id": 10046, "name": "圣米格尔-德图库曼", "cities": []}, {"id": 10050, "name": "圣罗莎", "cities": []}, {
        "id": 10044,
        "name": "圣胡安",
        "cities": []
    }, {"id": 10049, "name": "圣菲", "cities": []}, {"id": 10045, "name": "圣路易斯", "cities": []}, {
        "id": 10036,
        "name": "巴拉那",
        "cities": []
    }, {"id": 10022, "name": "布兰卡港", "cities": []}, {"id": 10023, "name": "布宜诺斯艾利斯", "cities": []}, {
        "id": 10031,
        "name": "拉普拉塔",
        "cities": []
    }, {"id": 10032, "name": "拉里奥哈", "cities": []}, {"id": 10037, "name": "波萨达斯", "cities": []}, {
        "id": 10052,
        "name": "特雷利乌",
        "cities": []
    }, {"id": 10029, "name": "福莫萨", "cities": []}, {"id": 10027, "name": "科尔多瓦", "cities": []}, {
        "id": 10028,
        "name": "科连特斯",
        "cities": []
    }, {"id": 10038, "name": "罗森", "cities": []}, {"id": 10042, "name": "罗萨里奥", "cities": []}, {
        "id": 10026,
        "name": "肯考迪娅",
        "cities": []
    }, {"id": 10030, "name": "胡胡伊", "cities": []}, {"id": 10043, "name": "萨尔塔", "cities": []}, {
        "id": 10041,
        "name": "里奥加耶戈斯",
        "cities": []
    }, {"id": 10040, "name": "里奥夸尔托", "cities": []}, {"id": 10025, "name": "里瓦达维亚海军准将城", "cities": []}, {
        "id": 10034,
        "name": "门多萨",
        "cities": []
    }, {"id": 10039, "name": "雷西斯滕匹亚", "cities": []}, {"id": 10033, "name": "马德普拉塔", "cities": []}]
}, {"id": 1006, "name": "阿鲁巴", "provinces": []}, {
    "id": 1045,
    "name": "韩国",
    "provinces": [{"id": 10626, "name": "仁川", "cities": []}, {"id": 10622, "name": "光州", "cities": []}, {
        "id": 10624,
        "name": "全罗北道",
        "cities": [{"id": 100662, "name": "井邑市"}, {"id": 100660, "name": "任实郡"}, {
            "id": 100663,
            "name": "全州市"
        }, {"id": 100666, "name": "南原市"}, {"id": 100668, "name": "完州郡"}, {"id": 100655, "name": "扶安郡"}, {
            "id": 100667,
            "name": "淳昌郡"
        }, {"id": 100659, "name": "益山市"}, {"id": 100658, "name": "群山市"}, {"id": 100665, "name": "茂朱郡"}, {
            "id": 100656,
            "name": "金堤市"
        }, {"id": 100664, "name": "鎭安郡"}, {"id": 100661, "name": "长水郡"}, {"id": 100657, "name": "高敞郡"}]
    }, {
        "id": 10625,
        "name": "全罗南道",
        "cities": [{"id": 100690, "name": "丽水市"}, {"id": 100675, "name": "光阳市"}, {
            "id": 100683,
            "name": "务安郡"
        }, {"id": 100678, "name": "和顺郡"}, {"id": 100677, "name": "咸平郡"}, {"id": 100669, "name": "宝城郡"}, {
            "id": 100671,
            "name": "康津郡"
        }, {"id": 100685, "name": "新安郡"}, {"id": 100682, "name": "木浦市"}, {"id": 100674, "name": "求礼郡"}, {
            "id": 100676,
            "name": "海南郡"
        }, {"id": 100670, "name": "潭阳郡"}, {"id": 100689, "name": "灵光郡"}, {"id": 100688, "name": "灵岩郡"}, {
            "id": 100681,
            "name": "珍岛郡"
        }, {"id": 100684, "name": "罗州市"}, {"id": 100687, "name": "莞岛郡"}, {"id": 100673, "name": "谷城郡"}, {
            "id": 100679,
            "name": "长兴郡"
        }, {"id": 100680, "name": "长城郡"}, {"id": 100686, "name": "顺天市"}, {"id": 100672, "name": "高兴郡"}]
    }, {"id": 10620, "name": "大田", "cities": []}, {
        "id": 10619,
        "name": "大邱",
        "cities": [{"id": 100634, "name": "大邱"}, {"id": 100636, "name": "寿城区"}, {"id": 100635, "name": "达城郡"}]
    }, {
        "id": 10617,
        "name": "庆尚北道",
        "cities": [{"id": 100606, "name": "义城郡"}, {"id": 100599, "name": "军威郡"}, {
            "id": 100592,
            "name": "奉化郡"
        }, {"id": 100591, "name": "安东市"}, {"id": 100604, "name": "尙州市"}, {"id": 100601, "name": "庆山市"}, {
            "id": 100600,
            "name": "庆州市"
        }, {"id": 100605, "name": "星州郡"}, {"id": 100610, "name": "永川市"}, {"id": 100603, "name": "浦项市"}, {
            "id": 100593,
            "name": "淸道郡"
        }, {"id": 100595, "name": "漆谷郡"}, {"id": 100611, "name": "盈德郡"}, {"id": 100613, "name": "英阳郡"}, {
            "id": 100612,
            "name": "荣州市"
        }, {"id": 100607, "name": "蔚珍郡"}, {"id": 100608, "name": "郁陵郡"}, {"id": 100609, "name": "醴泉郡"}, {
            "id": 100596,
            "name": "金泉市"
        }, {"id": 100602, "name": "闻庆市"}, {"id": 100594, "name": "靑松郡"}, {"id": 100597, "name": "高灵郡"}, {
            "id": 100598,
            "name": "龟尾市"
        }]
    }, {
        "id": 10618,
        "name": "庆尚南道",
        "cities": [{"id": 100628, "name": "南海郡"}, {"id": 100621, "name": "咸安郡"}, {
            "id": 100622,
            "name": "咸阳郡"
        }, {"id": 100619, "name": "固城郡"}, {"id": 100632, "name": "宜宁郡"}, {"id": 100627, "name": "密阳市"}, {
            "id": 100616,
            "name": "居昌郡"
        }, {"id": 100630, "name": "山淸郡"}, {"id": 100617, "name": "巨济市"}, {"id": 100615, "name": "昌原市"}, {
            "id": 100614,
            "name": "昌宁郡"
        }, {"id": 100625, "name": "晋州市"}, {"id": 100633, "name": "梁山市"}, {"id": 100620, "name": "河东郡"}, {
            "id": 100629,
            "name": "泗川市"
        }, {"id": 100631, "name": "统营市"}, {"id": 100618, "name": "金海市"}, {"id": 100624, "name": "鎭海市"}, {
            "id": 100623,
            "name": "陜川郡"
        }, {"id": 100626, "name": "马山市"}]
    }, {
        "id": 10628,
        "name": "忠清北道",
        "cities": [{"id": 100726, "name": "丹阳郡"}, {"id": 100729, "name": "堤川市"}, {
            "id": 100725,
            "name": "忠州市"
        }, {"id": 100722, "name": "报恩郡"}, {"id": 100730, "name": "曾坪郡"}, {"id": 100728, "name": "槐山郡"}, {
            "id": 100733,
            "name": "永同郡"
        }, {"id": 100732, "name": "沃川郡"}, {"id": 100724, "name": "淸原郡"}, {"id": 100723, "name": "淸州市"}, {
            "id": 100731,
            "name": "鎭川郡"
        }, {"id": 100727, "name": "阴城郡"}]
    }, {
        "id": 10629,
        "name": "忠清南道",
        "cities": [{"id": 100735, "name": "保宁市"}, {"id": 100741, "name": "公州市"}, {
            "id": 100739,
            "name": "唐津郡"
        }, {"id": 100737, "name": "天安市"}, {"id": 100736, "name": "扶余郡"}, {"id": 100747, "name": "泰安郡"}, {
            "id": 100743,
            "name": "洪城郡"
        }, {"id": 100748, "name": "燕岐郡"}, {"id": 100734, "name": "牙山市"}, {"id": 100746, "name": "瑞山市"}, {
            "id": 100749,
            "name": "礼山郡"
        }, {"id": 100745, "name": "舒川郡"}, {"id": 100744, "name": "论山市"}, {"id": 100740, "name": "锦山郡"}, {
            "id": 100738,
            "name": "青阳郡"
        }, {"id": 100742, "name": "鸡龙市"}]
    }, {
        "id": 10621,
        "name": "江原道",
        "cities": [{"id": 100648, "name": "三陟市"}, {"id": 100639, "name": "东海市"}, {
            "id": 100644,
            "name": "华川郡"
        }, {"id": 100651, "name": "原州市"}, {"id": 100650, "name": "太白市"}, {"id": 100654, "name": "宁越郡"}, {
            "id": 100647,
            "name": "平昌郡"
        }, {"id": 100646, "name": "旌善郡"}, {"id": 100638, "name": "春川市"}, {"id": 100649, "name": "束草市"}, {
            "id": 100652,
            "name": "杨口郡"
        }, {"id": 100642, "name": "横城郡"}, {"id": 100640, "name": "江陵市"}, {"id": 100643, "name": "洪川郡"}, {
            "id": 100653,
            "name": "襄阳郡"
        }, {"id": 100637, "name": "铁原郡"}, {"id": 100641, "name": "高城郡"}, {"id": 100645, "name": "麟蹄郡"}]
    }, {
        "id": 10627,
        "name": "济州岛",
        "cities": [{"id": 100695, "name": "东豆川市"}, {"id": 100708, "name": "乌山市"}, {
            "id": 100700,
            "name": "九里市"
        }, {"id": 100716, "name": "仪旺市"}, {"id": 100703, "name": "光明市"}, {"id": 100699, "name": "军浦市"}, {
            "id": 100706,
            "name": "利川市"
        }, {"id": 100696, "name": "加平郡"}, {"id": 100705, "name": "华城市"}, {"id": 100707, "name": "南杨州市"}, {
            "id": 100709,
            "name": "坡州市"
        }, {"id": 100712, "name": "城南市"}, {"id": 100713, "name": "始兴市"}, {"id": 100693, "name": "安养市"}, {
            "id": 100692,
            "name": "安城市"
        }, {"id": 100691, "name": "安山市"}, {"id": 100694, "name": "富川市"}, {"id": 100711, "name": "平泽市"}, {
            "id": 100702,
            "name": "广州市"
        }, {"id": 100718, "name": "扬平郡"}, {"id": 100710, "name": "抱川市"}, {"id": 100717, "name": "杨州市"}, {
            "id": 100701,
            "name": "果川市"
        }, {"id": 100714, "name": "水原市"}, {"id": 100704, "name": "河南市"}, {"id": 100720, "name": "涟川郡"}, {
            "id": 100715,
            "name": "议政府"
        }, {"id": 100697, "name": "金浦市"}, {"id": 100719, "name": "骊州郡"}, {"id": 100698, "name": "高阳市"}, {
            "id": 100721,
            "name": "龙仁市"
        }]
    }, {"id": 10623, "name": "济州特别自治道", "cities": []}, {"id": 10631, "name": "蔚山", "cities": []}, {
        "id": 10616,
        "name": "釜山",
        "cities": []
    }, {"id": 10630, "name": "首尔", "cities": []}]
}, {"id": 1053, "name": "马其顿", "provinces": []}, {
    "id": 1057,
    "name": "马尔代夫",
    "provinces": [{"id": 10652, "name": "北尼兰杜", "cities": []}, {
        "id": 10651,
        "name": "北米拉杜马杜卢",
        "cities": []
    }, {"id": 10649, "name": "北苏瓦迪瓦", "cities": []}, {"id": 10653, "name": "北蒂拉杜马蒂", "cities": []}, {
        "id": 10648,
        "name": "北阿里",
        "cities": []
    }, {"id": 10650, "name": "北马洛斯马杜卢", "cities": []}, {"id": 10658, "name": "南尼兰杜", "cities": []}, {
        "id": 10657,
        "name": "南米拉杜马杜卢",
        "cities": []
    }, {"id": 10655, "name": "南苏瓦迪瓦", "cities": []}, {"id": 10659, "name": "南蒂拉杜马蒂", "cities": []}, {
        "id": 10654,
        "name": "南阿里",
        "cities": []
    }, {"id": 10656, "name": "南马洛斯马杜卢", "cities": []}, {"id": 10643, "name": "哈杜马蒂", "cities": []}, {
        "id": 10640,
        "name": "法迪福卢",
        "cities": []
    }, {"id": 10642, "name": "福阿穆拉库", "cities": []}, {"id": 10644, "name": "科卢马杜卢", "cities": []}, {
        "id": 10647,
        "name": "穆拉库",
        "cities": []
    }, {"id": 10641, "name": "费利杜", "cities": []}, {"id": 10639, "name": "阿杜", "cities": []}, {
        "id": 10645,
        "name": "马累",
        "cities": []
    }, {"id": 10646, "name": "马累岛", "cities": []}]
}, {"id": 1139, "name": "马拉维", "provinces": []}, {
    "id": 1059,
    "name": "马来西亚",
    "provinces": [{
        "id": 10734,
        "name": "丁加奴",
        "cities": [{"id": 100858, "name": "乌鲁"}, {"id": 100856, "name": "勿述"}, {
            "id": 100862,
            "name": "实兆"
        }, {"id": 100860, "name": "瓜拉丁加奴"}, {"id": 100859, "name": "甘马挽"}, {"id": 100861, "name": "马江"}, {
            "id": 100857,
            "name": "龙运"
        }]
    }, {
        "id": 10722,
        "name": "吉兰丹",
        "cities": [{"id": 100775, "name": "丹那美拉"}, {"id": 100770, "name": "哥打巴鲁"}, {
            "id": 100774,
            "name": "巴西富地"
        }, {"id": 100773, "name": "巴西马"}, {"id": 100769, "name": "日里"}, {"id": 100771, "name": "瓜拉吉赖"}, {
            "id": 100767,
            "name": "登卓"
        }, {"id": 100768, "name": "话望生"}, {"id": 100776, "name": "道北"}, {"id": 100772, "name": "马樟"}]
    }, {
        "id": 10721,
        "name": "吉打",
        "cities": [{"id": 100759, "name": "万拉峇鲁"}, {"id": 100758, "name": "华玲"}, {
            "id": 100762,
            "name": "古邦巴素"
        }, {"id": 100760, "name": "哥打士打"}, {"id": 100763, "name": "居林"}, {"id": 100765, "name": "巴东得腊"}, {
            "id": 100764,
            "name": "浮罗交怡"
        }, {"id": 100761, "name": "瓜拉姆达"}, {"id": 100766, "name": "笨筒"}]
    }, {"id": 10723, "name": "吉隆坡", "cities": [{"id": 100777, "name": "吉隆坡"}]}, {
        "id": 10727,
        "name": "彭亨",
        "cities": [{"id": 100799, "name": "云冰"}, {"id": 100795, "name": "关丹"}, {
            "id": 100798,
            "name": "劳勿"
        }, {"id": 100797, "name": "北根"}, {"id": 100790, "name": "文冬"}, {"id": 100800, "name": "淡马鲁"}, {
            "id": 100791,
            "name": "百乐"
        }, {"id": 100794, "name": "立卑"}, {"id": 100793, "name": "而连突"}, {"id": 100792, "name": "金马仑高原"}, {
            "id": 100796,
            "name": "马兰"
        }]
    }, {
        "id": 10720,
        "name": "柔佛",
        "cities": [{"id": 100754, "name": "丰盛港"}, {"id": 100753, "name": "哥打丁宜"}, {
            "id": 100752,
            "name": "居銮"
        }, {"id": 100750, "name": "峇株巴辖"}, {"id": 100751, "name": "新山"}, {"id": 100757, "name": "昔加末"}, {
            "id": 100756,
            "name": "笨珍"
        }, {"id": 100755, "name": "麻坡"}]
    }, {
        "id": 10726,
        "name": "森美兰",
        "cities": [{"id": 100784, "name": "仁保"}, {"id": 100783, "name": "日叻务"}, {
            "id": 100787,
            "name": "林茂"
        }, {"id": 100786, "name": "波德申"}, {"id": 100789, "name": "淡边"}, {"id": 100785, "name": "瓜拉庇劳"}, {
            "id": 100788,
            "name": "芙蓉"
        }]
    }, {
        "id": 10730,
        "name": "槟榔屿",
        "cities": [{"id": 100811, "name": "北海"}, {"id": 100810, "name": "大山脚"}, {
            "id": 100812,
            "name": "槟城"
        }, {"id": 100813, "name": "高渊"}]
    }, {
        "id": 10731,
        "name": "沙巴",
        "cities": [{"id": 100835, "name": "丹南"}, {"id": 100817, "name": "京那巴登岸"}, {
            "id": 100831,
            "name": "仙本那"
        }, {"id": 100814, "name": "保佛"}, {"id": 100829, "name": "兰脑"}, {"id": 100827, "name": "兵南邦"}, {
            "id": 100818,
            "name": "古打毛律"
        }, {"id": 100823, "name": "古纳"}, {"id": 100822, "name": "古达"}, {"id": 100826, "name": "吧巴"}, {
            "id": 100819,
            "name": "哥打基纳巴鲁"
        }, {"id": 100820, "name": "哥打马鲁都"}, {"id": 100830, "name": "山打根"}, {"id": 100828, "name": "必达士"}, {
            "id": 100833,
            "name": "担布南"
        }, {"id": 100824, "name": "拿笃"}, {"id": 100836, "name": "斗亚兰"}, {"id": 100834, "name": "斗湖"}, {
            "id": 100816,
            "name": "根地咬"
        }, {"id": 100815, "name": "比鲁兰"}, {"id": 100821, "name": "瓜拉班尤"}, {"id": 100825, "name": "纳巴湾"}, {
            "id": 100832,
            "name": "西比陶"
        }]
    }, {
        "id": 10732,
        "name": "沙捞越",
        "cities": [{"id": 100844, "name": "三马拉汉"}, {"id": 100839, "name": "加帛"}, {
            "id": 100840,
            "name": "古晋"
        }, {"id": 100847, "name": "斯里阿曼"}, {"id": 100837, "name": "木中"}, {"id": 100843, "name": "木胶"}, {
            "id": 100841,
            "name": "林梦"
        }, {"id": 100838, "name": "民都鲁"}, {"id": 100846, "name": "泗务"}, {"id": 100845, "name": "泗里街"}, {
            "id": 100842,
            "name": "美里"
        }]
    }, {"id": 10729, "name": "玻璃市", "cities": [{"id": 100809, "name": "加央"}]}, {
        "id": 10724,
        "name": "纳闽",
        "cities": [{"id": 100778, "name": "纳闽"}, {"id": 100779, "name": "维多利亚"}]
    }, {
        "id": 10733,
        "name": "雪兰莪",
        "cities": [{"id": 100849, "name": "乌鲁冷岳"}, {"id": 100850, "name": "乌鲁雪兰莪"}, {
            "id": 100853,
            "name": "八打灵"
        }, {"id": 100854, "name": "沙白安南"}, {"id": 100851, "name": "瓜拉冷岳"}, {
            "id": 100852,
            "name": "瓜拉雪兰莪"
        }, {"id": 100855, "name": "雪邦"}, {"id": 100848, "name": "鹅麦"}]
    }, {
        "id": 10728,
        "name": "霹雳",
        "cities": [{"id": 100807, "name": "丹绒马"}, {"id": 100801, "name": "华都牙也"}, {
            "id": 100805,
            "name": "和丰"
        }, {"id": 100806, "name": "太平"}, {"id": 100808, "name": "安顺"}, {"id": 100802, "name": "怡保"}, {
            "id": 100803,
            "name": "江沙"
        }, {"id": 100804, "name": "紅土坎"}]
    }, {
        "id": 10725,
        "name": "马六甲",
        "cities": [{"id": 100780, "name": "亚罗牙也"}, {"id": 100781, "name": "野新"}, {"id": 100782, "name": "马六甲市"}]
    }]
}, {"id": 1052, "name": "马绍尔群岛", "provinces": []}, {"id": 1135, "name": "马达加斯加", "provinces": []}, {
    "id": 1128,
    "name": "黎巴嫩",
    "provinces": []
}];