/**
 * Created by lenovo on 2016/10/28.
 */
var data = [{"id": 1012, "name": "不丹", "provinces": []}, {
    "id": 1017,
    "name": "中国",
    "provinces": [{"id": 10185, "name": "上海"}, {"id": 10192, "name": "云南"}, {"id": 10175, "name": "内蒙古"}, {
        "id": 10161,
        "name": "北京"
    }, {"id": 10188, "name": "台湾"}, {"id": 10178, "name": "吉林"}, {"id": 10187, "name": "四川"}, {
        "id": 10189,
        "name": "天津"
    }, {"id": 10181, "name": "宁夏"}, {"id": 10160, "name": "安徽"}, {"id": 10184, "name": "山东"}, {
        "id": 10186,
        "name": "山西"
    }, {"id": 10165, "name": "广东"}, {"id": 10166, "name": "广西"}, {"id": 10191, "name": "新疆"}, {
        "id": 10176,
        "name": "江苏"
    }, {"id": 10177, "name": "江西"}, {"id": 10169, "name": "河北"}, {"id": 10171, "name": "河南"}, {
        "id": 10193,
        "name": "浙江"
    }, {"id": 10168, "name": "海南"}, {"id": 10173, "name": "湖北"}, {"id": 10174, "name": "湖南"}, {
        "id": 10180,
        "name": "澳门"
    }, {"id": 10164, "name": "甘肃"}, {"id": 10163, "name": "福建"}, {"id": 10190, "name": "西藏"}, {
        "id": 10167,
        "name": "贵州"
    }, {"id": 10179, "name": "辽宁"}, {"id": 10162, "name": "重庆"}, {"id": 10183, "name": "陕西"}, {
        "id": 10182,
        "name": "青海"
    }, {"id": 10172, "name": "香港"}, {"id": 10170, "name": "黑龙江"}]
}, {
    "id": 1080,
    "name": "中国台湾",
    "provinces": [{"id": 11118, "name": "云林县"}, {"id": 11109, "name": "南投县"}, {
        "id": 11115,
        "name": "台东县"
    }, {"id": 11112, "name": "台中市"}, {"id": 11114, "name": "台北市"}, {"id": 11113, "name": "台南市"}, {
        "id": 11102,
        "name": "嘉义县"
    }, {"id": 11101, "name": "嘉义市"}, {"id": 11107, "name": "基隆市"}, {"id": 11117, "name": "宜兰县"}, {
        "id": 11111,
        "name": "屏东县"
    }, {"id": 11100, "name": "彰化县"}, {"id": 11272, "name": "新北市"}, {"id": 11104, "name": "新竹县"}, {
        "id": 11103,
        "name": "新竹市"
    }, {"id": 11116, "name": "桃园县"}, {"id": 11110, "name": "澎湖县"}, {"id": 11105, "name": "花莲县"}, {
        "id": 11108,
        "name": "苗栗县"
    }, {"id": 11274, "name": "连江县"}, {"id": 11273, "name": "金门县"}, {"id": 11106, "name": "高雄市"}]
}, {
    "id": 1054,
    "name": "中国澳门",
    "provinces": [{"id": 10635, "name": "圣安多尼堂区"}, {"id": 10632, "name": "大堂区"}, {
        "id": 10637,
        "name": "望德堂区"
    }, {"id": 10638, "name": "氹仔"}, {"id": 10634, "name": "花地玛堂区"}, {"id": 10633, "name": "路环岛"}, {
        "id": 10636,
        "name": "风顺堂区"
    }]
}, {
    "id": 1031,
    "name": "中国香港",
    "provinces": [{"id": 10314, "name": "东区"}, {"id": 10313, "name": "中西区"}, {
        "id": 10316,
        "name": "九龙城区"
    }, {"id": 10330, "name": "元朗区"}, {"id": 10319, "name": "北区"}, {"id": 10323, "name": "南区"}, {
        "id": 10324,
        "name": "大埔区"
    }, {"id": 10326, "name": "屯门区"}, {"id": 10322, "name": "沙田区"}, {"id": 10329, "name": "油尖旺区"}, {
        "id": 10321,
        "name": "深水埗区"
    }, {"id": 10327, "name": "湾仔区"}, {"id": 10315, "name": "离岛区"}, {"id": 10325, "name": "荃湾区"}, {
        "id": 10317,
        "name": "葵青区"
    }, {"id": 10320, "name": "西贡区"}, {"id": 10318, "name": "观塘区"}, {"id": 10328, "name": "黄大仙区"}]
}, {"id": 1098, "name": "中非共和国", "provinces": []}, {"id": 1107, "name": "丹麦", "provinces": []}, {
    "id": 1081,
    "name": "乌克兰",
    "provinces": [{"id": 11124, "name": "伊万－弗兰科夫州"}, {"id": 11135, "name": "克里米亚自治共和国"}, {
        "id": 11119,
        "name": "切尔卡瑟"
    }, {"id": 11120, "name": "切尔尼戈夫"}, {"id": 11121, "name": "切尔诺夫策"}, {"id": 11131, "name": "利沃夫"}, {
        "id": 11130,
        "name": "卢甘斯克"
    }, {"id": 11125, "name": "哈尔科夫"}, {"id": 11128, "name": "基洛夫格勒"}, {"id": 11129, "name": "基辅"}, {
        "id": 11141,
        "name": "外喀尔巴阡"
    }, {"id": 11132, "name": "尼古拉耶夫"}, {"id": 11142, "name": "扎波罗热"}, {"id": 11138, "name": "捷尔诺波尔"}, {
        "id": 11133,
        "name": "敖德萨"
    }, {"id": 11139, "name": "文尼察"}, {"id": 11143, "name": "日托米尔"}, {"id": 11140, "name": "沃伦"}, {
        "id": 11134,
        "name": "波尔塔瓦"
    }, {"id": 11122, "name": "第聂伯罗波得罗夫斯克"}, {"id": 11136, "name": "罗夫诺"}, {"id": 11137, "name": "苏梅"}, {
        "id": 11126,
        "name": "赫尔松州"
    }, {"id": 11127, "name": "赫梅利尼茨基"}, {"id": 11123, "name": "顿涅茨克"}]
}, {"id": 1165, "name": "乌兹别克斯坦", "provinces": []}, {"id": 1163, "name": "乌干达", "provinces": []}, {
    "id": 1164,
    "name": "乌拉圭",
    "provinces": []
}, {"id": 1025, "name": "乔治亚", "provinces": []}, {"id": 1167, "name": "也门", "provinces": []}, {
    "id": 1089,
    "name": "亚美尼亚",
    "provinces": []
}, {"id": 1119, "name": "以色列", "provinces": []}, {"id": 1037, "name": "伊拉克", "provinces": []}, {
    "id": 1038,
    "name": "伊朗",
    "provinces": []
}, {
    "id": 1070,
    "name": "俄罗斯",
    "provinces": [{"id": 10867, "name": "下诺夫哥罗德"}, {"id": 10894, "name": "乌兰乌德"}, {
        "id": 10896,
        "name": "乌斯季奥尔登斯基"
    }, {"id": 10893, "name": "乌法"}, {"id": 10895, "name": "乌里扬诺夫斯克"}, {"id": 10839, "name": "伊万诺沃"}, {
        "id": 10838,
        "name": "伊尔库茨克"
    }, {"id": 10840, "name": "伊热夫斯克"}, {"id": 10901, "name": "伏尔加格勒"}, {"id": 10830, "name": "伯力"}, {
        "id": 10857,
        "name": "克孜勒"
    }, {"id": 10853, "name": "克拉斯诺亚尔斯克"}, {"id": 10852, "name": "克拉斯诺达尔"}, {"id": 10848, "name": "克麦罗沃"}, {
        "id": 10831,
        "name": "切博克萨雷"
    }, {"id": 10833, "name": "切尔克斯克"}, {"id": 10858, "name": "利佩茨克"}, {"id": 10826, "name": "别尔哥罗德"}, {
        "id": 10845,
        "name": "加里宁格勒"
    }, {"id": 10844, "name": "南萨哈林斯克"}, {"id": 10846, "name": "卡卢加"}, {"id": 10843, "name": "叶卡捷林堡"}, {
        "id": 10847,
        "name": "喀山"
    }, {"id": 10890, "name": "图拉"}, {"id": 10885, "name": "圣彼得堡"}, {"id": 10888, "name": "坦波夫"}, {
        "id": 10835,
        "name": "埃利斯塔"
    }, {"id": 10850, "name": "基洛夫"}, {"id": 10873, "name": "奔萨"}, {"id": 10871, "name": "奥伦堡"}, {
        "id": 10870,
        "name": "奥廖尔"
    }, {"id": 10825, "name": "巴尔瑙尔"}, {"id": 10828, "name": "布拉戈维申斯克"}, {"id": 10829, "name": "布良斯克"}, {
        "id": 10872,
        "name": "帕拉纳"
    }, {"id": 10855, "name": "库尔干"}, {"id": 10856, "name": "库尔斯克"}, {"id": 10854, "name": "库德姆卡尔"}, {
        "id": 10899,
        "name": "弗拉基米尔"
    }, {"id": 10898, "name": "弗拉季高加索"}, {"id": 10874, "name": "彼尔姆"}, {"id": 10875, "name": "彼得罗巴甫洛夫斯克"}, {
        "id": 10876,
        "name": "彼得罗扎沃茨克"
    }, {"id": 10836, "name": "戈尔诺－阿尔泰斯克"}, {"id": 10889, "name": "托木斯克"}, {"id": 10864, "name": "摩尔曼斯克"}, {
        "id": 10886,
        "name": "斯塔夫罗波尔"
    }, {"id": 10884, "name": "斯摩棱斯克"}, {"id": 10868, "name": "新西伯利亚"}, {"id": 10877, "name": "普斯科夫"}, {
        "id": 10837,
        "name": "格罗兹尼"
    }, {"id": 10879, "name": "梁赞"}, {"id": 10827, "name": "比罗比詹"}, {"id": 10849, "name": "汉特－曼西斯克"}, {
        "id": 10902,
        "name": "沃洛格达"
    }, {"id": 10903, "name": "沃罗涅什"}, {"id": 10900, "name": "海参崴"}, {"id": 10891, "name": "特维尔"}, {
        "id": 10887,
        "name": "瑟克特夫卡尔"
    }, {"id": 10892, "name": "秋明"}, {"id": 10851, "name": "科斯特罗马"}, {"id": 10904, "name": "约什卡尔奥拉"}, {
        "id": 10865,
        "name": "纳尔奇克"
    }, {"id": 10866, "name": "纳里扬马尔"}, {"id": 10863, "name": "莫斯科"}, {"id": 10882, "name": "萨兰斯克"}, {
        "id": 10880,
        "name": "萨列哈尔德"
    }, {"id": 10883, "name": "萨拉托夫"}, {"id": 10881, "name": "萨马拉"}, {"id": 10897, "name": "诺夫哥罗德"}, {
        "id": 10834,
        "name": "赤塔"
    }, {"id": 10832, "name": "车里雅宾斯克"}, {"id": 10862, "name": "迈科普"}, {"id": 10869, "name": "鄂木斯克"}, {
        "id": 10823,
        "name": "阿尔汉格尔斯克"
    }, {"id": 10820, "name": "阿巴坎"}, {"id": 10824, "name": "阿斯特拉罕"}, {"id": 10822, "name": "阿纳德尔"}, {
        "id": 10821,
        "name": "阿金斯科耶"
    }, {"id": 10841, "name": "雅库茨克"}, {"id": 10842, "name": "雅罗斯拉夫尔"}, {"id": 10878, "name": "顿河畔罗斯托夫"}, {
        "id": 10859,
        "name": "马加丹"
    }, {"id": 10860, "name": "马加斯"}, {"id": 10861, "name": "马哈奇卡拉"}]
}, {"id": 1093, "name": "保加利亚", "provinces": []}, {"id": 1118, "name": "克罗地亚", "provinces": []}, {
    "id": 1030,
    "name": "关岛",
    "provinces": []
}, {"id": 1029, "name": "冈比亚", "provinces": []}, {"id": 1039, "name": "冰岛", "provinces": []}, {
    "id": 1048,
    "name": "列支敦士登",
    "provinces": []
}, {"id": 1015, "name": "刚果民主共和国", "provinces": []}, {"id": 1049, "name": "利比亚", "provinces": []}, {
    "id": 1130,
    "name": "利比里亚",
    "provinces": []
}, {
    "id": 1014,
    "name": "加拿大",
    "provinces": [{"id": 10126, "name": "三河城"}, {"id": 10110, "name": "伊魁特"}, {"id": 10113, "name": "伦敦"}, {
        "id": 10102,
        "name": "卡里加里"
    }, {"id": 10108, "name": "哈利法克斯"}, {"id": 10109, "name": "哈密尔顿"}, {"id": 10122, "name": "圣卡塔琳娜"}, {
        "id": 10119,
        "name": "圣约翰斯"
    }, {"id": 10107, "name": "圭尔夫"}, {"id": 10105, "name": "埃德蒙顿"}, {"id": 10111, "name": "基劳纳"}, {
        "id": 10101,
        "name": "基奇纳"
    }, {"id": 10104, "name": "夏洛特敦"}, {"id": 10125, "name": "多伦多"}, {"id": 10115, "name": "奥沙瓦"}, {
        "id": 10100,
        "name": "巴里"
    }, {"id": 10103, "name": "布列塔尼角"}, {"id": 10106, "name": "弗雷德里顿"}, {"id": 10129, "name": "怀特霍斯"}, {
        "id": 10124,
        "name": "桑德贝"
    }, {"id": 10116, "name": "渥太华"}, {"id": 10127, "name": "温哥华"}, {"id": 10131, "name": "温尼伯"}, {
        "id": 10130,
        "name": "温莎"
    }, {"id": 10128, "name": "维多利亚"}, {"id": 10132, "name": "耶洛奈夫"}, {"id": 10121, "name": "舍布鲁克"}, {
        "id": 10123,
        "name": "萨德伯里"
    }, {"id": 10120, "name": "萨斯卡通"}, {"id": 10114, "name": "蒙特利尔"}, {"id": 10118, "name": "里贾纳"}, {
        "id": 10112,
        "name": "金斯敦"
    }, {"id": 10099, "name": "阿伯茨福"}, {"id": 10117, "name": "魁北克"}]
}, {"id": 1114, "name": "加纳", "provinces": []}, {
    "id": 1033,
    "name": "匈牙利",
    "provinces": [{"id": 10350, "name": "佐洛"}, {"id": 10344, "name": "佩斯"}, {
        "id": 10341,
        "name": "加兹-纳杰孔-索尔诺克"
    }, {"id": 10334, "name": "包尔绍德-奥包乌伊-曾普伦"}, {"id": 10332, "name": "巴兰尼亚"}, {
        "id": 10331,
        "name": "巴奇-基什孔"
    }, {"id": 10335, "name": "布达佩斯"}, {"id": 10347, "name": "托尔瑙"}, {"id": 10338, "name": "杰尔-莫松-肖普朗"}, {
        "id": 10348,
        "name": "沃什"
    }, {"id": 10336, "name": "琼格拉德"}, {"id": 10342, "name": "科马罗姆"}, {
        "id": 10346,
        "name": "索博尔奇-索特马尔-贝拉格"
    }, {"id": 10345, "name": "绍莫吉"}, {"id": 10349, "name": "维斯普雷姆"}, {"id": 10343, "name": "诺格拉德"}, {
        "id": 10339,
        "name": "豪伊杜-比豪尔"
    }, {"id": 10333, "name": "贝凯什"}, {"id": 10337, "name": "费耶尔"}, {"id": 10340, "name": "赫维什"}]
}, {"id": 1055, "name": "北马里亚纳群岛", "provinces": []}, {
    "id": 1086,
    "name": "南非",
    "provinces": [{"id": 11232, "name": "东伦敦"}, {"id": 11222, "name": "东巴克利"}, {
        "id": 11264,
        "name": "乌伦迪"
    }, {"id": 11265, "name": "乌姆塔塔"}, {"id": 11233, "name": "乔治"}, {"id": 11251, "name": "伊丽莎白港"}, {
        "id": 11271,
        "name": "伍斯特"
    }, {"id": 11239, "name": "克莱克斯多普"}, {"id": 11255, "name": "兰德方丹"}, {"id": 11246, "name": "内尔斯普雷特"}, {
        "id": 11257,
        "name": "利斯滕堡"
    }, {"id": 11262, "name": "图拉马哈谢"}, {"id": 11234, "name": "基雅尼"}, {"id": 11243, "name": "姆库泽"}, {
        "id": 11248,
        "name": "尼尔斯特隆"
    }, {"id": 11227, "name": "布隆克斯特斯普利特"}, {"id": 11225, "name": "布隆方丹"}, {"id": 11226, "name": "布雷达斯多普"}, {
        "id": 11240,
        "name": "库鲁曼"
    }, {"id": 11228, "name": "开普敦"}, {"id": 11267, "name": "弗里尼欣"}, {"id": 11268, "name": "弗雷堡"}, {
        "id": 11250,
        "name": "彼德斯堡"
    }, {"id": 11249, "name": "彼德马里茨堡"}, {"id": 11231, "name": "德班"}, {"id": 11229, "name": "德阿尔"}, {
        "id": 11261,
        "name": "托霍延杜"
    }, {"id": 11254, "name": "昆士敦"}, {"id": 11235, "name": "格罗布莱斯达尔"}, {"id": 11253, "name": "比勒陀利亚"}, {
        "id": 11224,
        "name": "比索"
    }, {"id": 11236, "name": "特克索波"}, {"id": 11263, "name": "特隆普斯堡"}, {"id": 11256, "name": "理查兹湾"}, {
        "id": 11259,
        "name": "瑟孔达"
    }, {"id": 11244, "name": "穆里斯堡"}, {"id": 11242, "name": "米德尔堡"}, {"id": 11237, "name": "约翰内斯堡"}, {
        "id": 11247,
        "name": "纽卡斯尔"
    }, {"id": 11245, "name": "艾利弗山"}, {"id": 11241, "name": "莱迪史密斯"}, {"id": 11258, "name": "萨索尔堡"}, {
        "id": 11223,
        "name": "西博福特"
    }, {"id": 11252, "name": "谢普斯通港"}, {"id": 11260, "name": "跳羚"}, {"id": 11230, "name": "邓迪"}, {
        "id": 11238,
        "name": "金伯利"
    }, {"id": 11266, "name": "阿平顿"}, {"id": 11269, "name": "韦尔科姆"}, {"id": 11270, "name": "韦茨肖克"}]
}, {"id": 1013, "name": "博茨瓦纳", "provinces": []}, {"id": 1150, "name": "卡塔尔", "provinces": []}, {
    "id": 1152,
    "name": "卢旺达",
    "provinces": []
}, {"id": 1132, "name": "卢森堡", "provinces": []}, {
    "id": 1036,
    "name": "印度",
    "provinces": [{"id": 10474, "name": "乌代布尔"}, {"id": 10422, "name": "克塔克"}, {
        "id": 10463,
        "name": "兰契"
    }, {"id": 10445, "name": "加尔各答"}, {"id": 10428, "name": "加济阿巴德"}, {"id": 10446, "name": "勒克瑙"}, {
        "id": 10415,
        "name": "博帕尔"
    }, {"id": 10447, "name": "卢迪亚纳"}, {"id": 10435, "name": "印多尔"}, {"id": 10430, "name": "古尔加翁"}, {
        "id": 10431,
        "name": "古瓦哈提"
    }, {"id": 10421, "name": "哥印拜陀"}, {"id": 10434, "name": "因帕尔"}, {"id": 10443, "name": "坎普尔"}, {
        "id": 10471,
        "name": "塔那"
    }, {"id": 10465, "name": "塞勒姆"}, {"id": 10466, "name": "塞康德拉巴德"}, {"id": 10412, "name": "奥兰加巴德"}, {
        "id": 10451,
        "name": "孟买"
    }, {"id": 10458, "name": "巴特那"}, {"id": 10414, "name": "巴罗达"}, {"id": 10416, "name": "布巴内斯瓦尔"}, {
        "id": 10423,
        "name": "德拉敦"
    }, {"id": 10444, "name": "戈尔"}, {"id": 10462, "name": "拉杰果德"}, {"id": 10437, "name": "斋普尔"}, {
        "id": 10469,
        "name": "斯利那加"
    }, {"id": 10455, "name": "新德里"}, {"id": 10418, "name": "昌迪加尔"}, {"id": 10459, "name": "本地治里"}, {
        "id": 10425,
        "name": "杜加浦"
    }, {"id": 10429, "name": "果阿"}, {"id": 10438, "name": "查谟"}, {"id": 10426, "name": "法里达巴德"}, {
        "id": 10417,
        "name": "波卡罗"
    }, {"id": 10460, "name": "浦那"}, {"id": 10433, "name": "海德拉巴"}, {"id": 10457, "name": "潘吉姆"}, {
        "id": 10441,
        "name": "焦特布尔"
    }, {"id": 10472, "name": "特里凡得琅"}, {"id": 10413, "name": "班加罗尔"}, {"id": 10432, "name": "瓜廖尔"}, {
        "id": 10475,
        "name": "瓦拉纳西"
    }, {"id": 10427, "name": "甘地讷格尔"}, {"id": 10420, "name": "科钦"}, {"id": 10478, "name": "維沙哈巴南"}, {
        "id": 10477,
        "name": "维杰亚瓦达"
    }, {"id": 10407, "name": "艾哈迈达巴德"}, {"id": 10408, "name": "艾藻尔"}, {"id": 10449, "name": "芒格洛尔"}, {
        "id": 10470,
        "name": "苏拉"
    }, {"id": 10473, "name": "蒂鲁吉拉伯利"}, {"id": 10468, "name": "西里古里"}, {"id": 10467, "name": "西隆"}, {
        "id": 10440,
        "name": "詹谢普尔"
    }, {"id": 10456, "name": "诺伊达"}, {"id": 10439, "name": "贾姆纳格尔"}, {"id": 10436, "name": "贾巴尔普尔"}, {
        "id": 10442,
        "name": "贾朗达尔"
    }, {"id": 10461, "name": "赖布尔"}, {"id": 10452, "name": "迈索尔"}, {"id": 10424, "name": "迪马普尔"}, {
        "id": 10453,
        "name": "那格浦尔"
    }, {"id": 10454, "name": "邦纳西克"}, {"id": 10419, "name": "金奈"}, {"id": 10405, "name": "阿加尔塔拉"}, {
        "id": 10411,
        "name": "阿姆利则"
    }, {"id": 10410, "name": "阿拉哈巴德"}, {"id": 10406, "name": "阿格拉"}, {"id": 10409, "name": "阿里格尔"}, {
        "id": 10476,
        "name": "韦洛尔"
    }, {"id": 10450, "name": "马尔高"}, {"id": 10448, "name": "马杜赖"}, {"id": 10464, "name": "鲁尔克拉"}]
}, {
    "id": 1034,
    "name": "印度尼西亚",
    "provinces": [{"id": 10353, "name": "万丹"}, {"id": 10365, "name": "东加里曼丹"}, {
        "id": 10370,
        "name": "东努沙登加拉"
    }, {"id": 10374, "name": "东南苏拉威西"}, {"id": 10362, "name": "东爪哇"}, {"id": 10364, "name": "中加里曼丹"}, {
        "id": 10361,
        "name": "中爪哇"
    }, {"id": 10373, "name": "中苏拉威西"}, {"id": 10351, "name": "亚齐"}, {"id": 10357, "name": "伊里安查亚"}, {
        "id": 10375,
        "name": "北苏拉威西"
    }, {"id": 10378, "name": "北苏门答腊"}, {"id": 10363, "name": "南加里曼丹"}, {"id": 10372, "name": "南苏拉威西"}, {
        "id": 10377,
        "name": "南苏门答腊"
    }, {"id": 10359, "name": "占碑"}, {"id": 10356, "name": "大雅加达首都特区"}, {"id": 10352, "name": "巴厘"}, {
        "id": 10371,
        "name": "廖内"
    }, {"id": 10355, "name": "日惹特区"}, {"id": 10354, "name": "明古鲁"}, {"id": 10367, "name": "楠榜"}, {
        "id": 10369,
        "name": "西努沙登加拉"
    }, {"id": 10360, "name": "西爪哇"}, {"id": 10376, "name": "西苏门答腊"}, {"id": 10366, "name": "邦加－勿里洞群岛"}, {
        "id": 10358,
        "name": "雅加达"
    }, {"id": 10368, "name": "马鲁古"}]
}, {"id": 1116, "name": "危地马拉", "provinces": []}, {"id": 1109, "name": "厄瓜多尔", "provinces": []}, {
    "id": 1111,
    "name": "厄立特里亚",
    "provinces": []
}, {"id": 1104, "name": "古巴", "provinces": []}, {"id": 1123, "name": "吉尔吉斯斯坦", "provinces": []}, {
    "id": 1106,
    "name": "吉布提",
    "provinces": []
}, {"id": 1126, "name": "哈萨克斯坦", "provinces": []}, {"id": 1101, "name": "哥伦比亚", "provinces": []}, {
    "id": 1102,
    "name": "哥斯达黎加",
    "provinces": []
}, {"id": 1100, "name": "喀麦隆", "provinces": []}, {
    "id": 1078,
    "name": "土耳其",
    "provinces": [{"id": 11096, "name": "乌萨克"}, {"id": 11045, "name": "乔鲁姆"}, {
        "id": 11046,
        "name": "代尼兹利"
    }, {"id": 11062, "name": "伊兹密尔"}, {"id": 11058, "name": "伊切尔"}, {"id": 11061, "name": "伊斯坦布尔"}, {
        "id": 11060,
        "name": "伊斯帕尔塔"
    }, {"id": 11059, "name": "伊迪尔"}, {"id": 11070, "name": "克勒克卡莱"}, {"id": 11072, "name": "克尔谢希尔"}, {
        "id": 11081,
        "name": "内夫谢希尔"
    }, {"id": 11097, "name": "凡"}, {"id": 11053, "name": "加济安泰普"}, {"id": 11040, "name": "博卢"}, {
        "id": 11066,
        "name": "卡尔斯"
    }, {"id": 11065, "name": "卡拉曼"}, {"id": 11064, "name": "卡拉比克"}, {"id": 11067, "name": "卡斯塔莫努"}, {
        "id": 11063,
        "name": "卡赫拉曼马拉什"
    }, {"id": 11054, "name": "吉雷松"}, {"id": 11056, "name": "哈卡里"}, {"id": 11057, "name": "哈塔伊"}, {
        "id": 11050,
        "name": "埃尔津詹"
    }, {"id": 11051, "name": "埃尔祖鲁姆"}, {"id": 11049, "name": "埃拉泽"}, {"id": 11052, "name": "埃斯基谢希尔"}, {
        "id": 11048,
        "name": "埃迪尔内"
    }, {"id": 11069, "name": "基利斯"}, {"id": 11083, "name": "奥尔杜"}, {"id": 11028, "name": "安卡拉"}, {
        "id": 11029,
        "name": "安塔利亚"
    }, {"id": 11099, "name": "宗古尔达克"}, {"id": 11038, "name": "宾格尔"}, {"id": 11082, "name": "尼代"}, {
        "id": 11055,
        "name": "居米什哈内"
    }, {"id": 11075, "name": "屈塔希亚"}, {"id": 11036, "name": "巴伊布尔特"}, {"id": 11033, "name": "巴勒克埃西尔"}, {
        "id": 11034,
        "name": "巴尔腾"
    }, {"id": 11035, "name": "巴特曼"}, {"id": 11041, "name": "布尔杜尔"}, {"id": 11042, "name": "布尔萨"}, {
        "id": 11068,
        "name": "开塞利"
    }, {"id": 11043, "name": "恰纳卡莱"}, {"id": 11092, "name": "托卡特"}, {"id": 11095, "name": "拉飞"}, {
        "id": 11044,
        "name": "昌克勒"
    }, {"id": 11071, "name": "柯克拉雷利"}, {"id": 11039, "name": "比特利斯"}, {"id": 11037, "name": "比莱吉克"}, {
        "id": 11091,
        "name": "泰基尔达"
    }, {"id": 11093, "name": "特拉布宗"}, {"id": 11074, "name": "科尼亚"}, {"id": 11073, "name": "科贾埃利"}, {
        "id": 11080,
        "name": "穆什"
    }, {"id": 11079, "name": "穆拉"}, {"id": 11098, "name": "约兹加特"}, {"id": 11032, "name": "艾登"}, {
        "id": 11085,
        "name": "萨卡里亚"
    }, {"id": 11086, "name": "萨姆松"}, {"id": 11047, "name": "迪亚巴克尔"}, {"id": 11094, "name": "通杰利"}, {
        "id": 11084,
        "name": "里泽"
    }, {"id": 11087, "name": "锡尔特"}, {"id": 11089, "name": "锡尔纳克"}, {"id": 11090, "name": "锡瓦斯"}, {
        "id": 11088,
        "name": "锡诺普"
    }, {"id": 11026, "name": "阿克萨赖"}, {"id": 11025, "name": "阿勒"}, {"id": 11031, "name": "阿尔特温"}, {
        "id": 11030,
        "name": "阿尔达罕"
    }, {"id": 11023, "name": "阿德亚曼"}, {"id": 11024, "name": "阿菲永"}, {"id": 11022, "name": "阿达纳"}, {
        "id": 11027,
        "name": "阿马西亚"
    }, {"id": 11078, "name": "马尔丁"}, {"id": 11077, "name": "马尼萨"}, {"id": 11076, "name": "马拉蒂亚"}]
}, {"id": 1044, "name": "圣基茨和尼维斯", "provinces": []}, {"id": 1075, "name": "圣马力诺", "provinces": []}, {
    "id": 1162,
    "name": "坦桑尼亚",
    "provinces": []
}, {"id": 1110, "name": "埃及", "provinces": []}, {"id": 1112, "name": "埃塞俄比亚", "provinces": []}, {
    "id": 1124,
    "name": "基里巴斯",
    "provinces": []
}, {"id": 1160, "name": "塔吉克斯坦", "provinces": []}, {"id": 1158, "name": "塞内加尔", "provinces": []}, {
    "id": 1103,
    "name": "塞尔维亚,黑山",
    "provinces": []
}, {"id": 1157, "name": "塞拉利昂", "provinces": []}, {"id": 1072, "name": "塞舌尔", "provinces": []}, {
    "id": 1058,
    "name": "墨西哥",
    "provinces": [{"id": 10714, "name": "乌鲁阿潘"}, {"id": 10678, "name": "伊拉普阿托"}, {
        "id": 10701,
        "name": "克雷塔罗"
    }, {"id": 10666, "name": "切图马尔"}, {"id": 10680, "name": "华雷斯"}, {"id": 10664, "name": "卡门"}, {
        "id": 10679,
        "name": "哈拉帕"
    }, {"id": 10713, "name": "图斯特拉-古铁雷斯"}, {"id": 10704, "name": "圣路易斯波托亚"}, {"id": 10705, "name": "坦皮科"}, {
        "id": 10663,
        "name": "埃佩切"
    }, {"id": 10677, "name": "埃莫西约"}, {"id": 10706, "name": "塔帕丘拉"}, {"id": 10665, "name": "塞拉亚"}, {
        "id": 10687,
        "name": "墨西卡利"
    }, {"id": 10688, "name": "墨西哥城"}, {"id": 10669, "name": "夸察夸拉克斯"}, {"id": 10668, "name": "奇尔潘辛戈"}, {
        "id": 10667,
        "name": "奇瓦瓦"
    }, {"id": 10695, "name": "奥夫雷贡城"}, {"id": 10696, "name": "奥里萨巴"}, {"id": 10700, "name": "巴亚尔塔港"}, {
        "id": 10715,
        "name": "巴利城"
    }, {"id": 10697, "name": "帕丘卡"}, {"id": 10672, "name": "库利阿坎"}, {"id": 10671, "name": "库埃纳瓦卡"}, {
        "id": 10674,
        "name": "恩塞纳达"
    }, {"id": 10711, "name": "托卢卡"}, {"id": 10712, "name": "托雷翁"}, {"id": 10681, "name": "拉巴斯"}, {
        "id": 10693,
        "name": "新拉雷多"
    }, {"id": 10699, "name": "普埃布拉"}, {"id": 10673, "name": "杜兰戈"}, {"id": 10686, "name": "梅里达"}, {
        "id": 10718,
        "name": "比利亚埃尔莫萨"
    }, {"id": 10698, "name": "波萨里卡"}, {"id": 10683, "name": "洛斯莫奇斯"}, {"id": 10710, "name": "特拉斯卡拉"}, {
        "id": 10707,
        "name": "特瓦坎"
    }, {"id": 10708, "name": "特皮克"}, {"id": 10676, "name": "瓜纳华托"}, {"id": 10675, "name": "瓜达拉哈拉"}, {
        "id": 10694,
        "name": "瓦哈卡"
    }, {"id": 10670, "name": "科利马"}, {"id": 10717, "name": "维多利亚城"}, {"id": 10691, "name": "莫雷利亚"}, {
        "id": 10682,
        "name": "莱昂"
    }, {"id": 10719, "name": "萨卡特卡斯"}, {"id": 10703, "name": "萨尔蒂约"}, {"id": 10709, "name": "蒂华纳"}, {
        "id": 10689,
        "name": "蒙克洛瓦"
    }, {"id": 10690, "name": "蒙特雷"}, {"id": 10692, "name": "诺加莱斯"}, {"id": 10662, "name": "贝尼托·胡亚雷斯"}, {
        "id": 10660,
        "name": "阿卡普尔科"
    }, {"id": 10661, "name": "阿瓜斯卡连斯特"}, {"id": 10702, "name": "雷诺萨"}, {"id": 10716, "name": "韦拉克鲁斯"}, {
        "id": 10684,
        "name": "马塔莫罗斯"
    }, {"id": 10685, "name": "马萨特兰"}]
}, {"id": 1019, "name": "多米尼加共和国", "provinces": []}, {
    "id": 1004,
    "name": "奥地利",
    "provinces": [{"id": 10062, "name": "上奥地利"}, {"id": 10058, "name": "下奥地利"}, {
        "id": 10057,
        "name": "克恩顿"
    }, {"id": 10056, "name": "布尔根兰"}, {"id": 10060, "name": "施蒂利亚"}, {"id": 10064, "name": "福拉尔贝格"}, {
        "id": 10063,
        "name": "维也纳"
    }, {"id": 10059, "name": "萨尔茨堡"}, {"id": 10061, "name": "蒂罗尔"}]
}, {
    "id": 1083,
    "name": "委内瑞拉",
    "provinces": [{"id": 11217, "name": "亚拉奎"}, {"id": 11195, "name": "亚马孙"}, {
        "id": 11202,
        "name": "加拉加斯"
    }, {"id": 11201, "name": "卡拉沃沃"}, {"id": 11215, "name": "塔奇拉"}, {"id": 11196, "name": "安索阿特吉"}, {
        "id": 11199,
        "name": "巴里纳斯"
    }, {"id": 11209, "name": "拉腊"}, {"id": 11206, "name": "新埃斯帕塔"}, {"id": 11210, "name": "梅里达"}, {
        "id": 11207,
        "name": "法尔孔"
    }, {"id": 11213, "name": "波图格萨"}, {"id": 11216, "name": "特鲁希略"}, {"id": 11200, "name": "玻利瓦尔"}, {
        "id": 11208,
        "name": "瓜里科"
    }, {"id": 11203, "name": "科赫德斯"}, {"id": 11211, "name": "米兰达"}, {"id": 11205, "name": "联邦属地"}, {
        "id": 11214,
        "name": "苏克雷"
    }, {"id": 11218, "name": "苏利亚"}, {"id": 11212, "name": "莫纳加斯"}, {"id": 11198, "name": "阿拉瓜"}, {
        "id": 11197,
        "name": "阿普雷"
    }, {"id": 11204, "name": "阿马库罗三角洲"}]
}, {"id": 1091, "name": "孟加拉", "provinces": []}, {
    "id": 1002,
    "name": "安哥拉",
    "provinces": [{"id": 10012, "name": "万博"}, {"id": 10009, "name": "北宽扎"}, {"id": 10015, "name": "北隆达"}, {
        "id": 10010,
        "name": "南宽扎"
    }, {"id": 10016, "name": "南隆达"}, {"id": 10007, "name": "卡宾达"}, {"id": 10013, "name": "威拉"}, {
        "id": 10020,
        "name": "威热"
    }, {"id": 10008, "name": "宽多库邦戈"}, {"id": 10011, "name": "库内内"}, {"id": 10021, "name": "扎伊尔"}, {
        "id": 10004,
        "name": "本戈"
    }, {"id": 10005, "name": "本格拉"}, {"id": 10006, "name": "比耶"}, {"id": 10019, "name": "纳米贝"}, {
        "id": 10014,
        "name": "罗安达"
    }, {"id": 10018, "name": "莫希科"}, {"id": 10017, "name": "马兰热"}]
}, {"id": 1001, "name": "安提瓜岛和巴布达", "provinces": []}, {"id": 1087, "name": "安道尔", "provinces": []}, {
    "id": 1142,
    "name": "尼加拉瓜",
    "provinces": []
}, {"id": 1141, "name": "尼日利亚", "provinces": []}, {"id": 1144, "name": "尼泊尔", "provinces": []}, {
    "id": 1011,
    "name": "巴哈马",
    "provinces": []
}, {"id": 1148, "name": "巴基斯坦", "provinces": []}, {"id": 1007, "name": "巴巴多斯岛", "provinces": []}, {
    "id": 1147,
    "name": "巴布亚新几内亚",
    "provinces": []
}, {"id": 1064, "name": "巴拿马", "provinces": []}, {"id": 1094, "name": "巴林", "provinces": []}, {
    "id": 1010,
    "name": "巴西",
    "provinces": [{"id": 10075, "name": "亚马孙"}, {"id": 10088, "name": "伯南布哥"}, {
        "id": 10091,
        "name": "北里奥格兰德"
    }, {"id": 10092, "name": "南里奥格兰德"}, {"id": 10083, "name": "南马托格罗索"}, {"id": 10096, "name": "圣保罗"}, {
        "id": 10095,
        "name": "圣卡塔琳娜"
    }, {"id": 10079, "name": "圣埃斯皮里图"}, {"id": 10097, "name": "塞尔希培"}, {"id": 10078, "name": "塞阿拉"}, {
        "id": 10076,
        "name": "巴伊亚"
    }, {"id": 10087, "name": "巴拉那"}, {"id": 10077, "name": "巴西利亚"}, {"id": 10085, "name": "帕拉"}, {
        "id": 10086,
        "name": "帕拉伊巴"
    }, {"id": 10080, "name": "戈亚斯"}, {"id": 10098, "name": "托坎廷斯"}, {"id": 10093, "name": "朗多尼亚"}, {
        "id": 10089,
        "name": "皮奥伊"
    }, {"id": 10084, "name": "米纳斯吉拉斯"}, {"id": 10094, "name": "罗赖马"}, {"id": 10090, "name": "里约热内卢"}, {
        "id": 10072,
        "name": "阿克里"
    }, {"id": 10073, "name": "阿拉戈斯"}, {"id": 10074, "name": "阿马帕"}, {"id": 10082, "name": "马托格罗索"}, {
        "id": 10081,
        "name": "马拉尼昂"
    }]
}, {"id": 1095, "name": "布隆迪", "provinces": []}, {"id": 1115, "name": "希腊", "provinces": []}, {
    "id": 1068,
    "name": "帕劳群岛",
    "provinces": []
}, {"id": 1047, "name": "开曼群岛", "provinces": []}, {
    "id": 1018,
    "name": "德国",
    "provinces": [{"id": 10202, "name": "不伦瑞克"}, {"id": 10201, "name": "不来梅"}, {
        "id": 10231,
        "name": "什未林"
    }, {"id": 10207, "name": "代特莫尔特"}, {"id": 10221, "name": "兰茨胡特"}, {"id": 10218, "name": "卡塞尔"}, {
        "id": 10217,
        "name": "卡尔斯鲁厄"
    }, {"id": 10213, "name": "吉森"}, {"id": 10223, "name": "吕讷堡"}, {"id": 10214, "name": "哈雷"}, {
        "id": 10219,
        "name": "基尔"
    }, {"id": 10196, "name": "奥格斯堡"}, {"id": 10234, "name": "威斯巴登"}, {"id": 10194, "name": "安斯巴格"}, {
        "id": 10203,
        "name": "开姆尼斯"
    }, {"id": 10212, "name": "弗赖堡"}, {"id": 10208, "name": "德累斯顿"}, {"id": 10206, "name": "德绍"}, {
        "id": 10228,
        "name": "慕尼黑"
    }, {"id": 10197, "name": "拜伊罗特"}, {"id": 10232, "name": "斯图加特"}, {"id": 10227, "name": "明斯特"}, {
        "id": 10226,
        "name": "曼海姆"
    }, {"id": 10209, "name": "杜塞尔多夫"}, {"id": 10198, "name": "柏林"}, {"id": 10199, "name": "比勒费尔德"}, {
        "id": 10215,
        "name": "汉堡"
    }, {"id": 10216, "name": "汉诺威"}, {"id": 10211, "name": "法兰克福"}, {"id": 10230, "name": "波茨坦"}, {
        "id": 10200,
        "name": "波鸿"
    }, {"id": 10210, "name": "爱尔福特"}, {"id": 10233, "name": "特里尔"}, {"id": 10220, "name": "科布伦次"}, {
        "id": 10204,
        "name": "科隆"
    }, {"id": 10229, "name": "纽伦堡"}, {"id": 10235, "name": "维尔茨堡"}, {"id": 10225, "name": "美因兹"}, {
        "id": 10222,
        "name": "莱比锡"
    }, {"id": 10205, "name": "达姆施塔特"}, {"id": 10195, "name": "阿恩斯贝格"}, {"id": 10224, "name": "马格德堡"}]
}, {
    "id": 1040,
    "name": "意大利",
    "provinces": [{"id": 10541, "name": "乌迪内"}, {"id": 10479, "name": "亚历山德里亚"}, {
        "id": 10504,
        "name": "伊塞尔尼亚"
    }, {"id": 11314, "name": "伦蒂亚"}, {"id": 10501, "name": "佛罗伦萨"}, {"id": 11298, "name": "佩斯卡拉"}, {
        "id": 11297,
        "name": "佩萨罗"
    }, {"id": 10524, "name": "佩鲁贾"}, {"id": 10498, "name": "克罗托内"}, {"id": 11304, "name": "列蒂"}, {
        "id": 10518,
        "name": "努奥罗"
    }, {"id": 11281, "name": "博尔扎诺"}, {"id": 10488, "name": "博洛尼亚"}, {"id": 10491, "name": "卡利亚里"}, {
        "id": 11282,
        "name": "卡博尼亚 - 伊格莱西亚斯"
    }, {"id": 10495, "name": "卡坦扎罗"}, {"id": 10494, "name": "卡塔尼亚"}, {"id": 10493, "name": "卡塞塔"}, {
        "id": 11293,
        "name": "卢卡"
    }, {"id": 11290, "name": "因佩里亚"}, {"id": 10492, "name": "坎波巴索"}, {"id": 11283, "name": "基耶蒂"}, {
        "id": 10536,
        "name": "塔兰托"
    }, {"id": 10512, "name": "墨西拿"}, {"id": 10519, "name": "奥尔比亚"}, {"id": 10481, "name": "奥斯塔"}, {
        "id": 10520,
        "name": "奥里斯塔诺"
    }, {"id": 10542, "name": "威尼斯"}, {"id": 10480, "name": "安科纳"}, {
        "id": 11279,
        "name": "巴列塔 - 安德里亚 - 特拉尼"
    }, {"id": 10521, "name": "巴勒莫"}, {"id": 10484, "name": "巴里"}, {"id": 10487, "name": "布拉"}, {
        "id": 10490,
        "name": "布林迪西"
    }, {"id": 10489, "name": "布雷西亚"}, {"id": 11296, "name": "帕多瓦"}, {"id": 10522, "name": "帕尔马"}, {
        "id": 10523,
        "name": "帕维亚"
    }, {"id": 10499, "name": "库内奥"}, {"id": 11286, "name": "弗利 - 切塞纳"}, {"id": 11284, "name": "恩纳"}, {
        "id": 11288,
        "name": "戈里齐亚"
    }, {"id": 11291, "name": "拉丁"}, {"id": 11302, "name": "拉古萨"}, {"id": 10505, "name": "拉奎拉"}, {
        "id": 11303,
        "name": "拉文纳"
    }, {"id": 10506, "name": "拉斯佩齐亚"}, {"id": 10514, "name": "摩德纳"}, {"id": 11301, "name": "普拉托"}, {
        "id": 11295,
        "name": "曼图亚"
    }, {"id": 11307, "name": "松德里奥"}, {"id": 11289, "name": "格罗塞托"}, {"id": 10525, "name": "比萨"}, {
        "id": 10526,
        "name": "波代诺内"
    }, {"id": 10527, "name": "波坦察"}, {"id": 11308, "name": "泰拉莫"}, {"id": 11292, "name": "洛迪"}, {
        "id": 10503,
        "name": "热那亚"
    }, {"id": 10538, "name": "特伦托"}, {"id": 11309, "name": "特尔尼"}, {"id": 10537, "name": "特拉帕尼"}, {
        "id": 11310,
        "name": "特雷维索"
    }, {"id": 11311, "name": "瓦雷泽"}, {"id": 10539, "name": "的里雅斯特"}, {"id": 11299, "name": "皮亚琴察"}, {
        "id": 11300,
        "name": "皮斯托亚"
    }, {"id": 10502, "name": "福贾"}, {"id": 10496, "name": "科摩"}, {"id": 10497, "name": "科森扎"}, {
        "id": 10513,
        "name": "米兰"
    }, {"id": 10544, "name": "维泰博"}, {"id": 11315, "name": "维琴察"}, {"id": 11313, "name": "维罗纳"}, {
        "id": 11306,
        "name": "罗维戈"
    }, {"id": 10530, "name": "罗马"}, {"id": 10507, "name": "莱切"}, {"id": 10508, "name": "莱科"}, {
        "id": 10533,
        "name": "萨沃纳"
    }, {"id": 10531, "name": "萨莱诺"}, {"id": 10532, "name": "萨萨里"}, {"id": 10515, "name": "蒙扎"}, {
        "id": 10517,
        "name": "诺瓦拉"
    }, {"id": 10485, "name": "贝内文托"}, {"id": 10486, "name": "贝加莫"}, {"id": 11280, "name": "贝卢诺"}, {
        "id": 11285,
        "name": "费尔莫"
    }, {"id": 10500, "name": "费拉拉"}, {"id": 11287, "name": "费辛隆尼"}, {"id": 10516, "name": "那不勒斯"}, {
        "id": 10540,
        "name": "都灵"
    }, {"id": 10509, "name": "里窝那"}, {"id": 11305, "name": "里米尼"}, {"id": 10535, "name": "锡拉库扎"}, {
        "id": 10534,
        "name": "锡耶纳"
    }, {"id": 10482, "name": "阿斯科利皮切诺"}, {"id": 10483, "name": "阿斯蒂"}, {"id": 11277, "name": "阿格里真托"}, {
        "id": 11278,
        "name": "阿雷佐"
    }, {"id": 10528, "name": "雷焦卡拉布里亚"}, {"id": 10529, "name": "雷焦艾米利亚"}, {"id": 10543, "name": "韦尔切利"}, {
        "id": 11312,
        "name": "韦巴诺 - 库西奥 - 奥索拉"
    }, {"id": 11294, "name": "马切拉塔"}, {"id": 10511, "name": "马泰拉"}, {"id": 10510, "name": "马萨"}]
}, {"id": 1153, "name": "所罗门群岛", "provinces": []}, {"id": 1133, "name": "拉脱维亚", "provinces": []}, {
    "id": 1143,
    "name": "挪威",
    "provinces": []
}, {"id": 1105, "name": "捷克共和国", "provinces": []}, {"id": 1051, "name": "摩尔多瓦", "provinces": []}, {
    "id": 1134,
    "name": "摩洛哥",
    "provinces": []
}, {"id": 1050, "name": "摩纳哥", "provinces": []}, {"id": 1009, "name": "文莱", "provinces": []}, {
    "id": 1021,
    "name": "斐济",
    "provinces": []
}, {"id": 1076, "name": "斯威士兰", "provinces": []}, {"id": 1156, "name": "斯洛伐克", "provinces": []}, {
    "id": 1155,
    "name": "斯洛文尼亚",
    "provinces": []
}, {"id": 1129, "name": "斯里兰卡", "provinces": []}, {"id": 1074, "name": "新加坡", "provinces": []}, {
    "id": 1061,
    "name": "新喀里多尼亚",
    "provinces": []
}, {
    "id": 1063,
    "name": "新西兰",
    "provinces": [{"id": 10765, "name": "克赖斯特彻奇"}, {"id": 10775, "name": "内皮尔"}, {
        "id": 10773,
        "name": "凯帕拉"
    }, {"id": 10778, "name": "北岸"}, {"id": 10779, "name": "北帕默斯顿"}, {"id": 10767, "name": "北远"}, {
        "id": 10768,
        "name": "吉斯伯恩"
    }, {"id": 10770, "name": "哈密尔顿"}, {"id": 10772, "name": "因弗卡吉尔"}, {"id": 10763, "name": "奥克兰"}, {
        "id": 10764,
        "name": "布莱尼姆"
    }, {"id": 10783, "name": "怀塔科拉"}, {"id": 10781, "name": "斯特拉特福德"}, {"id": 10777, "name": "新普利茅斯"}, {
        "id": 10784,
        "name": "旺格努伊"
    }, {"id": 10786, "name": "旺阿雷"}, {"id": 10769, "name": "格雷茅斯"}, {"id": 10785, "name": "瓦卡塔尼"}, {
        "id": 10776,
        "name": "纳尔逊"
    }, {"id": 10766, "name": "达尼丁"}, {"id": 10780, "name": "里士满"}, {"id": 10782, "name": "陶马鲁努伊"}, {
        "id": 10774,
        "name": "马努考"
    }, {"id": 10771, "name": "黑斯廷斯"}]
}, {
    "id": 1042,
    "name": "日本",
    "provinces": [{"id": 10567, "name": "三重"}, {"id": 10585, "name": "东京"}, {"id": 10566, "name": "京都"}, {
        "id": 10578,
        "name": "佐贺"
    }, {"id": 10557, "name": "兵库"}, {"id": 10575, "name": "冈山"}, {"id": 10576, "name": "冲绳"}, {
        "id": 10556,
        "name": "北海道"
    }, {"id": 10548, "name": "千叶"}, {"id": 10588, "name": "和歌山"}, {"id": 10579, "name": "埼玉"}, {
        "id": 10574,
        "name": "大分"
    }, {"id": 10577, "name": "大阪"}, {"id": 10572, "name": "奈良"}, {"id": 10569, "name": "宫崎"}, {
        "id": 10568,
        "name": "宮城"
    }, {"id": 10587, "name": "富山"}, {"id": 10590, "name": "山口"}, {"id": 10589, "name": "山形"}, {
        "id": 10591,
        "name": "山梨"
    }, {"id": 10553, "name": "岐阜"}, {"id": 10581, "name": "岛根"}, {"id": 10560, "name": "岩手"}, {
        "id": 10555,
        "name": "广岛"
    }, {"id": 10584, "name": "徳岛"}, {"id": 10573, "name": "新潟"}, {"id": 10583, "name": "枥木"}, {
        "id": 10580,
        "name": "滋贺"
    }, {"id": 10565, "name": "熊本"}, {"id": 10549, "name": "爱媛"}, {"id": 10545, "name": "爱知"}, {
        "id": 10559,
        "name": "石川"
    }, {"id": 10563, "name": "神奈川"}, {"id": 10550, "name": "福井"}, {"id": 10551, "name": "福冈"}, {
        "id": 10552,
        "name": "福岛"
    }, {"id": 10546, "name": "秋田"}, {"id": 10554, "name": "群马"}, {"id": 10558, "name": "茨城"}, {
        "id": 10571,
        "name": "长崎"
    }, {"id": 10570, "name": "长野"}, {"id": 10547, "name": "青森"}, {"id": 10582, "name": "静冈"}, {
        "id": 10561,
        "name": "香川"
    }, {"id": 10564, "name": "高知"}, {"id": 10586, "name": "鸟取"}, {"id": 10562, "name": "鹿儿岛"}]
}, {"id": 1099, "name": "智利", "provinces": []}, {"id": 1125, "name": "朝鲜", "provinces": []}, {
    "id": 1043,
    "name": "柬埔寨",
    "provinces": [{"id": 10613, "name": "上丁"}, {"id": 10606, "name": "奥多棉吉"}, {"id": 10599, "name": "干丹"}, {
        "id": 10600,
        "name": "戈公"
    }, {"id": 10603, "name": "拜林市"}, {"id": 10612, "name": "暹粒"}, {"id": 10609, "name": "柏威夏"}, {
        "id": 10614,
        "name": "柴桢"
    }, {"id": 10601, "name": "桔井"}, {"id": 10610, "name": "波罗勉"}, {"id": 10592, "name": "班迭棉吉"}, {
        "id": 10602,
        "name": "白马市"
    }, {"id": 10597, "name": "磅同"}, {"id": 10596, "name": "磅士卑"}, {"id": 10595, "name": "磅清扬"}, {
        "id": 10594,
        "name": "磅湛"
    }, {"id": 10611, "name": "腊塔纳基里"}, {"id": 10615, "name": "茶胶"}, {"id": 10608, "name": "菩萨"}, {
        "id": 10605,
        "name": "蒙多基里"
    }, {"id": 10604, "name": "西哈努克市"}, {"id": 10598, "name": "贡布"}, {"id": 10607, "name": "金边市"}, {
        "id": 10593,
        "name": "马德望"
    }]
}, {"id": 1026, "name": "格恩西岛", "provinces": []}, {"id": 1024, "name": "格林纳达", "provinces": []}, {
    "id": 1028,
    "name": "格陵兰",
    "provinces": []
}, {"id": 1092, "name": "比利时", "provinces": []}, {"id": 1138, "name": "毛里塔尼亚", "provinces": []}, {
    "id": 1056,
    "name": "毛里求斯",
    "provinces": []
}, {"id": 1161, "name": "汤加", "provinces": []}, {
    "id": 1071,
    "name": "沙特阿拉伯",
    "provinces": [{"id": 10923, "name": "利雅得"}, {"id": 10918, "name": "吉赞"}, {"id": 10917, "name": "吉达"}, {
        "id": 10916,
        "name": "哈伊勒"
    }, {"id": 10915, "name": "哈费尔巴廷"}, {"id": 10912, "name": "塔伊夫"}, {"id": 10925, "name": "塔布克"}, {
        "id": 10924,
        "name": "塞卡卡"
    }, {"id": 10906, "name": "巴哈"}, {"id": 10913, "name": "布赖代"}, {"id": 10926, "name": "延布"}, {
        "id": 10919,
        "name": "海米斯穆谢特"
    }, {"id": 10922, "name": "纳季兰"}, {"id": 10905, "name": "艾卜哈"}, {"id": 10914, "name": "达曼"}, {
        "id": 10909,
        "name": "阿尔卡里"
    }, {"id": 10910, "name": "阿尔姆巴拉兹"}, {"id": 10908, "name": "阿尔朱拜勒"}, {"id": 10907, "name": "阿尔胡富夫"}, {
        "id": 10911,
        "name": "阿尔阿尔"
    }, {"id": 10920, "name": "麦加"}, {"id": 10921, "name": "麦地那"}]
}, {
    "id": 1022,
    "name": "法国",
    "provinces": [{"id": 10288, "name": "亚眠"}, {"id": 10296, "name": "利摩日"}, {"id": 10301, "name": "南特"}, {
        "id": 10291,
        "name": "卡昂"
    }, {"id": 10307, "name": "图卢兹"}, {"id": 10303, "name": "奥尔良"}, {"id": 10302, "name": "尼斯"}, {
        "id": 10304,
        "name": "巴黎"
    }, {"id": 10294, "name": "弗雷瑞斯"}, {"id": 10299, "name": "梅斯"}, {"id": 10292, "name": "沙隆"}, {
        "id": 10308,
        "name": "瓦朗斯"
    }, {"id": 10293, "name": "第戎"}, {"id": 10286, "name": "艾克斯"}, {"id": 10300, "name": "蒙彼利埃"}, {
        "id": 10290,
        "name": "贝桑松"
    }, {"id": 10295, "name": "里尔"}, {"id": 10297, "name": "里昂"}, {"id": 10289, "name": "阿尔勒"}, {
        "id": 10287,
        "name": "阿雅克修"
    }, {"id": 10305, "name": "雷恩"}, {"id": 10298, "name": "马赛"}, {"id": 10306, "name": "鲁昂"}]
}, {"id": 1149, "name": "波兰", "provinces": []}, {"id": 1066, "name": "波多黎各", "provinces": []}, {
    "id": 1077,
    "name": "泰国",
    "provinces": [{"id": 11016, "name": "乌汶"}, {"id": 11018, "name": "乌泰他尼"}, {"id": 11017, "name": "乌隆"}, {
        "id": 11020,
        "name": "也拉"
    }, {"id": 10987, "name": "佛丕"}, {"id": 10972, "name": "佛统"}, {"id": 11006, "name": "信武里"}, {
        "id": 10960,
        "name": "加拉信"
    }, {"id": 10982, "name": "北大年"}, {"id": 11001, "name": "北揽"}, {"id": 10952, "name": "北柳"}, {
        "id": 11004,
        "name": "北标"
    }, {"id": 10974, "name": "北榄坡"}, {"id": 10962, "name": "北碧"}, {"id": 10967, "name": "华富里"}, {
        "id": 10965,
        "name": "南奔"
    }, {"id": 10984, "name": "博达伦"}, {"id": 10996, "name": "叻丕"}, {"id": 11007, "name": "四色菊"}, {
        "id": 10968,
        "name": "夜丰颂"
    }, {"id": 11003, "name": "夜功"}, {"id": 10991, "name": "大城"}, {"id": 10963, "name": "孔敬"}, {
        "id": 10948,
        "name": "安纳乍能"
    }, {"id": 11008, "name": "宋卡"}, {"id": 10955, "name": "尖竹汶"}, {"id": 10981, "name": "巴吞他尼"}, {
        "id": 10993,
        "name": "巴真"
    }, {"id": 10994, "name": "巴蜀"}, {"id": 10990, "name": "帕"}, {"id": 10985, "name": "帕尧"}, {
        "id": 10979,
        "name": "廊开"
    }, {"id": 10978, "name": "廊莫那浦"}, {"id": 10989, "name": "彭世洛"}, {"id": 10988, "name": "披集"}, {
        "id": 10997,
        "name": "拉农"
    }, {"id": 10983, "name": "攀牙"}, {"id": 10958, "name": "春武里"}, {"id": 10959, "name": "春蓬"}, {
        "id": 10992,
        "name": "普吉"
    }, {"id": 10980, "name": "暖武里"}, {"id": 10950, "name": "曼谷"}, {"id": 10951, "name": "武里南"}, {
        "id": 11005,
        "name": "沙敦"
    }, {"id": 10999, "name": "沙缴"}, {"id": 10975, "name": "洛坤"}, {"id": 10957, "name": "清莱"}, {
        "id": 10956,
        "name": "清迈"
    }, {"id": 10954, "name": "猜也奔"}, {"id": 10953, "name": "猜那"}, {"id": 10969, "name": "玛哈沙拉堪"}, {
        "id": 10961,
        "name": "甘烹碧"
    }, {"id": 10964, "name": "甲米"}, {"id": 10986, "name": "碧差汶"}, {"id": 11019, "name": "程逸"}, {
        "id": 11009,
        "name": "素可泰"
    }, {"id": 11011, "name": "素叻"}, {"id": 11010, "name": "素攀武里"}, {"id": 11012, "name": "素林"}, {
        "id": 10949,
        "name": "红统"
    }, {"id": 10995, "name": "罗勇"}, {"id": 11021, "name": "耶梭通"}, {"id": 11000, "name": "色军"}, {
        "id": 10970,
        "name": "莫达汉"
    }, {"id": 11014, "name": "董里"}, {"id": 11013, "name": "达"}, {"id": 11015, "name": "达叻"}, {
        "id": 10973,
        "name": "那空帕农"
    }, {"id": 10971, "name": "那空那育"}, {"id": 10977, "name": "陶公"}, {"id": 10976, "name": "难"}, {
        "id": 10966,
        "name": "黎"
    }, {"id": 10998, "name": "黎逸"}, {"id": 11002, "name": "龙仔厝"}]
}, {"id": 1041, "name": "泽西岛", "provinces": []}, {"id": 1117, "name": "洪都拉斯", "provinces": []}, {
    "id": 1032,
    "name": "海地",
    "provinces": []
}, {
    "id": 1005,
    "name": "澳大利亚",
    "provinces": [{"id": 10066, "name": "北部地区"}, {"id": 10068, "name": "南澳大利亚"}, {
        "id": 11275,
        "name": "堪培拉"
    }, {"id": 10069, "name": "塔斯马尼亚"}, {"id": 10065, "name": "新南威尔士"}, {"id": 10067, "name": "昆士兰"}, {
        "id": 10070,
        "name": "维多利亚"
    }, {"id": 10071, "name": "西澳大利亚"}]
}, {
    "id": 1035,
    "name": "爱尔兰",
    "provinces": [{"id": 10381, "name": "克莱尔"}, {"id": 10386, "name": "凯里"}, {
        "id": 10390,
        "name": "利特里姆"
    }, {"id": 10391, "name": "利默里克"}, {"id": 10393, "name": "劳斯"}, {"id": 10379, "name": "卡洛"}, {
        "id": 10380,
        "name": "卡范"
    }, {"id": 10387, "name": "基尔代尔"}, {"id": 10388, "name": "基尔肯尼"}, {"id": 10383, "name": "多内加尔"}, {
        "id": 10397,
        "name": "奥法利"
    }, {"id": 10404, "name": "威克洛"}, {"id": 10389, "name": "崂斯"}, {"id": 10385, "name": "戈尔韦"}, {
        "id": 10399,
        "name": "斯莱戈"
    }, {"id": 10392, "name": "朗福德"}, {"id": 10394, "name": "梅奥"}, {"id": 10401, "name": "沃特福德"}, {
        "id": 10382,
        "name": "科克"
    }, {"id": 10395, "name": "米斯"}, {"id": 10398, "name": "罗斯康芒"}, {"id": 10396, "name": "莫内根"}, {
        "id": 10400,
        "name": "蒂珀雷里"
    }, {"id": 10402, "name": "西米斯"}, {"id": 10384, "name": "都柏林"}, {"id": 10403, "name": "韦克斯福德"}]
}, {"id": 1120, "name": "牙买加", "provinces": []}, {"id": 1079, "name": "特立尼达和多巴哥", "provinces": []}, {
    "id": 1097,
    "name": "玻利维亚",
    "provinces": []
}, {
    "id": 1073,
    "name": "瑞典",
    "provinces": [{"id": 10942, "name": "东约特兰"}, {"id": 10941, "name": "乌普萨拉"}, {
        "id": 10935,
        "name": "克鲁努贝里"
    }, {"id": 10936, "name": "北博滕"}, {"id": 10939, "name": "南曼兰"}, {"id": 10934, "name": "卡尔马"}, {
        "id": 10937,
        "name": "厄勒布鲁"
    }, {"id": 10931, "name": "哈兰"}, {"id": 10930, "name": "哥得兰"}, {"id": 10927, "name": "布莱金厄"}, {
        "id": 10933,
        "name": "延雪平"
    }, {"id": 10940, "name": "斯德哥尔摩"}, {"id": 10938, "name": "斯科耐"}, {"id": 10929, "name": "耶夫勒堡"}, {
        "id": 10932,
        "name": "耶姆特兰"
    }, {"id": 10944, "name": "西博滕"}, {"id": 10946, "name": "西曼兰"}, {"id": 10947, "name": "西约特兰"}, {
        "id": 10945,
        "name": "西诺尔兰"
    }, {"id": 10928, "name": "达拉纳"}, {"id": 10943, "name": "韦姆兰"}]
}, {
    "id": 1016,
    "name": "瑞士",
    "provinces": [{"id": 10148, "name": "上瓦尔登"}, {"id": 10147, "name": "下瓦尔登"}, {
        "id": 10155,
        "name": "乌里"
    }, {"id": 10138, "name": "伯尔尼"}, {"id": 10135, "name": "内阿彭策尔"}, {"id": 10145, "name": "卢塞恩"}, {
        "id": 10153,
        "name": "图尔高"
    }, {"id": 10152, "name": "圣加仑"}, {"id": 10134, "name": "外阿彭策尔"}, {"id": 10136, "name": "巴塞尔"}, {
        "id": 10137,
        "name": "巴塞尔乡村"
    }, {"id": 10139, "name": "弗里堡"}, {"id": 10154, "name": "提契诺"}, {"id": 10150, "name": "施维茨"}, {
        "id": 10140,
        "name": "日内瓦"
    }, {"id": 10142, "name": "格劳宾登"}, {"id": 10141, "name": "格拉鲁斯"}, {"id": 10158, "name": "楚格"}, {
        "id": 10143,
        "name": "汝拉"
    }, {"id": 10156, "name": "沃"}, {"id": 10149, "name": "沙夫豪森"}, {"id": 10144, "name": "洛桑"}, {
        "id": 10157,
        "name": "瓦莱"
    }, {"id": 10151, "name": "索洛图恩"}, {"id": 10146, "name": "纳沙泰尔"}, {"id": 10159, "name": "苏黎世"}, {
        "id": 10133,
        "name": "阿尔高"
    }]
}, {"id": 1166, "name": "瓦努阿图", "provinces": []}, {"id": 1069, "name": "留尼旺岛", "provinces": []}, {
    "id": 1008,
    "name": "百慕大",
    "provinces": []
}, {"id": 1027, "name": "直布罗陀", "provinces": []}, {"id": 1046, "name": "科威特", "provinces": []}, {
    "id": 1146,
    "name": "秘鲁",
    "provinces": []
}, {"id": 1121, "name": "约旦", "provinces": []}, {"id": 1140, "name": "纳米比亚", "provinces": []}, {
    "id": 1136,
    "name": "缅甸",
    "provinces": []
}, {"id": 1151, "name": "罗马尼亚", "provinces": []}, {
    "id": 1082,
    "name": "美国",
    "provinces": [{"id": 11146, "name": "亚利桑那"}, {"id": 11157, "name": "伊利诺斯州"}, {
        "id": 11154,
        "name": "佐治亚"
    }, {"id": 11153, "name": "佛罗里达"}, {"id": 11189, "name": "佛蒙特"}, {"id": 11179, "name": "俄亥俄"}, {
        "id": 11180,
        "name": "俄克拉荷马"
    }, {"id": 11181, "name": "俄勒冈"}, {"id": 11172, "name": "内华达州"}, {"id": 11171, "name": "内布拉斯加"}, {
        "id": 11148,
        "name": "加利福尼亚"
    }, {"id": 11177, "name": "北卡罗来纳"}, {"id": 11178, "name": "北达科他"}, {"id": 11191, "name": "华盛顿"}, {
        "id": 11184,
        "name": "南卡罗来纳"
    }, {"id": 11185, "name": "南达科他"}, {"id": 11158, "name": "印第安那"}, {"id": 11152, "name": "哥伦比亚特区"}, {
        "id": 11160,
        "name": "堪萨斯"
    }, {"id": 11155, "name": "夏威夷"}, {"id": 11193, "name": "威斯康星"}, {"id": 11182, "name": "宾夕法尼亚"}, {
        "id": 11166,
        "name": "密歇根"
    }, {"id": 11169, "name": "密苏里"}, {"id": 11168, "name": "密西西比"}, {"id": 11150, "name": "康涅狄格"}, {
        "id": 11187,
        "name": "德州"
    }, {"id": 11194, "name": "怀俄明州"}, {"id": 11175, "name": "新墨西哥"}, {"id": 11174, "name": "新泽西"}, {
        "id": 11173,
        "name": "新罕布什尔"
    }, {"id": 11167, "name": "明尼苏达"}, {"id": 11159, "name": "爱荷华"}, {"id": 11156, "name": "爱达荷州"}, {
        "id": 11151,
        "name": "特拉华"
    }, {"id": 11188, "name": "犹他"}, {"id": 11186, "name": "田纳西"}, {"id": 11149, "name": "科罗拉多"}, {
        "id": 11176,
        "name": "纽约"
    }, {"id": 11190, "name": "维吉尼亚"}, {"id": 11163, "name": "缅因"}, {"id": 11183, "name": "罗德岛"}, {
        "id": 11161,
        "name": "肯塔基"
    }, {"id": 11170, "name": "蒙大拿"}, {"id": 11192, "name": "西佛吉尼亚"}, {"id": 11162, "name": "路易斯安那"}, {
        "id": 11144,
        "name": "阿拉巴马"
    }, {"id": 11145, "name": "阿拉斯加"}, {"id": 11147, "name": "阿肯色"}, {"id": 11165, "name": "马萨诸塞"}, {
        "id": 11164,
        "name": "马里兰"
    }]
}, {"id": 1127, "name": "老挝", "provinces": []}, {"id": 1122, "name": "肯尼亚", "provinces": []}, {
    "id": 1113,
    "name": "芬兰",
    "provinces": []
}, {"id": 1154, "name": "苏丹", "provinces": []}, {"id": 1159, "name": "苏里南", "provinces": []}, {
    "id": 1023,
    "name": "英国",
    "provinces": [{"id": 10310, "name": "北爱尔兰"}, {"id": 10312, "name": "威尔士"}, {
        "id": 10311,
        "name": "苏格兰"
    }, {"id": 10309, "name": "英格兰"}]
}, {
    "id": 1062,
    "name": "荷兰",
    "provinces": [{"id": 10760, "name": "乌得勒支"}, {"id": 10761, "name": "佐特尔梅"}, {
        "id": 10762,
        "name": "兹沃勒"
    }, {"id": 10752, "name": "吕伐登"}, {"id": 10749, "name": "哈勒姆"}, {"id": 10745, "name": "埃因霍芬"}, {
        "id": 10744,
        "name": "埃德"
    }, {"id": 10746, "name": "埃门"}, {"id": 10743, "name": "多德雷赫特"}, {"id": 10757, "name": "奈梅亨"}, {
        "id": 10742,
        "name": "布雷达"
    }, {"id": 10747, "name": "恩斯赫德"}, {"id": 10735, "name": "斯海尔托亨博思"}, {"id": 10748, "name": "格罗宁根"}, {
        "id": 10750,
        "name": "海牙"
    }, {"id": 10756, "name": "米德尔堡"}, {"id": 10754, "name": "莱利斯塔德"}, {"id": 10753, "name": "莱顿"}, {
        "id": 10759,
        "name": "蒂尔堡"
    }, {"id": 10738, "name": "阿姆斯特丹"}, {"id": 10736, "name": "阿尔梅勒"}, {"id": 10741, "name": "阿森"}, {
        "id": 10739,
        "name": "阿珀尔多伦"
    }, {"id": 10740, "name": "阿纳姆"}, {"id": 10737, "name": "阿默斯福特"}, {"id": 10751, "name": "霍夫多尔普"}, {
        "id": 10755,
        "name": "马斯特里赫特"
    }, {"id": 10758, "name": "鹿特丹"}]
}, {"id": 1060, "name": "莫桑比克", "provinces": []}, {"id": 1131, "name": "莱索托", "provinces": []}, {
    "id": 1065,
    "name": "菲律宾",
    "provinces": [{"id": 10787, "name": "卡卢坎"}, {"id": 10788, "name": "宿务"}, {"id": 10789, "name": "达沃"}, {
        "id": 10790,
        "name": "马尼拉"
    }]
}, {"id": 1085, "name": "萨摩亚", "provinces": []}, {
    "id": 1067,
    "name": "葡萄牙",
    "provinces": [{"id": 10795, "name": "万福"}, {"id": 10794, "name": "上特拉斯山"}, {
        "id": 10793,
        "name": "上阿连特茹"
    }, {"id": 10798, "name": "下伏日"}, {"id": 10797, "name": "下蒙德古"}, {"id": 10796, "name": "下阿连特茹"}, {
        "id": 10791,
        "name": "中阿连特茹"
    }, {"id": 10806, "name": "丰沙尔"}, {"id": 10813, "name": "内皮尼亚尔北"}, {"id": 10814, "name": "内皮尼亚尔南"}, {
        "id": 10799,
        "name": "内贝拉北"
    }, {"id": 10800, "name": "内贝拉南"}, {"id": 10807, "name": "利巴特茹"}, {"id": 10801, "name": "卡瓦多"}, {
        "id": 10819,
        "name": "塔梅加"
    }, {"id": 10812, "name": "塞图巴尔半岛"}, {"id": 10818, "name": "山后"}, {"id": 10804, "name": "恩特拉杜罗伏日"}, {
        "id": 10803,
        "name": "杜罗"
    }, {"id": 10809, "name": "梅地奥特茹"}, {"id": 10805, "name": "法鲁"}, {"id": 10817, "name": "波尔图"}, {
        "id": 10815,
        "name": "滨海皮尼亚尔"
    }, {"id": 10792, "name": "滨海阿连特茹"}, {"id": 10802, "name": "科瓦贝拉"}, {"id": 10810, "name": "米尼奥-利马"}, {
        "id": 10816,
        "name": "蓬塔德尔加达"
    }, {"id": 10811, "name": "西部"}, {"id": 10808, "name": "里斯本"}]
}, {"id": 1137, "name": "蒙古", "provinces": []}, {
    "id": 1020,
    "name": "西班牙",
    "provinces": [{"id": 10247, "name": "加的斯"}, {"id": 10246, "name": "卡塞雷斯"}, {
        "id": 10248,
        "name": "卡斯特利翁"
    }, {"id": 10270, "name": "卢戈"}, {"id": 10255, "name": "吉普斯夸"}, {"id": 10258, "name": "哈恩"}, {
        "id": 10273,
        "name": "圣克鲁斯-德特内里费"
    }, {"id": 10278, "name": "塔拉戈纳"}, {"id": 10275, "name": "塞哥维亚"}, {"id": 10276, "name": "塞维利亚"}, {
        "id": 10268,
        "name": "奥伦塞"
    }, {"id": 10281, "name": "巴伦西亚"}, {"id": 10282, "name": "巴利亚多利德"}, {"id": 10243, "name": "巴利阿里"}, {
        "id": 10244,
        "name": "巴塞罗那"
    }, {"id": 10242, "name": "巴达霍斯"}, {"id": 10245, "name": "布尔戈斯"}, {"id": 10269, "name": "帕伦西亚"}, {
        "id": 10280,
        "name": "托莱多"
    }, {"id": 10261, "name": "拉斯帕尔马斯"}, {"id": 10259, "name": "拉科鲁尼亚"}, {"id": 10260, "name": "拉里奥哈"}, {
        "id": 10251,
        "name": "昆卡"
    }, {"id": 10253, "name": "格拉纳达"}, {"id": 10274, "name": "桑坦德"}, {"id": 10283, "name": "比斯开"}, {
        "id": 10279,
        "name": "特鲁埃尔"
    }, {"id": 10254, "name": "瓜达拉哈拉"}, {"id": 10250, "name": "科尔多瓦"}, {"id": 10266, "name": "穆尔西亚"}, {
        "id": 10277,
        "name": "索里亚"
    }, {"id": 10267, "name": "纳瓦拉"}, {"id": 10262, "name": "莱昂"}, {"id": 10263, "name": "莱里达"}, {
        "id": 10285,
        "name": "萨拉戈萨"
    }, {"id": 10272, "name": "萨拉曼卡"}, {"id": 10284, "name": "萨莫拉"}, {"id": 10271, "name": "蓬特韦德拉"}, {
        "id": 10252,
        "name": "赫罗纳"
    }, {"id": 10238, "name": "阿利坎特"}, {"id": 10239, "name": "阿尔梅里亚"}, {"id": 10237, "name": "阿尔瓦塞特"}, {
        "id": 10236,
        "name": "阿拉瓦"
    }, {"id": 10240, "name": "阿斯图利亚斯"}, {"id": 10241, "name": "阿维拉"}, {"id": 10249, "name": "雷阿尔城"}, {
        "id": 10256,
        "name": "韦尔瓦"
    }, {"id": 10257, "name": "韦斯卡"}, {"id": 10264, "name": "马德里"}, {"id": 10265, "name": "马拉加"}]
}, {"id": 1096, "name": "贝宁", "provinces": []}, {"id": 1168, "name": "赞比亚", "provinces": []}, {
    "id": 1084,
    "name": "越南",
    "provinces": [{"id": 11220, "name": "河内"}, {"id": 11219, "name": "海防"}, {"id": 11221, "name": "胡志明市"}]
}, {"id": 1090, "name": "阿塞拜疆", "provinces": []}, {"id": 1108, "name": "阿尔及利亚", "provinces": []}, {
    "id": 1088,
    "name": "阿尔巴尼亚",
    "provinces": []
}, {
    "id": 1000,
    "name": "阿拉伯联合酋长国",
    "provinces": [{"id": 10002, "name": "沙迦"}, {"id": 10001, "name": "艾因"}, {"id": 10003, "name": "迪拜"}, {
        "id": 10000,
        "name": "阿布扎比"
    }]
}, {"id": 1145, "name": "阿曼", "provinces": []}, {
    "id": 1003,
    "name": "阿根廷",
    "provinces": [{"id": 10053, "name": "乌斯怀亚"}, {"id": 10055, "name": "克劳斯城"}, {
        "id": 10035,
        "name": "内乌肯"
    }, {"id": 10054, "name": "别德马"}, {"id": 10024, "name": "卡塔马卡"}, {"id": 10051, "name": "圣地亚哥-德尔埃斯特罗"}, {
        "id": 10047,
        "name": "圣尼古拉斯"
    }, {"id": 10048, "name": "圣拉斐尔"}, {"id": 10046, "name": "圣米格尔-德图库曼"}, {"id": 10050, "name": "圣罗莎"}, {
        "id": 10044,
        "name": "圣胡安"
    }, {"id": 10049, "name": "圣菲"}, {"id": 10045, "name": "圣路易斯"}, {"id": 10036, "name": "巴拉那"}, {
        "id": 10022,
        "name": "布兰卡港"
    }, {"id": 10023, "name": "布宜诺斯艾利斯"}, {"id": 10031, "name": "拉普拉塔"}, {"id": 10032, "name": "拉里奥哈"}, {
        "id": 10037,
        "name": "波萨达斯"
    }, {"id": 10052, "name": "特雷利乌"}, {"id": 10029, "name": "福莫萨"}, {"id": 10027, "name": "科尔多瓦"}, {
        "id": 10028,
        "name": "科连特斯"
    }, {"id": 10038, "name": "罗森"}, {"id": 10042, "name": "罗萨里奥"}, {"id": 10026, "name": "肯考迪娅"}, {
        "id": 10030,
        "name": "胡胡伊"
    }, {"id": 10043, "name": "萨尔塔"}, {"id": 10041, "name": "里奥加耶戈斯"}, {"id": 10040, "name": "里奥夸尔托"}, {
        "id": 10025,
        "name": "里瓦达维亚海军准将城"
    }, {"id": 10034, "name": "门多萨"}, {"id": 10039, "name": "雷西斯滕匹亚"}, {"id": 10033, "name": "马德普拉塔"}]
}, {"id": 1006, "name": "阿鲁巴", "provinces": []}, {
    "id": 1045,
    "name": "韩国",
    "provinces": [{"id": 10626, "name": "仁川"}, {"id": 10622, "name": "光州"}, {"id": 10624, "name": "全罗北道"}, {
        "id": 10625,
        "name": "全罗南道"
    }, {"id": 10620, "name": "大田"}, {"id": 10619, "name": "大邱"}, {"id": 10617, "name": "庆尚北道"}, {
        "id": 10618,
        "name": "庆尚南道"
    }, {"id": 10628, "name": "忠清北道"}, {"id": 10629, "name": "忠清南道"}, {"id": 10621, "name": "江原道"}, {
        "id": 10627,
        "name": "济州岛"
    }, {"id": 10623, "name": "济州特别自治道"}, {"id": 10631, "name": "蔚山"}, {"id": 10616, "name": "釜山"}, {
        "id": 10630,
        "name": "首尔"
    }]
}, {"id": 1053, "name": "马其顿", "provinces": []}, {
    "id": 1057,
    "name": "马尔代夫",
    "provinces": [{"id": 10652, "name": "北尼兰杜"}, {"id": 10651, "name": "北米拉杜马杜卢"}, {
        "id": 10649,
        "name": "北苏瓦迪瓦"
    }, {"id": 10653, "name": "北蒂拉杜马蒂"}, {"id": 10648, "name": "北阿里"}, {"id": 10650, "name": "北马洛斯马杜卢"}, {
        "id": 10658,
        "name": "南尼兰杜"
    }, {"id": 10657, "name": "南米拉杜马杜卢"}, {"id": 10655, "name": "南苏瓦迪瓦"}, {"id": 10659, "name": "南蒂拉杜马蒂"}, {
        "id": 10654,
        "name": "南阿里"
    }, {"id": 10656, "name": "南马洛斯马杜卢"}, {"id": 10643, "name": "哈杜马蒂"}, {"id": 10640, "name": "法迪福卢"}, {
        "id": 10642,
        "name": "福阿穆拉库"
    }, {"id": 10644, "name": "科卢马杜卢"}, {"id": 10647, "name": "穆拉库"}, {"id": 10641, "name": "费利杜"}, {
        "id": 10639,
        "name": "阿杜"
    }, {"id": 10645, "name": "马累"}, {"id": 10646, "name": "马累岛"}]
}, {"id": 1139, "name": "马拉维", "provinces": []}, {
    "id": 1059,
    "name": "马来西亚",
    "provinces": [{"id": 10734, "name": "丁加奴"}, {"id": 10722, "name": "吉兰丹"}, {"id": 10721, "name": "吉打"}, {
        "id": 10723,
        "name": "吉隆坡"
    }, {"id": 10727, "name": "彭亨"}, {"id": 10720, "name": "柔佛"}, {"id": 10726, "name": "森美兰"}, {
        "id": 10730,
        "name": "槟榔屿"
    }, {"id": 10731, "name": "沙巴"}, {"id": 10732, "name": "沙捞越"}, {"id": 10729, "name": "玻璃市"}, {
        "id": 10724,
        "name": "纳闽"
    }, {"id": 10733, "name": "雪兰莪"}, {"id": 10728, "name": "霹雳"}, {"id": 10725, "name": "马六甲"}]
}, {"id": 1052, "name": "马绍尔群岛", "provinces": []}, {"id": 1135, "name": "马达加斯加", "provinces": []}, {
    "id": 1128,
    "name": "黎巴嫩",
    "provinces": []
}];